linux_types = {
  '__unnamed_0x1062a': [ 0x10, {
    'u6_addr32': [0x0, ['array', 4, ['unsigned int']]],
    'u6_addr16': [0x0, ['array', 8, ['unsigned short']]],
    'u6_addr8': [0x0, ['array', 16, ['unsigned char']]],
}],
  'fiemap_extent': [ 0x38, {
    'fe_logical': [0x0, ['unsigned long long']],
    'fe_physical': [0x8, ['unsigned long long']],
    'fe_length': [0x10, ['unsigned long long']],
    'fe_reserved64': [0x18, ['array', 2, ['unsigned long long']]],
    'fe_flags': [0x28, ['unsigned int']],
    'fe_reserved': [0x2c, ['array', 3, ['unsigned int']]],
}],
  'ipstats_mib': [ 0xf8, {
    'mibs': [0x0, ['array', 31, ['unsigned long long']]],
    'syncp': [0xf8, ['u64_stats_sync']],
}],
  'new_utsname': [ 0x186, {
    'sysname': [0x0, ['array', 65, ['char']]],
    'nodename': [0x41, ['array', 65, ['char']]],
    'release': [0x82, ['array', 65, ['char']]],
    'version': [0xc3, ['array', 65, ['char']]],
    'machine': [0x104, ['array', 65, ['char']]],
    'domainname': [0x145, ['array', 65, ['char']]],
}],
  'kmem_cache': [ 0x2b8, {
    'cpu_slab': [0x0, ['pointer', ['kmem_cache_cpu']]],
    'flags': [0x8, ['long']],
    'size': [0x10, ['int']],
    'objsize': [0x14, ['int']],
    'offset': [0x18, ['int']],
    'oo': [0x20, ['kmem_cache_order_objects']],
    'max': [0x28, ['kmem_cache_order_objects']],
    'min': [0x30, ['kmem_cache_order_objects']],
    'allocflags': [0x38, ['unsigned int']],
    'refcount': [0x3c, ['int']],
    'ctor': [0x40, ['pointer', ['void']]],
    'inuse': [0x48, ['int']],
    'align': [0x4c, ['int']],
    'min_partial': [0x50, ['long']],
    'name': [0x58, ['pointer', ['char']]],
    'list': [0x60, ['list_head']],
    'kobj': [0x70, ['kobject']],
    'remote_node_defrag_ratio': [0xb0, ['int']],
    'node': [0xb8, ['array', 64, ['pointer', ['kmem_cache_node']]]],
}],
  '__unnamed_0x152': [ 0x80, {
    'fds_bits': [0x0, ['array', 16, ['long']]],
}],
  'fn_zone': [ 0x70, {
    'fz_next': [0x0, ['pointer', ['fn_zone']]],
    'fz_hash': [0x8, ['pointer', ['hlist_head']]],
    'fz_lock': [0x10, ['__unnamed_0x3399']],
    'fz_hashmask': [0x18, ['unsigned int']],
    'fz_order': [0x1c, ['unsigned char']],
    'fz_revorder': [0x1d, ['unsigned char']],
    'fz_mask': [0x20, ['unsigned int']],
    'fz_embedded_hash': [0x28, ['array', 8, ['hlist_head']]],
    'fz_nent': [0x68, ['int']],
    'fz_divisor': [0x6c, ['int']],
}],
  'rtnl_link_ops': [ 0x80, {
    'list': [0x0, ['list_head']],
    'kind': [0x10, ['pointer', ['char']]],
    'priv_size': [0x18, ['long']],
    'setup': [0x20, ['pointer', ['void']]],
    'maxtype': [0x28, ['int']],
    'policy': [0x30, ['pointer', ['nla_policy']]],
    'validate': [0x38, ['pointer', ['void']]],
    'newlink': [0x40, ['pointer', ['void']]],
    'changelink': [0x48, ['pointer', ['void']]],
    'dellink': [0x50, ['pointer', ['void']]],
    'get_size': [0x58, ['pointer', ['void']]],
    'fill_info': [0x60, ['pointer', ['void']]],
    'get_xstats_size': [0x68, ['pointer', ['void']]],
    'fill_xstats': [0x70, ['pointer', ['void']]],
    'get_tx_queues': [0x78, ['pointer', ['void']]],
}],
  'zone': [ 0x700, {
    'watermark': [0x0, ['array', 3, ['unsigned long']]],
    'percpu_drift_mark': [0x18, ['unsigned long']],
    'lowmem_reserve': [0x20, ['array', 4, ['unsigned long']]],
    'node': [0x40, ['int']],
    'min_unmapped_pages': [0x48, ['unsigned long']],
    'min_slab_pages': [0x50, ['unsigned long']],
    'pageset': [0x58, ['pointer', ['per_cpu_pageset']]],
    'lock': [0x60, ['spinlock']],
    'all_unreclaimable': [0x64, ['int']],
    'span_seqlock': [0x68, ['__unnamed_0x207a']],
    'free_area': [0x70, ['array', 11, ['free_area']]],
    'compact_considered': [0x438, ['unsigned int']],
    'compact_defer_shift': [0x43c, ['unsigned int']],
    '_pad1_': [0x480, ['zone_padding']],
    'lru_lock': [0x480, ['spinlock']],
    'lru': [0x488, ['array', 5, ['zone_lru']]],
    'reclaim_stat': [0x4d8, ['zone_reclaim_stat']],
    'pages_scanned': [0x520, ['unsigned long']],
    'flags': [0x528, ['unsigned long']],
    'vm_stat': [0x530, ['array', 32, ['__unnamed_0x1a5']]],
    'inactive_ratio': [0x630, ['unsigned int']],
    '_pad2_': [0x680, ['zone_padding']],
    'wait_table': [0x680, ['pointer', ['__wait_queue_head']]],
    'wait_table_hash_nr_entries': [0x688, ['unsigned long']],
    'wait_table_bits': [0x690, ['unsigned long']],
    'zone_pgdat': [0x698, ['pointer', ['pglist_data']]],
    'zone_start_pfn': [0x6a0, ['unsigned long']],
    'spanned_pages': [0x6a8, ['unsigned long']],
    'present_pages': [0x6b0, ['unsigned long']],
    'name': [0x6b8, ['pointer', ['char']]],
}],
  'mem_section': [ 0x20, {
    'section_mem_map': [0x0, ['unsigned long']],
    'pageblock_flags': [0x8, ['pointer', ['unsigned long']]],
    'page_cgroup': [0x10, ['pointer', ['page_cgroup']]],
    'pad': [0x18, ['unsigned long']],
}],
  'neigh_statistics': [ 0x58, {
    'allocs': [0x0, ['long']],
    'destroys': [0x8, ['long']],
    'hash_grows': [0x10, ['long']],
    'res_failed': [0x18, ['long']],
    'lookups': [0x20, ['long']],
    'hits': [0x28, ['long']],
    'rcv_probes_mcast': [0x30, ['long']],
    'rcv_probes_ucast': [0x38, ['long']],
    'periodic_gc_runs': [0x40, ['long']],
    'forced_gc_runs': [0x48, ['long']],
    'unres_discards': [0x50, ['long']],
}],
  'device_attribute': [ 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  'dma_attrs': [ 0x8, {
    'flags': [0x0, ['array', 1, ['long']]],
}],
  '__unnamed_0x1c0e': [ 0x10, {
    'fip': [0x0, ['unsigned int']],
    'fcs': [0x4, ['unsigned int']],
    'foo': [0x8, ['unsigned int']],
    'fos': [0xc, ['unsigned int']],
}],
  '__unnamed_0x5c2': [ 0x8, {
    'limit0': [0x0, ['unsigned short']],
    'base0': [0x2, ['unsigned short']],
    'avl': [0x4, ['BitField', {'end_bit': 21, 'start_bit': 20}]],
    'g': [0x4, ['BitField', {'end_bit': 24, 'start_bit': 23}]],
    'p': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'base2': [0x4, ['BitField', {'end_bit': 32, 'start_bit': 24}]],
    'l': [0x4, ['BitField', {'end_bit': 22, 'start_bit': 21}]],
    'base1': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 0}]],
    's': [0x4, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'limit': [0x4, ['BitField', {'end_bit': 20, 'start_bit': 16}]],
    'dpl': [0x4, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'type': [0x4, ['BitField', {'end_bit': 12, 'start_bit': 8}]],
    'd': [0x4, ['BitField', {'end_bit': 23, 'start_bit': 22}]],
}],
  '__unnamed_0xa188': [ 0x10, {
    '_addr': [0x0, ['pointer', ['void']]],
    '_addr_lsb': [0x8, ['short']],
}],
  '__unnamed_0x149af': [ 0x10, {
    'rcu': [0x0, ['rcu_head']],
    '__unnamed_0x149b7': [0x0, ['__unnamed_0x1496e']],
}],
  '__unnamed_0x698': [ 0x8, {
    '__unnamed_0x6a5': [0x0, ['__unnamed_0x5c2']],
    '__unnamed_0x6a0': [0x0, ['__unnamed_0x5a1']],
}],
  'ktime': [ 0x8, {
    'tv64': [0x0, ['long long']],
}],
  'icmp_mib': [ 0xd8, {
    'mibs': [0x0, ['array', 27, ['long']]],
}],
  '__unnamed_0x878b': [ 0x10, {
    'fu_list': [0x0, ['list_head']],
    'fu_rcuhead': [0x0, ['rcu_head']],
}],
  'netns_xfrm': [ 0x340, {
    'state_all': [0x0, ['list_head']],
    'state_bydst': [0x10, ['pointer', ['hlist_head']]],
    'state_bysrc': [0x18, ['pointer', ['hlist_head']]],
    'state_byspi': [0x20, ['pointer', ['hlist_head']]],
    'state_hmask': [0x28, ['unsigned int']],
    'state_num': [0x2c, ['unsigned int']],
    'state_hash_work': [0x30, ['work_struct']],
    'state_gc_list': [0x50, ['hlist_head']],
    'state_gc_work': [0x58, ['work_struct']],
    'km_waitq': [0x78, ['__wait_queue_head']],
    'policy_all': [0x90, ['list_head']],
    'policy_byidx': [0xa0, ['pointer', ['hlist_head']]],
    'policy_idx_hmask': [0xa8, ['unsigned int']],
    'policy_inexact': [0xb0, ['array', 6, ['hlist_head']]],
    'policy_bydst': [0xe0, ['array', 6, ['xfrm_policy_hash']]],
    'policy_count': [0x140, ['array', 6, ['unsigned int']]],
    'policy_hash_work': [0x158, ['work_struct']],
    'nlsk': [0x178, ['pointer', ['sock']]],
    'nlsk_stash': [0x180, ['pointer', ['sock']]],
    'sysctl_aevent_etime': [0x188, ['unsigned int']],
    'sysctl_aevent_rseqth': [0x18c, ['unsigned int']],
    'sysctl_larval_drop': [0x190, ['int']],
    'sysctl_acq_expires': [0x194, ['unsigned int']],
    'sysctl_hdr': [0x198, ['pointer', ['ctl_table_header']]],
    'xfrm4_dst_ops': [0x1c0, ['dst_ops']],
    'xfrm6_dst_ops': [0x280, ['dst_ops']],
}],
  '__unnamed_0x9cb5': [ 0x8, {
    'index': [0x0, ['long']],
    'freelist': [0x0, ['pointer', ['void']]],
}],
  '__unnamed_0x3d4': [ 0x8, {
    'regs': [0x0, ['pointer', ['pt_regs']]],
    'vm86': [0x0, ['pointer', ['kernel_vm86_regs']]],
}],
  'hrtimer_clock_base': [ 0x40, {
    'cpu_base': [0x0, ['pointer', ['hrtimer_cpu_base']]],
    'index': [0x8, ['int']],
    'active': [0x10, ['timerqueue_head']],
    'resolution': [0x20, ['ktime']],
    'get_time': [0x28, ['pointer', ['void']]],
    'softirq_time': [0x30, ['ktime']],
    'offset': [0x38, ['ktime']],
}],
  '__unnamed_0x1340c': [ 0x10, {
    'skc_bind_node': [0x0, ['pointer', ['void']]],
    'skc_portaddr_node': [0x0, ['hlist_nulls_node']],
}],
  'inet_peer': [ 0x50, {
    'avl_left': [0x0, ['pointer', ['inet_peer']]],
    'avl_right': [0x8, ['pointer', ['inet_peer']]],
    'daddr': [0x10, ['inetpeer_addr']],
    'avl_height': [0x24, ['unsigned int']],
    'unused': [0x28, ['list_head']],
    'dtime': [0x38, ['unsigned int']],
    'refcnt': [0x3c, ['__unnamed_0x38e']],
    '__unnamed_0x1424b': [0x40, ['__unnamed_0x149af']],
}],
  'desc_ptr': [ 0xa, {
    'size': [0x0, ['unsigned short']],
    'address': [0x2, ['unsigned long']],
}],
  'sysfs_ops': [ 0x10, {
    'show': [0x0, ['pointer', ['void']]],
    'store': [0x8, ['pointer', ['void']]],
}],
  'ethtool_wolinfo': [ 0x14, {
    'cmd': [0x0, ['unsigned int']],
    'supported': [0x4, ['unsigned int']],
    'wolopts': [0x8, ['unsigned int']],
    'sopass': [0xc, ['array', 6, ['unsigned char']]],
}],
  'task_cputime': [ 0x18, {
    'utime': [0x0, ['long']],
    'stime': [0x8, ['long']],
    'sum_exec_runtime': [0x10, ['unsigned long long']],
}],
  'embedded_fd_set': [ 0x8, {
    'fds_bits': [0x0, ['array', 1, ['long']]],
}],
  'timespec': [ 0x10, {
    'tv_sec': [0x0, ['long']],
    'tv_nsec': [0x8, ['long']],
}],
  'ieee_ets': [ 0x3b, {
    'willing': [0x0, ['unsigned char']],
    'ets_cap': [0x1, ['unsigned char']],
    'cbs': [0x2, ['unsigned char']],
    'tc_tx_bw': [0x3, ['array', 8, ['unsigned char']]],
    'tc_rx_bw': [0xb, ['array', 8, ['unsigned char']]],
    'tc_tsa': [0x13, ['array', 8, ['unsigned char']]],
    'prio_tc': [0x1b, ['array', 8, ['unsigned char']]],
    'tc_reco_bw': [0x23, ['array', 8, ['unsigned char']]],
    'tc_reco_tsa': [0x2b, ['array', 8, ['unsigned char']]],
    'reco_prio_tc': [0x33, ['array', 8, ['unsigned char']]],
}],
  'kobj_type': [ 0x28, {
    'release': [0x0, ['pointer', ['void']]],
    'sysfs_ops': [0x8, ['pointer', ['sysfs_ops']]],
    'default_attrs': [0x10, ['pointer', ['pointer', ['attribute']]]],
    'child_ns_type': [0x18, ['pointer', ['void']]],
    'namespace': [0x20, ['pointer', ['void']]],
}],
  'x86_hw_tss': [ 0x80, {
    'reserved1': [0x0, ['unsigned int']],
    'sp0': [0x4, ['unsigned long long']],
    'sp1': [0xc, ['unsigned long long']],
    'sp2': [0x14, ['unsigned long long']],
    'reserved2': [0x1c, ['unsigned long long']],
    'ist': [0x24, ['array', 7, ['unsigned long long']]],
    'reserved3': [0x5c, ['unsigned int']],
    'reserved4': [0x60, ['unsigned int']],
    'reserved5': [0x64, ['unsigned short']],
    'io_bitmap_base': [0x66, ['unsigned short']],
}],
  '__unnamed_0x8b12': [ 0x18, {
    'link': [0x0, ['list_head']],
    'state': [0x10, ['int']],
}],
  'hlist_head': [ 0x8, {
    'first': [0x0, ['pointer', ['pointer', ['void']]]],
}],
  '__unnamed_0x1445f': [ 0x10, {
    'opt': [0x0, ['pointer', ['ipv6_txoptions']]],
    'hop_limit': [0x8, ['unsigned char']],
    'tclass': [0x9, ['unsigned char']],
}],
  'xps_dev_maps': [ 0x10, {
    'rcu': [0x0, ['rcu_head']],
    'cpu_map': [0x10, ['array', 0, ['pointer', ['xps_map']]]],
}],
  'ip_options': [ 0xc, {
    'faddr': [0x0, ['unsigned int']],
    'optlen': [0x4, ['unsigned char']],
    'srr': [0x5, ['unsigned char']],
    'rr': [0x6, ['unsigned char']],
    'ts': [0x7, ['unsigned char']],
    'rr_needaddr': [0x8, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'is_changed': [0x8, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ts_needtime': [0x8, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'ts_needaddr': [0x8, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'is_strictroute': [0x8, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'srr_is_hit': [0x8, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'router_alert': [0x9, ['unsigned char']],
    'cipso': [0xa, ['unsigned char']],
    '__pad2': [0xb, ['unsigned char']],
    '__data': [0xc, ['array', 0, ['unsigned char']]],
}],
  'timewait_sock_ops': [ 0x30, {
    'twsk_slab': [0x0, ['pointer', ['kmem_cache']]],
    'twsk_slab_name': [0x8, ['pointer', ['char']]],
    'twsk_obj_size': [0x10, ['unsigned int']],
    'twsk_unique': [0x18, ['pointer', ['void']]],
    'twsk_destructor': [0x20, ['pointer', ['void']]],
    'twsk_getpeer': [0x28, ['pointer', ['void']]],
}],
  'zoneref': [ 0x10, {
    'zone': [0x0, ['pointer', ['zone']]],
    'zone_idx': [0x8, ['int']],
}],
  'poll_table_struct': [ 0x10, {
    'qproc': [0x0, ['pointer', ['void']]],
    'key': [0x8, ['long']],
}],
  'xt_table_info': [ 0x50, {
    'size': [0x0, ['unsigned int']],
    'number': [0x4, ['unsigned int']],
    'initial_entries': [0x8, ['unsigned int']],
    'hook_entry': [0xc, ['array', 5, ['unsigned int']]],
    'underflow': [0x20, ['array', 5, ['unsigned int']]],
    'stacksize': [0x34, ['unsigned int']],
    'stackptr': [0x38, ['pointer', ['unsigned int']]],
    'jumpstack': [0x40, ['pointer', ['pointer', ['pointer', ['void']]]]],
    'entries': [0x48, ['array', 1, ['pointer', ['void']]]],
}],
  'kernel_symbol': [ 0x10, {
    'value': [0x0, ['unsigned long']],
    'name': [0x8, ['pointer', ['char']]],
}],
  'attribute_group': [ 0x18, {
    'name': [0x0, ['pointer', ['char']]],
    'is_visible': [0x8, ['pointer', ['void']]],
    'attrs': [0x10, ['pointer', ['pointer', ['attribute']]]],
}],
  'ethtool_usrip4_spec': [ 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'l4_4_bytes': [0x8, ['unsigned int']],
    'tos': [0xc, ['unsigned char']],
    'ip_ver': [0xd, ['unsigned char']],
    'proto': [0xe, ['unsigned char']],
}],
  'request_sock': [ 0x38, {
    'dl_next': [0x0, ['pointer', ['request_sock']]],
    'mss': [0x8, ['unsigned short']],
    'retrans': [0xa, ['unsigned char']],
    'cookie_ts': [0xb, ['unsigned char']],
    'window_clamp': [0xc, ['unsigned int']],
    'rcv_wnd': [0x10, ['unsigned int']],
    'ts_recent': [0x14, ['unsigned int']],
    'expires': [0x18, ['long']],
    'rsk_ops': [0x20, ['pointer', ['request_sock_ops']]],
    'sk': [0x28, ['pointer', ['sock']]],
    'secid': [0x30, ['unsigned int']],
    'peer_secid': [0x34, ['unsigned int']],
}],
  'gate_struct64': [ 0x10, {
    'offset_low': [0x0, ['unsigned short']],
    'segment': [0x2, ['unsigned short']],
    'ist': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'p': [0x4, ['BitField', {'end_bit': 16, 'start_bit': 15}]],
    'zero0': [0x4, ['BitField', {'end_bit': 8, 'start_bit': 3}]],
    'dpl': [0x4, ['BitField', {'end_bit': 15, 'start_bit': 13}]],
    'type': [0x4, ['BitField', {'end_bit': 13, 'start_bit': 8}]],
    'offset_middle': [0x6, ['unsigned short']],
    'offset_high': [0x8, ['unsigned int']],
    'zero1': [0xc, ['unsigned int']],
}],
  'group_info': [ 0x90, {
    'usage': [0x0, ['__unnamed_0x38e']],
    'ngroups': [0x4, ['int']],
    'nblocks': [0x8, ['int']],
    'small_block': [0xc, ['array', 32, ['unsigned int']]],
    'blocks': [0x90, ['array', 0, ['pointer', ['unsigned int']]]],
}],
  'sigpending': [ 0x18, {
    'list': [0x0, ['list_head']],
    'signal': [0x10, ['__unnamed_0x9f9c']],
}],
  '__unnamed_0xa98b': [ 0x8, {
    'revoked_at': [0x0, ['long']],
    'expiry': [0x0, ['long']],
}],
  'vm_area_struct': [ 0xb8, {
    'vm_mm': [0x0, ['pointer', ['mm_struct']]],
    'vm_start': [0x8, ['long']],
    'vm_end': [0x10, ['long']],
    'vm_next': [0x18, ['pointer', ['vm_area_struct']]],
    'vm_prev': [0x20, ['pointer', ['vm_area_struct']]],
    'vm_page_prot': [0x28, ['pgprot']],
    'vm_flags': [0x30, ['long']],
    'vm_rb': [0x38, ['rb_node']],
    'shared': [0x50, ['__unnamed_0x9d07']],
    'anon_vma_chain': [0x70, ['list_head']],
    'anon_vma': [0x80, ['pointer', ['anon_vma']]],
    'vm_ops': [0x88, ['pointer', ['vm_operations_struct']]],
    'vm_pgoff': [0x90, ['long']],
    'vm_file': [0x98, ['pointer', ['file']]],
    'vm_private_data': [0xa0, ['pointer', ['void']]],
    'vm_truncate_count': [0xa8, ['long']],
    'vm_policy': [0xb0, ['pointer', ['mempolicy']]],
}],
  'paravirt_callee_save': [ 0x8, {
    'func': [0x0, ['pointer', ['void']]],
}],
  'netns_unix': [ 0x10, {
    'sysctl_max_dgram_qlen': [0x0, ['int']],
    'ctl': [0x8, ['pointer', ['ctl_table_header']]],
}],
  'sk_buff': [ 0xf0, {
    'next': [0x0, ['pointer', ['sk_buff']]],
    'prev': [0x8, ['pointer', ['sk_buff']]],
    'tstamp': [0x10, ['ktime']],
    'sk': [0x18, ['pointer', ['sock']]],
    'dev': [0x20, ['pointer', ['net_device']]],
    'cb': [0x28, ['array', 48, ['char']]],
    '_skb_refdst': [0x58, ['long']],
    'sp': [0x60, ['pointer', ['sec_path']]],
    'len': [0x68, ['unsigned int']],
    'data_len': [0x6c, ['unsigned int']],
    'mac_len': [0x70, ['unsigned short']],
    'hdr_len': [0x72, ['unsigned short']],
    '__unnamed_0xd80c': [0x74, ['__unnamed_0xdab5']],
    'priority': [0x78, ['unsigned int']],
    'local_df': [0x7c, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'cloned': [0x7c, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'nohdr': [0x7c, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'nfctinfo': [0x7c, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'ip_summed': [0x7c, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'fclone': [0x7d, ['BitField', {'end_bit': 5, 'start_bit': 3}]],
    'nf_trace': [0x7d, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'pkt_type': [0x7d, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'peeked': [0x7d, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'ipvs_property': [0x7d, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'protocol': [0x7e, ['unsigned short']],
    'destructor': [0x80, ['pointer', ['void']]],
    'nfct': [0x88, ['pointer', ['nf_conntrack']]],
    'nfct_reasm': [0x90, ['pointer', ['sk_buff']]],
    'nf_bridge': [0x98, ['pointer', ['nf_bridge_info']]],
    'skb_iif': [0xa0, ['int']],
    'tc_index': [0xa4, ['unsigned short']],
    'tc_verd': [0xa6, ['unsigned short']],
    'rxhash': [0xa8, ['unsigned int']],
    'queue_mapping': [0xac, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'ooo_okay': [0xae, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'deliver_no_wcard': [0xae, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'ndisc_nodetype': [0xae, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'dma_cookie': [0xb0, ['int']],
    'secmark': [0xb4, ['unsigned int']],
    '__unnamed_0xd9d2': [0xb8, ['__unnamed_0xdad0']],
    'vlan_tci': [0xbc, ['unsigned short']],
    'transport_header': [0xc0, ['unsigned int']],
    'network_header': [0xc4, ['unsigned int']],
    'mac_header': [0xc8, ['unsigned int']],
    'tail': [0xcc, ['unsigned int']],
    'end': [0xd0, ['unsigned int']],
    'head': [0xd8, ['pointer', ['unsigned char']]],
    'data': [0xe0, ['pointer', ['unsigned char']]],
    'truesize': [0xe8, ['unsigned int']],
    'users': [0xec, ['__unnamed_0x38e']],
}],
  'path': [ 0x10, {
    'mnt': [0x0, ['pointer', ['vfsmount']]],
    'dentry': [0x8, ['pointer', ['dentry']]],
}],
  'if_settings': [ 0x10, {
    'type': [0x0, ['unsigned int']],
    'size': [0x4, ['unsigned int']],
    'ifs_ifsu': [0x8, ['__unnamed_0xdd8f']],
}],
  'quota_info': [ 0x118, {
    'flags': [0x0, ['unsigned int']],
    'dqio_mutex': [0x8, ['mutex']],
    'dqonoff_mutex': [0x28, ['mutex']],
    'dqptr_sem': [0x48, ['rw_semaphore']],
    'files': [0x68, ['array', 2, ['pointer', ['inode']]]],
    'info': [0x78, ['array', 2, ['mem_dqinfo']]],
    'ops': [0x108, ['array', 2, ['pointer', ['quota_format_ops']]]],
}],
  'ethtool_test': [ 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'flags': [0x4, ['unsigned int']],
    'reserved': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['unsigned long long']]],
}],
  'pv_lazy_ops': [ 0x10, {
    'enter': [0x0, ['pointer', ['void']]],
    'leave': [0x8, ['pointer', ['void']]],
}],
  'kernel_param_ops': [ 0x18, {
    'set': [0x0, ['pointer', ['void']]],
    'get': [0x8, ['pointer', ['void']]],
    'free': [0x10, ['pointer', ['void']]],
}],
  'fown_struct': [ 0x20, {
    'lock': [0x0, ['__unnamed_0x3377']],
    'pid': [0x8, ['pointer', ['pid']]],
    'pid_type': [0x10, ['Enumeration', {'target': 'int', 'choices': {0: 'PIDTYPE_PID', 1: 'PIDTYPE_PGID', 2: 'PIDTYPE_SID', 3: 'PIDTYPE_MAX'}}]],
    'uid': [0x14, ['unsigned int']],
    'euid': [0x18, ['unsigned int']],
    'signum': [0x1c, ['int']],
}],
  'ctl_table_set': [ 0x20, {
    'list': [0x0, ['list_head']],
    'parent': [0x10, ['pointer', ['ctl_table_set']]],
    'is_seen': [0x18, ['pointer', ['void']]],
}],
  'bin_attribute': [ 0x38, {
    'attr': [0x0, ['attribute']],
    'size': [0x10, ['long']],
    'private': [0x18, ['pointer', ['void']]],
    'read': [0x20, ['pointer', ['void']]],
    'write': [0x28, ['pointer', ['void']]],
    'mmap': [0x30, ['pointer', ['void']]],
}],
  'user_struct': [ 0x70, {
    '__count': [0x0, ['__unnamed_0x38e']],
    'processes': [0x4, ['__unnamed_0x38e']],
    'files': [0x8, ['__unnamed_0x38e']],
    'sigpending': [0xc, ['__unnamed_0x38e']],
    'inotify_watches': [0x10, ['__unnamed_0x38e']],
    'inotify_devs': [0x14, ['__unnamed_0x38e']],
    'fanotify_listeners': [0x18, ['__unnamed_0x38e']],
    'epoll_watches': [0x20, ['__unnamed_0x3b0']],
    'mq_bytes': [0x28, ['long']],
    'locked_shm': [0x30, ['long']],
    'uid_keyring': [0x38, ['pointer', ['key']]],
    'session_keyring': [0x40, ['pointer', ['key']]],
    'uidhash_node': [0x48, ['pointer', ['void']]],
    'uid': [0x58, ['unsigned int']],
    'user_ns': [0x60, ['pointer', ['user_namespace']]],
    'locked_vm': [0x68, ['__unnamed_0x3b0']],
}],
  'nfs_lock_info': [ 0x20, {
    'state': [0x0, ['unsigned int']],
    'owner': [0x8, ['pointer', ['nlm_lockowner']]],
    'list': [0x10, ['list_head']],
}],
  '__unnamed_0x9d07': [ 0x20, {
    'prio_tree_node': [0x0, ['raw_prio_tree_node']],
    'vm_set': [0x0, ['__unnamed_0x9cd4']],
}],
  'sighand_struct': [ 0x828, {
    'count': [0x0, ['__unnamed_0x38e']],
    'action': [0x8, ['array', 64, ['k_sigaction']]],
    'siglock': [0x808, ['spinlock']],
    'signalfd_wqh': [0x810, ['__wait_queue_head']],
}],
  'hh_cache': [ 0x100, {
    'hh_next': [0x0, ['pointer', ['hh_cache']]],
    'hh_refcnt': [0x8, ['__unnamed_0x38e']],
    'hh_type': [0x40, ['unsigned short']],
    'hh_len': [0x42, ['unsigned short']],
    'hh_output': [0x48, ['pointer', ['void']]],
    'hh_lock': [0x50, ['__unnamed_0x3399']],
    'hh_data': [0x58, ['array', 16, ['long']]],
}],
  'inet_sock': [ 0x300, {
    'sk': [0x0, ['sock']],
    'pinet6': [0x268, ['pointer', ['ipv6_pinfo']]],
    'inet_dport': [0x270, ['unsigned short']],
    'inet_num': [0x272, ['unsigned short']],
    'inet_saddr': [0x274, ['unsigned int']],
    'uc_ttl': [0x278, ['short']],
    'cmsg_flags': [0x27a, ['unsigned short']],
    'inet_sport': [0x27c, ['unsigned short']],
    'inet_id': [0x27e, ['unsigned short']],
    'opt': [0x280, ['pointer', ['ip_options']]],
    'tos': [0x288, ['unsigned char']],
    'min_ttl': [0x289, ['unsigned char']],
    'mc_ttl': [0x28a, ['unsigned char']],
    'pmtudisc': [0x28b, ['unsigned char']],
    'freebind': [0x28c, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'mc_loop': [0x28c, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'is_icsk': [0x28c, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'hdrincl': [0x28c, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'transparent': [0x28c, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'nodefrag': [0x28c, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'mc_all': [0x28c, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'recverr': [0x28c, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'mc_index': [0x290, ['int']],
    'mc_addr': [0x294, ['unsigned int']],
    'mc_list': [0x298, ['pointer', ['ip_mc_socklist']]],
    'cork': [0x2a0, ['__unnamed_0x13da2']],
}],
  'request_sock_ops': [ 0x40, {
    'family': [0x0, ['int']],
    'obj_size': [0x4, ['int']],
    'slab': [0x8, ['pointer', ['kmem_cache']]],
    'slab_name': [0x10, ['pointer', ['char']]],
    'rtx_syn_ack': [0x18, ['pointer', ['void']]],
    'send_ack': [0x20, ['pointer', ['void']]],
    'send_reset': [0x28, ['pointer', ['void']]],
    'destructor': [0x30, ['pointer', ['void']]],
    'syn_ack_timeout': [0x38, ['pointer', ['void']]],
}],
  'ipv6_devstat': [ 0x38, {
    'proc_dir_entry': [0x0, ['pointer', ['proc_dir_entry']]],
    'ipv6': [0x8, ['array', 2, ['pointer', ['ipstats_mib']]]],
    'icmpv6': [0x18, ['array', 2, ['pointer', ['icmpv6_mib']]]],
    'icmpv6msg': [0x28, ['array', 2, ['pointer', ['icmpv6msg_mib']]]],
}],
  'memcg_batch_info': [ 0x20, {
    'do_batch': [0x0, ['int']],
    'memcg': [0x8, ['pointer', ['mem_cgroup']]],
    'bytes': [0x10, ['long']],
    'memsw_bytes': [0x18, ['long']],
}],
  'kstat': [ 0x68, {
    'ino': [0x0, ['unsigned long long']],
    'dev': [0x8, ['unsigned int']],
    'mode': [0xc, ['unsigned short']],
    'nlink': [0x10, ['unsigned int']],
    'uid': [0x14, ['unsigned int']],
    'gid': [0x18, ['unsigned int']],
    'rdev': [0x1c, ['unsigned int']],
    'size': [0x20, ['long long']],
    'atime': [0x28, ['timespec']],
    'mtime': [0x38, ['timespec']],
    'ctime': [0x48, ['timespec']],
    'blksize': [0x58, ['long']],
    'blocks': [0x60, ['unsigned long long']],
}],
  'kset_uevent_ops': [ 0x18, {
    'filter': [0x0, ['pointer', ['void']]],
    'name': [0x8, ['pointer', ['void']]],
    'uevent': [0x10, ['pointer', ['void']]],
}],
  'zone_padding': [ 0x0, {
    'x': [0x0, ['array', 0, ['char']]],
}],
  'sched_statistics': [ 0xd8, {
    'wait_start': [0x0, ['unsigned long long']],
    'wait_max': [0x8, ['unsigned long long']],
    'wait_count': [0x10, ['unsigned long long']],
    'wait_sum': [0x18, ['unsigned long long']],
    'iowait_count': [0x20, ['unsigned long long']],
    'iowait_sum': [0x28, ['unsigned long long']],
    'sleep_start': [0x30, ['unsigned long long']],
    'sleep_max': [0x38, ['unsigned long long']],
    'sum_sleep_runtime': [0x40, ['long long']],
    'block_start': [0x48, ['unsigned long long']],
    'block_max': [0x50, ['unsigned long long']],
    'exec_max': [0x58, ['unsigned long long']],
    'slice_max': [0x60, ['unsigned long long']],
    'nr_migrations_cold': [0x68, ['unsigned long long']],
    'nr_failed_migrations_affine': [0x70, ['unsigned long long']],
    'nr_failed_migrations_running': [0x78, ['unsigned long long']],
    'nr_failed_migrations_hot': [0x80, ['unsigned long long']],
    'nr_forced_migrations': [0x88, ['unsigned long long']],
    'nr_wakeups': [0x90, ['unsigned long long']],
    'nr_wakeups_sync': [0x98, ['unsigned long long']],
    'nr_wakeups_migrate': [0xa0, ['unsigned long long']],
    'nr_wakeups_local': [0xa8, ['unsigned long long']],
    'nr_wakeups_remote': [0xb0, ['unsigned long long']],
    'nr_wakeups_affine': [0xb8, ['unsigned long long']],
    'nr_wakeups_affine_attempts': [0xc0, ['unsigned long long']],
    'nr_wakeups_passive': [0xc8, ['unsigned long long']],
    'nr_wakeups_idle': [0xd0, ['unsigned long long']],
}],
  'if_dqinfo': [ 0x18, {
    'dqi_bgrace': [0x0, ['unsigned long long']],
    'dqi_igrace': [0x8, ['unsigned long long']],
    'dqi_flags': [0x10, ['unsigned int']],
    'dqi_valid': [0x14, ['unsigned int']],
}],
  'kobj_uevent_env': [ 0x908, {
    'envp': [0x0, ['array', 32, ['pointer', ['char']]]],
    'envp_idx': [0x100, ['int']],
    'buf': [0x104, ['array', 2048, ['char']]],
    'buflen': [0x904, ['int']],
}],
  'ethtool_coalesce': [ 0x5c, {
    'cmd': [0x0, ['unsigned int']],
    'rx_coalesce_usecs': [0x4, ['unsigned int']],
    'rx_max_coalesced_frames': [0x8, ['unsigned int']],
    'rx_coalesce_usecs_irq': [0xc, ['unsigned int']],
    'rx_max_coalesced_frames_irq': [0x10, ['unsigned int']],
    'tx_coalesce_usecs': [0x14, ['unsigned int']],
    'tx_max_coalesced_frames': [0x18, ['unsigned int']],
    'tx_coalesce_usecs_irq': [0x1c, ['unsigned int']],
    'tx_max_coalesced_frames_irq': [0x20, ['unsigned int']],
    'stats_block_coalesce_usecs': [0x24, ['unsigned int']],
    'use_adaptive_rx_coalesce': [0x28, ['unsigned int']],
    'use_adaptive_tx_coalesce': [0x2c, ['unsigned int']],
    'pkt_rate_low': [0x30, ['unsigned int']],
    'rx_coalesce_usecs_low': [0x34, ['unsigned int']],
    'rx_max_coalesced_frames_low': [0x38, ['unsigned int']],
    'tx_coalesce_usecs_low': [0x3c, ['unsigned int']],
    'tx_max_coalesced_frames_low': [0x40, ['unsigned int']],
    'pkt_rate_high': [0x44, ['unsigned int']],
    'rx_coalesce_usecs_high': [0x48, ['unsigned int']],
    'rx_max_coalesced_frames_high': [0x4c, ['unsigned int']],
    'tx_coalesce_usecs_high': [0x50, ['unsigned int']],
    'tx_max_coalesced_frames_high': [0x54, ['unsigned int']],
    'rate_sample_interval': [0x58, ['unsigned int']],
}],
  'x86_init_irqs': [ 0x18, {
    'pre_vector_init': [0x0, ['pointer', ['void']]],
    'intr_init': [0x8, ['pointer', ['void']]],
    'trap_init': [0x10, ['pointer', ['void']]],
}],
  'ethtool_rx_ntuple': [ 0xb8, {
    'cmd': [0x0, ['unsigned int']],
    'fs': [0x8, ['ethtool_rx_ntuple_flow_spec']],
}],
  'socket_wq': [ 0x40, {
    'wait': [0x0, ['__wait_queue_head']],
    'fasync_list': [0x18, ['pointer', ['fasync_struct']]],
    'rcu': [0x20, ['rcu_head']],
}],
  'netns_frags': [ 0x28, {
    'nqueues': [0x0, ['int']],
    'mem': [0x4, ['__unnamed_0x38e']],
    'lru_list': [0x8, ['list_head']],
    'timeout': [0x18, ['int']],
    'high_thresh': [0x1c, ['int']],
    'low_thresh': [0x20, ['int']],
}],
  'hlist_node': [ 0x10, {
    'next': [0x0, ['pointer', ['pointer', ['void']]]],
    'pprev': [0x8, ['pointer', ['pointer', ['pointer', ['void']]]]],
}],
  'pglist_data': [ 0x4100, {
    'node_zones': [0x0, ['array', 4, ['zone']]],
    'node_zonelists': [0x1c00, ['array', 2, ['zonelist']]],
    'nr_zones': [0x4080, ['int']],
    'node_size_lock': [0x4084, ['spinlock']],
    'node_start_pfn': [0x4088, ['unsigned long']],
    'node_present_pages': [0x4090, ['unsigned long']],
    'node_spanned_pages': [0x4098, ['unsigned long']],
    'node_id': [0x40a0, ['int']],
    'kswapd_wait': [0x40a8, ['__wait_queue_head']],
    'kswapd': [0x40c0, ['pointer', ['task_struct']]],
    'kswapd_max_order': [0x40c8, ['int']],
    'classzone_idx': [0x40cc, ['Enumeration', {'target': 'int', 'choices': {0: 'ZONE_DMA', 1: 'ZONE_DMA32', 2: 'ZONE_NORMAL', 3: 'ZONE_MOVABLE', 4: '__MAX_NR_ZONES'}}]],
}],
  'u64_stats_sync': [ 0x0, {
}],
  'socket': [ 0x30, {
    'state': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'SS_FREE', 1: 'SS_UNCONNECTED', 2: 'SS_CONNECTING', 3: 'SS_CONNECTED', 4: 'SS_DISCONNECTING'}}]],
    'type': [0x4, ['short']],
    'flags': [0x8, ['long']],
    'wq': [0x10, ['pointer', ['socket_wq']]],
    'file': [0x18, ['pointer', ['file']]],
    'sk': [0x20, ['pointer', ['sock']]],
    'ops': [0x28, ['pointer', ['proto_ops']]],
}],
  '__unnamed_0x3377': [ 0x4, {
    'raw_lock': [0x0, ['pointer', ['short']]],
}],
  'pgprot': [ 0x8, {
    'pgprot': [0x0, ['unsigned long']],
}],
  'dentry_operations': [ 0x80, {
    'd_revalidate': [0x0, ['pointer', ['void']]],
    'd_hash': [0x8, ['pointer', ['void']]],
    'd_compare': [0x10, ['pointer', ['void']]],
    'd_delete': [0x18, ['pointer', ['void']]],
    'd_release': [0x20, ['pointer', ['void']]],
    'd_iput': [0x28, ['pointer', ['void']]],
    'd_dname': [0x30, ['pointer', ['void']]],
    'd_automount': [0x38, ['pointer', ['void']]],
    'd_manage': [0x40, ['pointer', ['void']]],
}],
  'hlist_bl_node': [ 0x10, {
    'next': [0x0, ['pointer', ['hlist_bl_node']]],
    'pprev': [0x8, ['pointer', ['pointer', ['hlist_bl_node']]]],
}],
  'attribute': [ 0x10, {
    'name': [0x0, ['pointer', ['char']]],
    'mode': [0x8, ['unsigned int']],
}],
  'dcbnl_rtnl_ops': [ 0x118, {
    'ieee_getets': [0x0, ['pointer', ['void']]],
    'ieee_setets': [0x8, ['pointer', ['void']]],
    'ieee_getpfc': [0x10, ['pointer', ['void']]],
    'ieee_setpfc': [0x18, ['pointer', ['void']]],
    'ieee_getapp': [0x20, ['pointer', ['void']]],
    'ieee_setapp': [0x28, ['pointer', ['void']]],
    'getstate': [0x30, ['pointer', ['void']]],
    'setstate': [0x38, ['pointer', ['void']]],
    'getpermhwaddr': [0x40, ['pointer', ['void']]],
    'setpgtccfgtx': [0x48, ['pointer', ['void']]],
    'setpgbwgcfgtx': [0x50, ['pointer', ['void']]],
    'setpgtccfgrx': [0x58, ['pointer', ['void']]],
    'setpgbwgcfgrx': [0x60, ['pointer', ['void']]],
    'getpgtccfgtx': [0x68, ['pointer', ['void']]],
    'getpgbwgcfgtx': [0x70, ['pointer', ['void']]],
    'getpgtccfgrx': [0x78, ['pointer', ['void']]],
    'getpgbwgcfgrx': [0x80, ['pointer', ['void']]],
    'setpfccfg': [0x88, ['pointer', ['void']]],
    'getpfccfg': [0x90, ['pointer', ['void']]],
    'setall': [0x98, ['pointer', ['void']]],
    'getcap': [0xa0, ['pointer', ['void']]],
    'getnumtcs': [0xa8, ['pointer', ['void']]],
    'setnumtcs': [0xb0, ['pointer', ['void']]],
    'getpfcstate': [0xb8, ['pointer', ['void']]],
    'setpfcstate': [0xc0, ['pointer', ['void']]],
    'getbcncfg': [0xc8, ['pointer', ['void']]],
    'setbcncfg': [0xd0, ['pointer', ['void']]],
    'getbcnrp': [0xd8, ['pointer', ['void']]],
    'setbcnrp': [0xe0, ['pointer', ['void']]],
    'setapp': [0xe8, ['pointer', ['void']]],
    'getapp': [0xf0, ['pointer', ['void']]],
    'getfeatcfg': [0xf8, ['pointer', ['void']]],
    'setfeatcfg': [0x100, ['pointer', ['void']]],
    'getdcbx': [0x108, ['pointer', ['void']]],
    'setdcbx': [0x110, ['pointer', ['void']]],
}],
  '__unnamed_0xdbba': [ 0x10, {
    'clock_rate': [0x0, ['unsigned int']],
    'clock_type': [0x4, ['unsigned int']],
    'loopback': [0x8, ['unsigned short']],
    'slot_map': [0xc, ['unsigned int']],
}],
  'thread_xstate': [ 0x340, {
    'fsave': [0x0, ['i387_fsave_struct']],
    'xsave': [0x0, ['xsave_struct']],
    'soft': [0x0, ['i387_soft_struct']],
    'fxsave': [0x0, ['i387_fxsave_struct']],
}],
  'fib_nh': [ 0x40, {
    'nh_dev': [0x0, ['pointer', ['net_device']]],
    'nh_hash': [0x8, ['pointer', ['void']]],
    'nh_parent': [0x18, ['pointer', ['fib_info']]],
    'nh_flags': [0x20, ['unsigned int']],
    'nh_scope': [0x24, ['unsigned char']],
    'nh_weight': [0x28, ['int']],
    'nh_power': [0x2c, ['int']],
    'nh_tclassid': [0x30, ['unsigned int']],
    'nh_oif': [0x34, ['int']],
    'nh_gw': [0x38, ['unsigned int']],
}],
  'fib_table': [ 0x18, {
    'tb_hlist': [0x0, ['pointer', ['void']]],
    'tb_id': [0x10, ['unsigned int']],
    'tb_default': [0x14, ['int']],
    'tb_data': [0x18, ['array', 0, ['unsigned char']]],
}],
  'class_attribute': [ 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  'coredump_params': [ 0x28, {
    'signr': [0x0, ['long']],
    'regs': [0x8, ['pointer', ['pt_regs']]],
    'file': [0x10, ['pointer', ['file']]],
    'limit': [0x18, ['long']],
    'mm_flags': [0x20, ['long']],
}],
  '__unnamed_0x2fd9': [ 0x8, {
    'seg': [0x0, ['long']],
}],
  'irq_stack_union': [ 0x4000, {
    '__unnamed_0x1fd2': [0x0, ['__unnamed_0x1f80']],
    'irq_stack': [0x0, ['array', 16384, ['char']]],
}],
  'x86_init_paging': [ 0x10, {
    'pagetable_setup_start': [0x0, ['pointer', ['void']]],
    'pagetable_setup_done': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x38e': [ 0x4, {
    'counter': [0x0, ['int']],
}],
  'ipv6_devconf': [ 0x80, {
    'forwarding': [0x0, ['int']],
    'hop_limit': [0x4, ['int']],
    'mtu6': [0x8, ['int']],
    'accept_ra': [0xc, ['int']],
    'accept_redirects': [0x10, ['int']],
    'autoconf': [0x14, ['int']],
    'dad_transmits': [0x18, ['int']],
    'rtr_solicits': [0x1c, ['int']],
    'rtr_solicit_interval': [0x20, ['int']],
    'rtr_solicit_delay': [0x24, ['int']],
    'force_mld_version': [0x28, ['int']],
    'use_tempaddr': [0x2c, ['int']],
    'temp_valid_lft': [0x30, ['int']],
    'temp_prefered_lft': [0x34, ['int']],
    'regen_max_retry': [0x38, ['int']],
    'max_desync_factor': [0x3c, ['int']],
    'max_addresses': [0x40, ['int']],
    'accept_ra_defrtr': [0x44, ['int']],
    'accept_ra_pinfo': [0x48, ['int']],
    'accept_ra_rtr_pref': [0x4c, ['int']],
    'rtr_probe_interval': [0x50, ['int']],
    'accept_ra_rt_info_max_plen': [0x54, ['int']],
    'proxy_ndp': [0x58, ['int']],
    'accept_source_route': [0x5c, ['int']],
    'optimistic_dad': [0x60, ['int']],
    'mc_forwarding': [0x64, ['int']],
    'disable_ipv6': [0x68, ['int']],
    'accept_dad': [0x6c, ['int']],
    'force_tllao': [0x70, ['int']],
    'sysctl': [0x78, ['pointer', ['void']]],
}],
  'fpu': [ 0x8, {
    'state': [0x0, ['pointer', ['thread_xstate']]],
}],
  'cpumask': [ 0x8, {
    'bits': [0x0, ['array', 1, ['unsigned long']]],
}],
  'i387_fxsave_struct': [ 0x200, {
    'cwd': [0x0, ['unsigned short']],
    'swd': [0x2, ['unsigned short']],
    'twd': [0x4, ['unsigned short']],
    'fop': [0x6, ['unsigned short']],
    '__unnamed_0x1ce4': [0x8, ['__unnamed_0x1c54']],
    'mxcsr': [0x18, ['unsigned int']],
    'mxcsr_mask': [0x1c, ['unsigned int']],
    'st_space': [0x20, ['array', 32, ['unsigned int']]],
    'xmm_space': [0xa0, ['array', 64, ['unsigned int']]],
    'padding': [0x1a0, ['array', 12, ['unsigned int']]],
    '__unnamed_0x1d39': [0x1d0, ['__unnamed_0x1c68']],
}],
  'nsproxy': [ 0x30, {
    'count': [0x0, ['__unnamed_0x38e']],
    'uts_ns': [0x8, ['pointer', ['uts_namespace']]],
    'ipc_ns': [0x10, ['pointer', ['ipc_namespace']]],
    'mnt_ns': [0x18, ['pointer', ['mnt_namespace']]],
    'pid_ns': [0x20, ['pointer', ['pid_namespace']]],
    'net_ns': [0x28, ['pointer', ['net']]],
}],
  '__unnamed_0x4a34': [ 0x38, {
    'ldt': [0x0, ['pointer', ['void']]],
    'size': [0x8, ['int']],
    'lock': [0x10, ['mutex']],
    'vdso': [0x30, ['pointer', ['void']]],
}],
  'ifla_vf_info': [ 0x30, {
    'vf': [0x0, ['unsigned int']],
    'mac': [0x4, ['array', 32, ['unsigned char']]],
    'vlan': [0x24, ['unsigned int']],
    'qos': [0x28, ['unsigned int']],
    'tx_rate': [0x2c, ['unsigned int']],
}],
  'nf_bridge_info': [ 0x40, {
    'use': [0x0, ['__unnamed_0x38e']],
    'physindev': [0x8, ['pointer', ['net_device']]],
    'physoutdev': [0x10, ['pointer', ['net_device']]],
    'mask': [0x18, ['unsigned int']],
    'data': [0x20, ['array', 4, ['long']]],
}],
  'per_cpu_pages': [ 0x40, {
    'count': [0x0, ['int']],
    'high': [0x4, ['int']],
    'batch': [0x8, ['int']],
    'lists': [0x10, ['array', 3, ['list_head']]],
}],
  'dma_map_ops': [ 0x70, {
    'alloc_coherent': [0x0, ['pointer', ['void']]],
    'free_coherent': [0x8, ['pointer', ['void']]],
    'map_page': [0x10, ['pointer', ['void']]],
    'unmap_page': [0x18, ['pointer', ['void']]],
    'map_sg': [0x20, ['pointer', ['void']]],
    'unmap_sg': [0x28, ['pointer', ['void']]],
    'sync_single_for_cpu': [0x30, ['pointer', ['void']]],
    'sync_single_for_device': [0x38, ['pointer', ['void']]],
    'sync_sg_for_cpu': [0x40, ['pointer', ['void']]],
    'sync_sg_for_device': [0x48, ['pointer', ['void']]],
    'mapping_error': [0x50, ['pointer', ['void']]],
    'dma_supported': [0x58, ['pointer', ['void']]],
    'set_dma_mask': [0x60, ['pointer', ['void']]],
    'is_phys': [0x68, ['int']],
}],
  'jump_entry': [ 0x18, {
    'code': [0x0, ['unsigned long long']],
    'target': [0x8, ['unsigned long long']],
    'key': [0x10, ['unsigned long long']],
}],
  '__unnamed_0x10b34': [ 0x2, {
    'type': [0x0, ['unsigned char']],
    'code': [0x1, ['unsigned char']],
}],
  'dentry': [ 0xc0, {
    'd_flags': [0x0, ['unsigned int']],
    'd_seq': [0x4, ['seqcount']],
    'd_hash': [0x8, ['hlist_bl_node']],
    'd_parent': [0x18, ['pointer', ['dentry']]],
    'd_name': [0x20, ['qstr']],
    'd_inode': [0x30, ['pointer', ['inode']]],
    'd_iname': [0x38, ['array', 32, ['unsigned char']]],
    'd_count': [0x58, ['unsigned int']],
    'd_lock': [0x5c, ['spinlock']],
    'd_op': [0x60, ['pointer', ['dentry_operations']]],
    'd_sb': [0x68, ['pointer', ['super_block']]],
    'd_time': [0x70, ['long']],
    'd_fsdata': [0x78, ['pointer', ['void']]],
    'd_lru': [0x80, ['list_head']],
    'd_u': [0x90, ['__unnamed_0x66ea']],
    'd_subdirs': [0xa0, ['list_head']],
    'd_alias': [0xb0, ['list_head']],
}],
  'sock_common': [ 0x50, {
    'skc_daddr': [0x0, ['unsigned int']],
    'skc_rcv_saddr': [0x4, ['unsigned int']],
    '__unnamed_0x13472': [0x8, ['__unnamed_0x133dd']],
    'skc_family': [0xc, ['unsigned short']],
    'skc_state': [0xe, ['unsigned char']],
    'skc_reuse': [0xf, ['unsigned char']],
    'skc_bound_dev_if': [0x10, ['int']],
    '__unnamed_0x134b2': [0x18, ['__unnamed_0x1340c']],
    'skc_prot': [0x28, ['pointer', ['proto']]],
    'skc_net': [0x30, ['pointer', ['net']]],
    'skc_dontcopy_begin': [0x38, ['array', 0, ['int']]],
    '__unnamed_0x134e4': [0x38, ['__unnamed_0x1342b']],
    'skc_tx_queue_mapping': [0x48, ['int']],
    'skc_refcnt': [0x4c, ['__unnamed_0x38e']],
    'skc_dontcopy_end': [0x50, ['array', 0, ['int']]],
}],
  'icmpv6msg_mib': [ 0x1000, {
    'mibs': [0x0, ['array', 512, ['long']]],
}],
  'ipv4_devconf': [ 0x78, {
    'sysctl': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['array', 25, ['int']]],
    'state': [0x70, ['array', 1, ['long']]],
}],
  '__unnamed_0x133a0': [ 0x20, {
    'slock': [0x0, ['spinlock']],
    'owned': [0x4, ['int']],
    'wq': [0x8, ['__wait_queue_head']],
}],
  'mpc_cpu': [ 0x14, {
    'type': [0x0, ['unsigned char']],
    'apicid': [0x1, ['unsigned char']],
    'apicver': [0x2, ['unsigned char']],
    'cpuflag': [0x3, ['unsigned char']],
    'cpufeature': [0x4, ['unsigned int']],
    'featureflag': [0x8, ['unsigned int']],
    'reserved': [0xc, ['array', 2, ['unsigned int']]],
}],
  'raw_spinlock': [ 0x4, {
    'raw_lock': [0x0, ['arch_spinlock']],
}],
  'fiemap_extent_info': [ 0x18, {
    'fi_flags': [0x0, ['unsigned int']],
    'fi_extents_mapped': [0x4, ['unsigned int']],
    'fi_extents_max': [0x8, ['unsigned int']],
    'fi_extents_start': [0x10, ['pointer', ['fiemap_extent']]],
}],
  '__unnamed_0x9f9c': [ 0x8, {
    'sig': [0x0, ['array', 1, ['long']]],
}],
  'load_weight': [ 0x10, {
    'weight': [0x0, ['long']],
    'inv_weight': [0x8, ['long']],
}],
  'kmem_cache_node': [ 0x40, {
    'list_lock': [0x0, ['spinlock']],
    'nr_partial': [0x8, ['long']],
    'partial': [0x10, ['list_head']],
    'nr_slabs': [0x20, ['__unnamed_0x3b0']],
    'total_objects': [0x28, ['__unnamed_0x3b0']],
    'full': [0x30, ['list_head']],
}],
  'rb_node': [ 0x18, {
    'rb_parent_color': [0x0, ['long']],
    'rb_right': [0x8, ['pointer', ['rb_node']]],
    'rb_left': [0x10, ['pointer', ['rb_node']]],
}],
  '__unnamed_0xdc36': [ 0x18, {
    't391': [0x0, ['unsigned int']],
    't392': [0x4, ['unsigned int']],
    'n391': [0x8, ['unsigned int']],
    'n392': [0xc, ['unsigned int']],
    'n393': [0x10, ['unsigned int']],
    'lmi': [0x14, ['unsigned short']],
    'dce': [0x16, ['unsigned short']],
}],
  'fib_rules_ops': [ 0xa8, {
    'family': [0x0, ['int']],
    'list': [0x8, ['list_head']],
    'rule_size': [0x18, ['int']],
    'addr_size': [0x1c, ['int']],
    'unresolved_rules': [0x20, ['int']],
    'nr_goto_rules': [0x24, ['int']],
    'action': [0x28, ['pointer', ['void']]],
    'match': [0x30, ['pointer', ['void']]],
    'configure': [0x38, ['pointer', ['void']]],
    'compare': [0x40, ['pointer', ['void']]],
    'fill': [0x48, ['pointer', ['void']]],
    'default_pref': [0x50, ['pointer', ['void']]],
    'nlmsg_payload': [0x58, ['pointer', ['void']]],
    'flush_cache': [0x60, ['pointer', ['void']]],
    'nlgroup': [0x68, ['int']],
    'policy': [0x70, ['pointer', ['nla_policy']]],
    'rules_list': [0x78, ['list_head']],
    'owner': [0x88, ['pointer', ['module']]],
    'fro_net': [0x90, ['pointer', ['net']]],
    'rcu': [0x98, ['rcu_head']],
}],
  'xt_table': [ 0x50, {
    'list': [0x0, ['list_head']],
    'valid_hooks': [0x10, ['unsigned int']],
    'private': [0x18, ['pointer', ['xt_table_info']]],
    'me': [0x20, ['pointer', ['module']]],
    'af': [0x28, ['unsigned char']],
    'priority': [0x2c, ['int']],
    'name': [0x30, ['array', 32, ['char']]],
}],
  'sigval': [ 0x8, {
    'sival_int': [0x0, ['int']],
    'sival_ptr': [0x0, ['pointer', ['void']]],
}],
  'exec_domain': [ 0x58, {
    'name': [0x0, ['pointer', ['char']]],
    'handler': [0x8, ['per_cpu_pageset']],
    'pers_low': [0x10, ['unsigned char']],
    'pers_high': [0x11, ['unsigned char']],
    'signal_map': [0x18, ['pointer', ['long']]],
    'signal_invmap': [0x20, ['pointer', ['long']]],
    'err_map': [0x28, ['pointer', ['map_segment']]],
    'socktype_map': [0x30, ['pointer', ['map_segment']]],
    'sockopt_map': [0x38, ['pointer', ['map_segment']]],
    'af_map': [0x40, ['pointer', ['map_segment']]],
    'module': [0x48, ['pointer', ['module']]],
    'next': [0x50, ['pointer', ['exec_domain']]],
}],
  'nf_hook_ops': [ 0x30, {
    'list': [0x0, ['list_head']],
    'hook': [0x10, ['pointer', ['void']]],
    'owner': [0x18, ['pointer', ['module']]],
    'pf': [0x20, ['unsigned char']],
    'hooknum': [0x24, ['unsigned int']],
    'priority': [0x28, ['int']],
}],
  'netdev_rx_queue': [ 0x80, {
    'rps_map': [0x0, ['pointer', ['rps_map']]],
    'rps_flow_table': [0x8, ['pointer', ['rps_dev_flow_table']]],
    'kobj': [0x10, ['kobject']],
    'dev': [0x50, ['pointer', ['net_device']]],
}],
  'zonelist_cache': [ 0x228, {
    'z_to_n': [0x0, ['array', 256, ['unsigned short']]],
    'fullzones': [0x200, ['array', 4, ['unsigned long']]],
    'last_full_zap': [0x220, ['unsigned long']],
}],
  'cred': [ 0x90, {
    'usage': [0x0, ['__unnamed_0x38e']],
    'uid': [0x4, ['unsigned int']],
    'gid': [0x8, ['unsigned int']],
    'suid': [0xc, ['unsigned int']],
    'sgid': [0x10, ['unsigned int']],
    'euid': [0x14, ['unsigned int']],
    'egid': [0x18, ['unsigned int']],
    'fsuid': [0x1c, ['unsigned int']],
    'fsgid': [0x20, ['unsigned int']],
    'securebits': [0x24, ['unsigned int']],
    'cap_inheritable': [0x28, ['kernel_cap_struct']],
    'cap_permitted': [0x30, ['kernel_cap_struct']],
    'cap_effective': [0x38, ['kernel_cap_struct']],
    'cap_bset': [0x40, ['kernel_cap_struct']],
    'jit_keyring': [0x48, ['unsigned char']],
    'thread_keyring': [0x50, ['pointer', ['key']]],
    'request_key_auth': [0x58, ['pointer', ['key']]],
    'tgcred': [0x60, ['pointer', ['thread_group_cred']]],
    'security': [0x68, ['pointer', ['void']]],
    'user': [0x70, ['pointer', ['user_struct']]],
    'group_info': [0x78, ['pointer', ['group_info']]],
    'rcu': [0x80, ['rcu_head']],
}],
  'pm_qos_request_list': [ 0x30, {
    'list': [0x0, ['plist_node']],
    'pm_qos_class': [0x28, ['int']],
}],
  'module_sect_attrs': [ 0x20, {
    'grp': [0x0, ['attribute_group']],
    'nsections': [0x18, ['unsigned int']],
    'attrs': [0x20, ['array', 0, ['module_sect_attr']]],
}],
  'upid': [ 0x20, {
    'nr': [0x0, ['int']],
    'ns': [0x8, ['pointer', ['pid_namespace']]],
    'pid_chain': [0x10, ['pointer', ['void']]],
}],
  'uts_namespace': [ 0x18c, {
    'kref': [0x0, ['kref']],
    'name': [0x4, ['new_utsname']],
}],
  'hlist_nulls_head': [ 0x8, {
    'first': [0x0, ['pointer', ['hlist_nulls_node']]],
}],
  'netns_packet': [ 0x10, {
    'sklist_lock': [0x0, ['spinlock']],
    'sklist': [0x8, ['hlist_head']],
}],
  'fib_rule': [ 0x78, {
    'list': [0x0, ['list_head']],
    'refcnt': [0x10, ['__unnamed_0x38e']],
    'iifindex': [0x14, ['int']],
    'oifindex': [0x18, ['int']],
    'mark': [0x1c, ['unsigned int']],
    'mark_mask': [0x20, ['unsigned int']],
    'pref': [0x24, ['unsigned int']],
    'flags': [0x28, ['unsigned int']],
    'table': [0x2c, ['unsigned int']],
    'action': [0x30, ['unsigned char']],
    'target': [0x34, ['unsigned int']],
    'ctarget': [0x38, ['pointer', ['fib_rule']]],
    'iifname': [0x40, ['array', 16, ['char']]],
    'oifname': [0x50, ['array', 16, ['char']]],
    'rcu': [0x60, ['rcu_head']],
    'fr_net': [0x70, ['pointer', ['net']]],
}],
  'tcp_mib': [ 0x78, {
    'mibs': [0x0, ['array', 15, ['long']]],
}],
  'rt_hash_bucket': [ 0x8, {
    'chain': [0x0, ['pointer', ['rtable']]],
}],
  'netns_ct': [ 0x80, {
    'count': [0x0, ['__unnamed_0x38e']],
    'expect_count': [0x4, ['unsigned int']],
    'htable_size': [0x8, ['unsigned int']],
    'nf_conntrack_cachep': [0x10, ['pointer', ['kmem_cache']]],
    'hash': [0x18, ['pointer', ['hlist_nulls_head']]],
    'expect_hash': [0x20, ['pointer', ['hlist_head']]],
    'unconfirmed': [0x28, ['hlist_nulls_head']],
    'dying': [0x30, ['hlist_nulls_head']],
    'stat': [0x38, ['pointer', ['ip_conntrack_stat']]],
    'sysctl_events': [0x40, ['int']],
    'sysctl_events_retry_timeout': [0x44, ['unsigned int']],
    'sysctl_acct': [0x48, ['int']],
    'sysctl_checksum': [0x4c, ['int']],
    'sysctl_log_invalid': [0x50, ['unsigned int']],
    'sysctl_header': [0x58, ['pointer', ['ctl_table_header']]],
    'acct_sysctl_header': [0x60, ['pointer', ['ctl_table_header']]],
    'event_sysctl_header': [0x68, ['pointer', ['ctl_table_header']]],
    'hash_vmalloc': [0x70, ['int']],
    'expect_vmalloc': [0x74, ['int']],
    'slabname': [0x78, ['pointer', ['char']]],
}],
  'ctl_table_root': [ 0x40, {
    'root_list': [0x0, ['list_head']],
    'default_set': [0x10, ['ctl_table_set']],
    'lookup': [0x30, ['pointer', ['void']]],
    'permissions': [0x38, ['pointer', ['void']]],
}],
  'ethtool_rx_ntuple_list': [ 0x18, {
    'list': [0x0, ['list_head']],
    'count': [0x10, ['unsigned int']],
}],
  'spinlock': [ 0x4, {
    '__unnamed_0x2066': [0x0, ['__unnamed_0x2046']],
}],
  'x86_init_pci': [ 0x20, {
    'arch_init': [0x0, ['pointer', ['void']]],
    'init': [0x8, ['pointer', ['void']]],
    'init_irq': [0x10, ['pointer', ['void']]],
    'fixup_irqs': [0x18, ['pointer', ['void']]],
}],
  'xt_info_lock': [ 0xc, {
    'lock': [0x0, ['__unnamed_0x3399']],
    'readers': [0x8, ['unsigned char']],
}],
  'plist_node': [ 0x28, {
    'prio': [0x0, ['int']],
    'plist': [0x8, ['plist_head']],
}],
  'ipv6_pinfo': [ 0xb8, {
    'saddr': [0x0, ['in6_addr']],
    'rcv_saddr': [0x10, ['in6_addr']],
    'daddr': [0x20, ['in6_addr']],
    'sticky_pktinfo': [0x30, ['in6_pktinfo']],
    'daddr_cache': [0x48, ['pointer', ['in6_addr']]],
    'saddr_cache': [0x50, ['pointer', ['in6_addr']]],
    'flow_label': [0x58, ['unsigned int']],
    'frag_size': [0x5c, ['unsigned int']],
    '__unused_1': [0x60, ['BitField', {'end_bit': 7, 'start_bit': 0}]],
    'hop_limit': [0x60, ['BitField', {'end_bit': 16, 'start_bit': 7}]],
    '__unused_2': [0x62, ['BitField', {'end_bit': 7, 'start_bit': 1}]],
    'mc_loop': [0x62, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'mcast_hops': [0x62, ['BitField', {'end_bit': 16, 'start_bit': 7}]],
    'mcast_oif': [0x64, ['int']],
    'rxopt': [0x68, ['__unnamed_0x1443d']],
    'sndflow': [0x6a, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'pmtudisc': [0x6a, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'srcprefs': [0x6a, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'dontfrag': [0x6a, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'ipv6only': [0x6a, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'recverr': [0x6a, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'min_hopcount': [0x6c, ['unsigned char']],
    'tclass': [0x6d, ['unsigned char']],
    'padding': [0x6e, ['unsigned char']],
    'dst_cookie': [0x70, ['unsigned int']],
    'ipv6_mc_list': [0x78, ['pointer', ['ipv6_mc_socklist']]],
    'ipv6_ac_list': [0x80, ['pointer', ['ipv6_ac_socklist']]],
    'ipv6_fl_list': [0x88, ['pointer', ['ipv6_fl_socklist']]],
    'opt': [0x90, ['pointer', ['ipv6_txoptions']]],
    'pktoptions': [0x98, ['pointer', ['sk_buff']]],
    'rxpmtu': [0xa0, ['pointer', ['sk_buff']]],
    'cork': [0xa8, ['__unnamed_0x1445f']],
}],
  'rps_map': [ 0x18, {
    'len': [0x0, ['unsigned int']],
    'rcu': [0x8, ['rcu_head']],
    'cpus': [0x18, ['array', 0, ['unsigned short']]],
}],
  'fasync_struct': [ 0x30, {
    'fa_lock': [0x0, ['spinlock']],
    'magic': [0x4, ['int']],
    'fa_fd': [0x8, ['int']],
    'fa_next': [0x10, ['pointer', ['fasync_struct']]],
    'fa_file': [0x18, ['pointer', ['file']]],
    'fa_rcu': [0x20, ['rcu_head']],
}],
  'udp_hslot': [ 0x10, {
    'head': [0x0, ['hlist_nulls_head']],
    'count': [0x8, ['int']],
    'lock': [0xc, ['spinlock']],
}],
  'thread_struct': [ 0xb0, {
    'tls_array': [0x0, ['array', 3, ['desc_struct']]],
    'sp0': [0x18, ['unsigned long']],
    'sp': [0x20, ['unsigned long']],
    'usersp': [0x28, ['unsigned long']],
    'es': [0x30, ['unsigned short']],
    'ds': [0x32, ['unsigned short']],
    'fsindex': [0x34, ['unsigned short']],
    'gsindex': [0x36, ['unsigned short']],
    'fs': [0x38, ['unsigned long']],
    'gs': [0x40, ['unsigned long']],
    'ptrace_bps': [0x48, ['array', 4, ['pointer', ['perf_event']]]],
    'debugreg6': [0x68, ['unsigned long']],
    'ptrace_dr7': [0x70, ['unsigned long']],
    'cr2': [0x78, ['unsigned long']],
    'trap_no': [0x80, ['unsigned long']],
    'error_code': [0x88, ['unsigned long']],
    'fpu': [0x90, ['fpu']],
    'io_bitmap_ptr': [0x98, ['pointer', ['unsigned long']]],
    'iopl': [0xa0, ['unsigned long']],
    'io_bitmap_max': [0xa8, ['unsigned int']],
}],
  'nf_sockopt_ops': [ 0x50, {
    'list': [0x0, ['list_head']],
    'pf': [0x10, ['unsigned char']],
    'set_optmin': [0x14, ['int']],
    'set_optmax': [0x18, ['int']],
    'set': [0x20, ['pointer', ['void']]],
    'compat_set': [0x28, ['pointer', ['void']]],
    'get_optmin': [0x30, ['int']],
    'get_optmax': [0x34, ['int']],
    'get': [0x38, ['pointer', ['void']]],
    'compat_get': [0x40, ['pointer', ['void']]],
    'owner': [0x48, ['pointer', ['module']]],
}],
  'plist_head': [ 0x20, {
    'prio_list': [0x0, ['list_head']],
    'node_list': [0x10, ['list_head']],
}],
  '__unnamed_0x81ff': [ 0x10, {
    'i_rcu': [0x0, ['rcu_head']],
    'i_dentry': [0x0, ['list_head']],
}],
  'dcb_app': [ 0x4, {
    'selector': [0x0, ['unsigned char']],
    'priority': [0x1, ['unsigned char']],
    'protocol': [0x2, ['unsigned short']],
}],
  '__unnamed_0x1c68': [ 0x30, {
    'padding1': [0x0, ['array', 12, ['unsigned int']]],
    'sw_reserved': [0x0, ['array', 12, ['unsigned int']]],
}],
  '__unnamed_0x10b0f': [ 0x4, {
    'sport': [0x0, ['unsigned short']],
    'dport': [0x2, ['unsigned short']],
}],
  'device_type': [ 0x30, {
    'name': [0x0, ['pointer', ['char']]],
    'groups': [0x8, ['pointer', ['pointer', ['attribute_group']]]],
    'uevent': [0x10, ['pointer', ['void']]],
    'devnode': [0x18, ['pointer', ['void']]],
    'release': [0x20, ['pointer', ['void']]],
    'pm': [0x28, ['pointer', ['dev_pm_ops']]],
}],
  'pv_cpu_ops': [ 0x158, {
    'get_debugreg': [0x0, ['pointer', ['void']]],
    'set_debugreg': [0x8, ['pointer', ['void']]],
    'clts': [0x10, ['pointer', ['void']]],
    'read_cr0': [0x18, ['pointer', ['void']]],
    'write_cr0': [0x20, ['pointer', ['void']]],
    'read_cr4_safe': [0x28, ['pointer', ['void']]],
    'read_cr4': [0x30, ['pointer', ['void']]],
    'write_cr4': [0x38, ['pointer', ['void']]],
    'read_cr8': [0x40, ['pointer', ['void']]],
    'write_cr8': [0x48, ['pointer', ['void']]],
    'load_tr_desc': [0x50, ['pointer', ['void']]],
    'load_gdt': [0x58, ['pointer', ['void']]],
    'load_idt': [0x60, ['pointer', ['void']]],
    'store_gdt': [0x68, ['pointer', ['void']]],
    'store_idt': [0x70, ['pointer', ['void']]],
    'set_ldt': [0x78, ['pointer', ['void']]],
    'store_tr': [0x80, ['pointer', ['void']]],
    'load_tls': [0x88, ['pointer', ['void']]],
    'load_gs_index': [0x90, ['pointer', ['void']]],
    'write_ldt_entry': [0x98, ['pointer', ['void']]],
    'write_gdt_entry': [0xa0, ['pointer', ['void']]],
    'write_idt_entry': [0xa8, ['pointer', ['void']]],
    'alloc_ldt': [0xb0, ['pointer', ['void']]],
    'free_ldt': [0xb8, ['pointer', ['void']]],
    'load_sp0': [0xc0, ['pointer', ['void']]],
    'set_iopl_mask': [0xc8, ['pointer', ['void']]],
    'wbinvd': [0xd0, ['pointer', ['void']]],
    'io_delay': [0xd8, ['pointer', ['void']]],
    'cpuid': [0xe0, ['pointer', ['void']]],
    'read_msr': [0xe8, ['pointer', ['void']]],
    'rdmsr_regs': [0xf0, ['pointer', ['void']]],
    'write_msr': [0xf8, ['pointer', ['void']]],
    'wrmsr_regs': [0x100, ['pointer', ['void']]],
    'read_tsc': [0x108, ['pointer', ['void']]],
    'read_pmc': [0x110, ['pointer', ['void']]],
    'read_tscp': [0x118, ['pointer', ['void']]],
    'irq_enable_sysexit': [0x120, ['pointer', ['void']]],
    'usergs_sysret64': [0x128, ['pointer', ['void']]],
    'usergs_sysret32': [0x130, ['pointer', ['void']]],
    'iret': [0x138, ['pointer', ['void']]],
    'swapgs': [0x140, ['pointer', ['void']]],
    'start_context_switch': [0x148, ['pointer', ['void']]],
    'end_context_switch': [0x150, ['pointer', ['void']]],
}],
  '__unnamed_0xa106': [ 0x10, {
    '_pid': [0x0, ['int']],
    '_uid': [0x4, ['unsigned int']],
    '_sigval': [0x8, ['sigval']],
}],
  'sched_info': [ 0x28, {
    'pcount': [0x0, ['long']],
    'run_delay': [0x8, ['unsigned long long']],
    'last_arrival': [0x10, ['unsigned long long']],
    'last_queued': [0x18, ['unsigned long long']],
    'bkl_count': [0x20, ['unsigned int']],
}],
  'nf_conntrack': [ 0x4, {
    'use': [0x0, ['__unnamed_0x38e']],
}],
  'proc_dir_entry': [ 0x98, {
    'low_ino': [0x0, ['unsigned int']],
    'namelen': [0x4, ['unsigned short']],
    'name': [0x8, ['pointer', ['char']]],
    'mode': [0x10, ['unsigned int']],
    'nlink': [0x18, ['long']],
    'uid': [0x20, ['unsigned int']],
    'gid': [0x24, ['unsigned int']],
    'size': [0x28, ['long long']],
    'proc_iops': [0x30, ['pointer', ['inode_operations']]],
    'proc_fops': [0x38, ['pointer', ['file_operations']]],
    'next': [0x40, ['pointer', ['proc_dir_entry']]],
    'parent': [0x48, ['pointer', ['proc_dir_entry']]],
    'subdir': [0x50, ['pointer', ['proc_dir_entry']]],
    'data': [0x58, ['pointer', ['void']]],
    'read_proc': [0x60, ['pointer', ['void']]],
    'write_proc': [0x68, ['pointer', ['void']]],
    'count': [0x70, ['__unnamed_0x38e']],
    'pde_users': [0x74, ['int']],
    'pde_unload_lock': [0x78, ['spinlock']],
    'pde_unload_completion': [0x80, ['pointer', ['completion']]],
    'pde_openers': [0x88, ['list_head']],
}],
  'mod_arch_specific': [ 0x0, {
}],
  'elf64_sym': [ 0x18, {
    'st_name': [0x0, ['unsigned int']],
    'st_info': [0x4, ['unsigned char']],
    'st_other': [0x5, ['unsigned char']],
    'st_shndx': [0x6, ['unsigned short']],
    'st_value': [0x8, ['unsigned long long']],
    'st_size': [0x10, ['unsigned long long']],
}],
  'file_lock': [ 0xb0, {
    'fl_next': [0x0, ['pointer', ['file_lock']]],
    'fl_link': [0x8, ['list_head']],
    'fl_block': [0x18, ['list_head']],
    'fl_owner': [0x28, ['pointer', ['files_struct']]],
    'fl_flags': [0x30, ['unsigned char']],
    'fl_type': [0x31, ['unsigned char']],
    'fl_pid': [0x34, ['unsigned int']],
    'fl_nspid': [0x38, ['pointer', ['pid']]],
    'fl_wait': [0x40, ['__wait_queue_head']],
    'fl_file': [0x58, ['pointer', ['file']]],
    'fl_start': [0x60, ['long long']],
    'fl_end': [0x68, ['long long']],
    'fl_fasync': [0x70, ['pointer', ['fasync_struct']]],
    'fl_break_time': [0x78, ['long']],
    'fl_ops': [0x80, ['pointer', ['file_lock_operations']]],
    'fl_lmops': [0x88, ['pointer', ['lock_manager_operations']]],
    'fl_u': [0x90, ['__unnamed_0x8b3a']],
}],
  'file_system_type': [ 0x48, {
    'name': [0x0, ['pointer', ['char']]],
    'fs_flags': [0x8, ['int']],
    'get_sb': [0x10, ['pointer', ['void']]],
    'mount': [0x18, ['pointer', ['void']]],
    'kill_sb': [0x20, ['pointer', ['void']]],
    'owner': [0x28, ['pointer', ['module']]],
    'next': [0x30, ['pointer', ['file_system_type']]],
    'fs_supers': [0x38, ['list_head']],
    'i_mutex_dir_key': [0x48, ['lock_class_key']],
    's_umount_key': [0x48, ['lock_class_key']],
    'i_alloc_sem_key': [0x48, ['lock_class_key']],
    's_vfs_rename_key': [0x48, ['lock_class_key']],
    's_lock_key': [0x48, ['lock_class_key']],
    'i_mutex_key': [0x48, ['lock_class_key']],
    'i_lock_key': [0x48, ['lock_class_key']],
}],
  'xsave_hdr_struct': [ 0x40, {
    'xstate_bv': [0x0, ['unsigned long long']],
    'reserved1': [0x8, ['array', 2, ['unsigned long long']]],
    'reserved2': [0x18, ['array', 5, ['unsigned long long']]],
}],
  '__unnamed_0x10b7e': [ 0x1, {
    'type': [0x0, ['unsigned char']],
}],
  '__unnamed_0x14337': [ 0x2, {
    'ohopopts': [0x0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'dstopts': [0x0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'hopopts': [0x0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'rxohlim': [0x0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'srcrt': [0x0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'rxhlim': [0x0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'rxinfo': [0x0, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'rxorigdstaddr': [0x0, ['BitField', {'end_bit': 14, 'start_bit': 13}]],
    'rxflow': [0x0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'odstopts': [0x0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'rxtclass': [0x0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'rxpmtu': [0x0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'osrcrt': [0x0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'rxoinfo': [0x0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
}],
  'rps_dev_flow_table': [ 0x38, {
    'mask': [0x0, ['unsigned int']],
    'rcu': [0x8, ['rcu_head']],
    'free_work': [0x18, ['work_struct']],
    'flows': [0x38, ['array', 0, ['rps_dev_flow']]],
}],
  'ip6_sf_list': [ 0x30, {
    'sf_next': [0x0, ['pointer', ['ip6_sf_list']]],
    'sf_addr': [0x8, ['in6_addr']],
    'sf_count': [0x18, ['array', 2, ['long']]],
    'sf_gsresp': [0x28, ['unsigned char']],
    'sf_oldin': [0x29, ['unsigned char']],
    'sf_crcount': [0x2a, ['unsigned char']],
}],
  '__unnamed_0xa083': [ 0x8, {
    '_pid': [0x0, ['int']],
    '_uid': [0x4, ['unsigned int']],
}],
  '__unnamed_0xdab5': [ 0x4, {
    'csum': [0x0, ['unsigned int']],
    '__unnamed_0xdaca': [0x0, ['__unnamed_0xda8d']],
}],
  'sk_buff_head': [ 0x18, {
    'next': [0x0, ['pointer', ['sk_buff']]],
    'prev': [0x8, ['pointer', ['sk_buff']]],
    'qlen': [0x10, ['unsigned int']],
    'lock': [0x14, ['spinlock']],
}],
  'prio_tree_root': [ 0x10, {
    'prio_tree_node': [0x0, ['pointer', ['prio_tree_node']]],
    'index_bits': [0x8, ['unsigned short']],
    'raw': [0xa, ['unsigned short']],
}],
  '__unnamed_0x10ab2': [ 0x6, {
    'daddr': [0x0, ['unsigned short']],
    'saddr': [0x2, ['unsigned short']],
    'scope': [0x4, ['unsigned char']],
}],
  'super_block': [ 0x2c0, {
    's_list': [0x0, ['list_head']],
    's_dev': [0x10, ['unsigned int']],
    's_dirt': [0x14, ['unsigned char']],
    's_blocksize_bits': [0x15, ['unsigned char']],
    's_blocksize': [0x18, ['long']],
    's_maxbytes': [0x20, ['long long']],
    's_type': [0x28, ['pointer', ['file_system_type']]],
    's_op': [0x30, ['pointer', ['super_operations']]],
    'dq_op': [0x38, ['pointer', ['dquot_operations']]],
    's_qcop': [0x40, ['pointer', ['quotactl_ops']]],
    's_export_op': [0x48, ['pointer', ['export_operations']]],
    's_flags': [0x50, ['long']],
    's_magic': [0x58, ['long']],
    's_root': [0x60, ['pointer', ['dentry']]],
    's_umount': [0x68, ['rw_semaphore']],
    's_lock': [0x88, ['mutex']],
    's_count': [0xa8, ['int']],
    's_active': [0xac, ['__unnamed_0x38e']],
    's_security': [0xb0, ['pointer', ['void']]],
    's_xattr': [0xb8, ['pointer', ['pointer', ['xattr_handler']]]],
    's_inodes': [0xc0, ['list_head']],
    's_anon': [0xd0, ['hlist_bl_head']],
    's_files': [0xd8, ['pointer', ['list_head']]],
    's_dentry_lru': [0xe0, ['list_head']],
    's_nr_dentry_unused': [0xf0, ['int']],
    's_bdev': [0xf8, ['pointer', ['block_device']]],
    's_bdi': [0x100, ['pointer', ['backing_dev_info']]],
    's_mtd': [0x108, ['pointer', ['mtd_info']]],
    's_instances': [0x110, ['list_head']],
    's_dquot': [0x120, ['quota_info']],
    's_frozen': [0x238, ['int']],
    's_wait_unfrozen': [0x240, ['__wait_queue_head']],
    's_id': [0x258, ['array', 32, ['char']]],
    's_fs_info': [0x278, ['pointer', ['void']]],
    's_mode': [0x280, ['unsigned int']],
    's_time_gran': [0x284, ['unsigned int']],
    's_vfs_rename_mutex': [0x288, ['mutex']],
    's_subtype': [0x2a8, ['pointer', ['char']]],
    's_options': [0x2b0, ['pointer', ['char']]],
    's_d_op': [0x2b8, ['pointer', ['dentry_operations']]],
}],
  'inet6_dev': [ 0x240, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'addr_list': [0x8, ['list_head']],
    'mc_list': [0x18, ['pointer', ['ifmcaddr6']]],
    'mc_tomb': [0x20, ['pointer', ['ifmcaddr6']]],
    'mc_lock': [0x28, ['spinlock']],
    'mc_qrv': [0x2c, ['unsigned char']],
    'mc_gq_running': [0x2d, ['unsigned char']],
    'mc_ifc_count': [0x2e, ['unsigned char']],
    'mc_v1_seen': [0x30, ['long']],
    'mc_maxdelay': [0x38, ['long']],
    'mc_gq_timer': [0x40, ['timer_list']],
    'mc_ifc_timer': [0x90, ['timer_list']],
    'ac_list': [0xe0, ['pointer', ['ifacaddr6']]],
    'lock': [0xe8, ['__unnamed_0x3377']],
    'refcnt': [0xec, ['__unnamed_0x38e']],
    'if_flags': [0xf0, ['unsigned int']],
    'dead': [0xf4, ['int']],
    'rndid': [0xf8, ['array', 8, ['unsigned char']]],
    'regen_timer': [0x100, ['timer_list']],
    'tempaddr_list': [0x150, ['list_head']],
    'nd_parms': [0x160, ['pointer', ['neigh_parms']]],
    'next': [0x168, ['pointer', ['inet6_dev']]],
    'cnf': [0x170, ['ipv6_devconf']],
    'stats': [0x1f0, ['ipv6_devstat']],
    'tstamp': [0x228, ['long']],
    'rcu': [0x230, ['rcu_head']],
}],
  'sched_class': [ 0xb8, {
    'next': [0x0, ['pointer', ['sched_class']]],
    'enqueue_task': [0x8, ['pointer', ['void']]],
    'dequeue_task': [0x10, ['pointer', ['void']]],
    'yield_task': [0x18, ['pointer', ['void']]],
    'check_preempt_curr': [0x20, ['pointer', ['void']]],
    'pick_next_task': [0x28, ['pointer', ['void']]],
    'put_prev_task': [0x30, ['pointer', ['void']]],
    'select_task_rq': [0x38, ['pointer', ['void']]],
    'pre_schedule': [0x40, ['pointer', ['void']]],
    'post_schedule': [0x48, ['pointer', ['void']]],
    'task_waking': [0x50, ['pointer', ['void']]],
    'task_woken': [0x58, ['pointer', ['void']]],
    'set_cpus_allowed': [0x60, ['pointer', ['void']]],
    'rq_online': [0x68, ['pointer', ['void']]],
    'rq_offline': [0x70, ['pointer', ['void']]],
    'set_curr_task': [0x78, ['pointer', ['void']]],
    'task_tick': [0x80, ['pointer', ['void']]],
    'task_fork': [0x88, ['pointer', ['void']]],
    'switched_from': [0x90, ['pointer', ['void']]],
    'switched_to': [0x98, ['pointer', ['void']]],
    'prio_changed': [0xa0, ['pointer', ['void']]],
    'get_rr_interval': [0xa8, ['pointer', ['void']]],
    'task_move_group': [0xb0, ['pointer', ['void']]],
}],
  '__unnamed_0x1f80': [ 0x30, {
    'gs_base': [0x0, ['array', 40, ['char']]],
    'stack_canary': [0x28, ['unsigned long']],
}],
  'rtnl_link_stats64': [ 0xb8, {
    'rx_packets': [0x0, ['unsigned long long']],
    'tx_packets': [0x8, ['unsigned long long']],
    'rx_bytes': [0x10, ['unsigned long long']],
    'tx_bytes': [0x18, ['unsigned long long']],
    'rx_errors': [0x20, ['unsigned long long']],
    'tx_errors': [0x28, ['unsigned long long']],
    'rx_dropped': [0x30, ['unsigned long long']],
    'tx_dropped': [0x38, ['unsigned long long']],
    'multicast': [0x40, ['unsigned long long']],
    'collisions': [0x48, ['unsigned long long']],
    'rx_length_errors': [0x50, ['unsigned long long']],
    'rx_over_errors': [0x58, ['unsigned long long']],
    'rx_crc_errors': [0x60, ['unsigned long long']],
    'rx_frame_errors': [0x68, ['unsigned long long']],
    'rx_fifo_errors': [0x70, ['unsigned long long']],
    'rx_missed_errors': [0x78, ['unsigned long long']],
    'tx_aborted_errors': [0x80, ['unsigned long long']],
    'tx_carrier_errors': [0x88, ['unsigned long long']],
    'tx_fifo_errors': [0x90, ['unsigned long long']],
    'tx_heartbeat_errors': [0x98, ['unsigned long long']],
    'tx_window_errors': [0xa0, ['unsigned long long']],
    'rx_compressed': [0xa8, ['unsigned long long']],
    'tx_compressed': [0xb0, ['unsigned long long']],
}],
  '__unnamed_0x3926': [ 0x8, {
    'arr': [0x0, ['pointer', ['kparam_array']]],
    'str': [0x0, ['pointer', ['kparam_string']]],
    'arg': [0x0, ['pointer', ['void']]],
}],
  'device_driver': [ 0x68, {
    'name': [0x0, ['pointer', ['char']]],
    'bus': [0x8, ['pointer', ['bus_type']]],
    'owner': [0x10, ['pointer', ['module']]],
    'mod_name': [0x18, ['pointer', ['char']]],
    'suppress_bind_attrs': [0x20, ['unsigned char']],
    'probe': [0x28, ['pointer', ['void']]],
    'remove': [0x30, ['pointer', ['void']]],
    'shutdown': [0x38, ['pointer', ['void']]],
    'suspend': [0x40, ['pointer', ['void']]],
    'resume': [0x48, ['pointer', ['void']]],
    'groups': [0x50, ['pointer', ['pointer', ['attribute_group']]]],
    'pm': [0x58, ['pointer', ['dev_pm_ops']]],
    'p': [0x60, ['pointer', ['driver_private']]],
}],
  '__unnamed_0x1496e': [ 0x10, {
    'rid': [0x0, ['__unnamed_0x38e']],
    'ip_id_count': [0x4, ['__unnamed_0x38e']],
    'tcp_ts': [0x8, ['unsigned int']],
    'tcp_ts_stamp': [0xc, ['unsigned int']],
}],
  'linux_binprm': [ 0xf0, {
    'buf': [0x0, ['array', 128, ['char']]],
    'vma': [0x80, ['pointer', ['vm_area_struct']]],
    'vma_pages': [0x88, ['long']],
    'mm': [0x90, ['pointer', ['mm_struct']]],
    'p': [0x98, ['long']],
    'cap_effective': [0xa0, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'cred_prepared': [0xa0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'recursion_depth': [0xa4, ['unsigned int']],
    'file': [0xa8, ['pointer', ['file']]],
    'cred': [0xb0, ['pointer', ['cred']]],
    'unsafe': [0xb8, ['int']],
    'per_clear': [0xbc, ['unsigned int']],
    'argc': [0xc0, ['int']],
    'envc': [0xc4, ['int']],
    'filename': [0xc8, ['pointer', ['char']]],
    'interp': [0xd0, ['pointer', ['char']]],
    'interp_flags': [0xd8, ['unsigned int']],
    'interp_data': [0xdc, ['unsigned int']],
    'loader': [0xe0, ['long']],
    'exec': [0xe8, ['long']],
}],
  'file_ra_state': [ 0x20, {
    'start': [0x0, ['long']],
    'size': [0x8, ['unsigned int']],
    'async_size': [0xc, ['unsigned int']],
    'ra_pages': [0x10, ['unsigned int']],
    'mmap_miss': [0x14, ['unsigned int']],
    'prev_pos': [0x18, ['long long']],
}],
  'memnode': [ 0x80, {
    'shift': [0x0, ['int']],
    'mapsize': [0x4, ['unsigned int']],
    'map': [0x8, ['pointer', ['short']]],
    'embedded_map': [0x10, ['array', 56, ['short']]],
}],
  '__unnamed_0x10b95': [ 0x4, {
    'icmpt': [0x0, ['__unnamed_0x10b34']],
    'spi': [0x0, ['unsigned int']],
    'dnports': [0x0, ['__unnamed_0x10b59']],
    'mht': [0x0, ['__unnamed_0x10b7e']],
    'gre_key': [0x0, ['unsigned int']],
    'ports': [0x0, ['__unnamed_0x10b0f']],
}],
  'sock': [ 0x268, {
    '__sk_common': [0x0, ['sock_common']],
    'sk_lock': [0x50, ['__unnamed_0x133a0']],
    'sk_receive_queue': [0x70, ['sk_buff_head']],
    'sk_backlog': [0x88, ['__unnamed_0x137ed']],
    'sk_forward_alloc': [0xa0, ['int']],
    'sk_rxhash': [0xa4, ['unsigned int']],
    'sk_drops': [0xa8, ['__unnamed_0x38e']],
    'sk_rcvbuf': [0xac, ['int']],
    'sk_filter': [0xb0, ['pointer', ['sk_filter']]],
    'sk_wq': [0xb8, ['pointer', ['socket_wq']]],
    'sk_async_wait_queue': [0xc0, ['sk_buff_head']],
    'sk_policy': [0xd8, ['array', 2, ['pointer', ['xfrm_policy']]]],
    'sk_flags': [0xe8, ['long']],
    'sk_dst_cache': [0xf0, ['pointer', ['dst_entry']]],
    'sk_dst_lock': [0xf8, ['spinlock']],
    'sk_wmem_alloc': [0xfc, ['__unnamed_0x38e']],
    'sk_omem_alloc': [0x100, ['__unnamed_0x38e']],
    'sk_sndbuf': [0x104, ['int']],
    'sk_write_queue': [0x108, ['sk_buff_head']],
    'sk_userlocks': [0x120, ['BitField', {'end_bit': 8, 'start_bit': 4}]],
    'sk_shutdown': [0x120, ['BitField', {'end_bit': 2, 'start_bit': 0}]],
    'sk_type': [0x120, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'sk_protocol': [0x120, ['BitField', {'end_bit': 16, 'start_bit': 8}]],
    'sk_no_check': [0x120, ['BitField', {'end_bit': 4, 'start_bit': 2}]],
    'sk_wmem_queued': [0x124, ['int']],
    'sk_allocation': [0x128, ['unsigned int']],
    'sk_route_caps': [0x12c, ['int']],
    'sk_route_nocaps': [0x130, ['int']],
    'sk_gso_type': [0x134, ['int']],
    'sk_gso_max_size': [0x138, ['unsigned int']],
    'sk_rcvlowat': [0x13c, ['int']],
    'sk_lingertime': [0x140, ['long']],
    'sk_error_queue': [0x148, ['sk_buff_head']],
    'sk_prot_creator': [0x160, ['pointer', ['proto']]],
    'sk_callback_lock': [0x168, ['__unnamed_0x3377']],
    'sk_err': [0x16c, ['int']],
    'sk_err_soft': [0x170, ['int']],
    'sk_ack_backlog': [0x174, ['unsigned short']],
    'sk_max_ack_backlog': [0x176, ['unsigned short']],
    'sk_priority': [0x178, ['unsigned int']],
    'sk_peer_pid': [0x180, ['pointer', ['pid']]],
    'sk_peer_cred': [0x188, ['pointer', ['cred']]],
    'sk_rcvtimeo': [0x190, ['long']],
    'sk_sndtimeo': [0x198, ['long']],
    'sk_protinfo': [0x1a0, ['pointer', ['void']]],
    'sk_timer': [0x1a8, ['timer_list']],
    'sk_stamp': [0x1f8, ['ktime']],
    'sk_socket': [0x200, ['pointer', ['socket']]],
    'sk_user_data': [0x208, ['pointer', ['void']]],
    'sk_sndmsg_page': [0x210, ['pointer', ['page']]],
    'sk_send_head': [0x218, ['pointer', ['sk_buff']]],
    'sk_sndmsg_off': [0x220, ['unsigned int']],
    'sk_write_pending': [0x224, ['int']],
    'sk_security': [0x228, ['pointer', ['void']]],
    'sk_mark': [0x230, ['unsigned int']],
    'sk_classid': [0x234, ['unsigned int']],
    'sk_state_change': [0x238, ['pointer', ['void']]],
    'sk_data_ready': [0x240, ['pointer', ['void']]],
    'sk_write_space': [0x248, ['pointer', ['void']]],
    'sk_error_report': [0x250, ['pointer', ['void']]],
    'sk_backlog_rcv': [0x258, ['pointer', ['void']]],
    'sk_destruct': [0x260, ['pointer', ['void']]],
}],
  'bug_entry': [ 0xc, {
    'bug_addr_disp': [0x0, ['int']],
    'file_disp': [0x4, ['int']],
    'line': [0x8, ['unsigned short']],
    'flags': [0xa, ['unsigned short']],
}],
  'cpu_itimer': [ 0x18, {
    'expires': [0x0, ['long']],
    'incr': [0x8, ['long']],
    'error': [0x10, ['unsigned int']],
    'incr_error': [0x14, ['unsigned int']],
}],
  'fs_struct': [ 0x38, {
    'users': [0x0, ['int']],
    'lock': [0x4, ['spinlock']],
    'seq': [0x8, ['seqcount']],
    'umask': [0xc, ['int']],
    'in_exec': [0x10, ['int']],
    'root': [0x18, ['path']],
    'pwd': [0x28, ['path']],
}],
  'pidmap': [ 0x10, {
    'nr_free': [0x0, ['__unnamed_0x38e']],
    'page': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x30ac': [ 0x20, {
    'index': [0x0, ['int']],
    'rmtp': [0x8, ['pointer', ['timespec']]],
    'compat_rmtp': [0x10, ['pointer', ['compat_timespec']]],
    'expires': [0x18, ['unsigned long long']],
}],
  '__unnamed_0x2046': [ 0x4, {
    'rlock': [0x0, ['raw_spinlock']],
}],
  '__unnamed_0xa95a': [ 0x20, {
    'rcu': [0x0, ['rcu_head']],
    '__unnamed_0xa963': [0x0, ['__unnamed_0xa914']],
}],
  'ethtool_eeprom': [ 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'magic': [0x4, ['unsigned int']],
    'offset': [0x8, ['unsigned int']],
    'len': [0xc, ['unsigned int']],
    'data': [0x10, ['array', 0, ['unsigned char']]],
}],
  'ip6_sf_socklist': [ 0x8, {
    'sl_max': [0x0, ['unsigned int']],
    'sl_count': [0x4, ['unsigned int']],
    'sl_addr': [0x8, ['array', 0, ['in6_addr']]],
}],
  'ipv6_opt_hdr': [ 0x2, {
    'nexthdr': [0x0, ['unsigned char']],
    'hdrlen': [0x1, ['unsigned char']],
}],
  'netns_ipv4': [ 0x100, {
    'forw_hdr': [0x0, ['pointer', ['ctl_table_header']]],
    'frags_hdr': [0x8, ['pointer', ['ctl_table_header']]],
    'ipv4_hdr': [0x10, ['pointer', ['ctl_table_header']]],
    'route_hdr': [0x18, ['pointer', ['ctl_table_header']]],
    'devconf_all': [0x20, ['pointer', ['ipv4_devconf']]],
    'devconf_dflt': [0x28, ['pointer', ['ipv4_devconf']]],
    'rules_ops': [0x30, ['pointer', ['fib_rules_ops']]],
    'fib_table_hash': [0x38, ['pointer', ['hlist_head']]],
    'fibnl': [0x40, ['pointer', ['sock']]],
    'icmp_sk': [0x48, ['pointer', ['pointer', ['sock']]]],
    'tcp_sock': [0x50, ['pointer', ['sock']]],
    'frags': [0x58, ['netns_frags']],
    'iptable_filter': [0x80, ['pointer', ['xt_table']]],
    'iptable_mangle': [0x88, ['pointer', ['xt_table']]],
    'iptable_raw': [0x90, ['pointer', ['xt_table']]],
    'arptable_filter': [0x98, ['pointer', ['xt_table']]],
    'iptable_security': [0xa0, ['pointer', ['xt_table']]],
    'nat_table': [0xa8, ['pointer', ['xt_table']]],
    'nat_bysource': [0xb0, ['pointer', ['hlist_head']]],
    'nat_htable_size': [0xb8, ['unsigned int']],
    'nat_vmalloced': [0xbc, ['int']],
    'sysctl_icmp_echo_ignore_all': [0xc0, ['int']],
    'sysctl_icmp_echo_ignore_broadcasts': [0xc4, ['int']],
    'sysctl_icmp_ignore_bogus_error_responses': [0xc8, ['int']],
    'sysctl_icmp_ratelimit': [0xcc, ['int']],
    'sysctl_icmp_ratemask': [0xd0, ['int']],
    'sysctl_icmp_errors_use_inbound_ifaddr': [0xd4, ['int']],
    'sysctl_rt_cache_rebuild_count': [0xd8, ['int']],
    'current_rt_cache_rebuild_count': [0xdc, ['int']],
    'rt_genid': [0xe0, ['__unnamed_0x38e']],
    'mr_tables': [0xe8, ['list_head']],
    'mr_rules_ops': [0xf8, ['pointer', ['fib_rules_ops']]],
}],
  'netns_ipv6': [ 0x240, {
    'sysctl': [0x0, ['netns_sysctl_ipv6']],
    'devconf_all': [0x38, ['pointer', ['ipv6_devconf']]],
    'devconf_dflt': [0x40, ['pointer', ['ipv6_devconf']]],
    'frags': [0x48, ['netns_frags']],
    'ip6table_filter': [0x70, ['pointer', ['xt_table']]],
    'ip6table_mangle': [0x78, ['pointer', ['xt_table']]],
    'ip6table_raw': [0x80, ['pointer', ['xt_table']]],
    'ip6table_security': [0x88, ['pointer', ['xt_table']]],
    'ip6_null_entry': [0x90, ['pointer', ['rt6_info']]],
    'rt6_stats': [0x98, ['pointer', ['rt6_statistics']]],
    'ip6_fib_timer': [0xa0, ['timer_list']],
    'fib_table_hash': [0xf0, ['pointer', ['hlist_head']]],
    'fib6_main_tbl': [0xf8, ['pointer', ['fib6_table']]],
    'ip6_dst_ops': [0x100, ['dst_ops']],
    'ip6_rt_gc_expire': [0x1c0, ['unsigned int']],
    'ip6_rt_last_gc': [0x1c8, ['long']],
    'ip6_prohibit_entry': [0x1d0, ['pointer', ['rt6_info']]],
    'ip6_blk_hole_entry': [0x1d8, ['pointer', ['rt6_info']]],
    'fib6_local_tbl': [0x1e0, ['pointer', ['fib6_table']]],
    'fib6_rules_ops': [0x1e8, ['pointer', ['fib_rules_ops']]],
    'icmp_sk': [0x1f0, ['pointer', ['pointer', ['sock']]]],
    'ndisc_sk': [0x1f8, ['pointer', ['sock']]],
    'tcp_sk': [0x200, ['pointer', ['sock']]],
    'igmp_sk': [0x208, ['pointer', ['sock']]],
    'mr6_tables': [0x210, ['list_head']],
    'mr6_rules_ops': [0x220, ['pointer', ['fib_rules_ops']]],
}],
  'ieee_pfc': [ 0x88, {
    'pfc_cap': [0x0, ['unsigned char']],
    'pfc_en': [0x1, ['unsigned char']],
    'mbc': [0x2, ['unsigned char']],
    'delay': [0x4, ['unsigned short']],
    'requests': [0x8, ['array', 8, ['unsigned long long']]],
    'indications': [0x48, ['array', 8, ['unsigned long long']]],
}],
  '__unnamed_0xdb7c': [ 0xc, {
    'clock_rate': [0x0, ['unsigned int']],
    'clock_type': [0x4, ['unsigned int']],
    'loopback': [0x8, ['unsigned short']],
}],
  'sockaddr_un': [ 0x6e, {
    'sun_family': [0x0, ['unsigned short']],
    'sun_path': [0x2, ['array', 108, ['char']]],
}],
  'ethtool_ops': [ 0x188, {
    'get_settings': [0x0, ['pointer', ['void']]],
    'set_settings': [0x8, ['pointer', ['void']]],
    'get_drvinfo': [0x10, ['pointer', ['void']]],
    'get_regs_len': [0x18, ['pointer', ['void']]],
    'get_regs': [0x20, ['pointer', ['void']]],
    'get_wol': [0x28, ['pointer', ['void']]],
    'set_wol': [0x30, ['pointer', ['void']]],
    'get_msglevel': [0x38, ['pointer', ['void']]],
    'set_msglevel': [0x40, ['pointer', ['void']]],
    'nway_reset': [0x48, ['pointer', ['void']]],
    'get_link': [0x50, ['pointer', ['void']]],
    'get_eeprom_len': [0x58, ['pointer', ['void']]],
    'get_eeprom': [0x60, ['pointer', ['void']]],
    'set_eeprom': [0x68, ['pointer', ['void']]],
    'get_coalesce': [0x70, ['pointer', ['void']]],
    'set_coalesce': [0x78, ['pointer', ['void']]],
    'get_ringparam': [0x80, ['pointer', ['void']]],
    'set_ringparam': [0x88, ['pointer', ['void']]],
    'get_pauseparam': [0x90, ['pointer', ['void']]],
    'set_pauseparam': [0x98, ['pointer', ['void']]],
    'get_rx_csum': [0xa0, ['pointer', ['void']]],
    'set_rx_csum': [0xa8, ['pointer', ['void']]],
    'get_tx_csum': [0xb0, ['pointer', ['void']]],
    'set_tx_csum': [0xb8, ['pointer', ['void']]],
    'get_sg': [0xc0, ['pointer', ['void']]],
    'set_sg': [0xc8, ['pointer', ['void']]],
    'get_tso': [0xd0, ['pointer', ['void']]],
    'set_tso': [0xd8, ['pointer', ['void']]],
    'self_test': [0xe0, ['pointer', ['void']]],
    'get_strings': [0xe8, ['pointer', ['void']]],
    'phys_id': [0xf0, ['pointer', ['void']]],
    'get_ethtool_stats': [0xf8, ['pointer', ['void']]],
    'begin': [0x100, ['pointer', ['void']]],
    'complete': [0x108, ['pointer', ['void']]],
    'get_ufo': [0x110, ['pointer', ['void']]],
    'set_ufo': [0x118, ['pointer', ['void']]],
    'get_flags': [0x120, ['pointer', ['void']]],
    'set_flags': [0x128, ['pointer', ['void']]],
    'get_priv_flags': [0x130, ['pointer', ['void']]],
    'set_priv_flags': [0x138, ['pointer', ['void']]],
    'get_sset_count': [0x140, ['pointer', ['void']]],
    'get_rxnfc': [0x148, ['pointer', ['void']]],
    'set_rxnfc': [0x150, ['pointer', ['void']]],
    'flash_device': [0x158, ['pointer', ['void']]],
    'reset': [0x160, ['pointer', ['void']]],
    'set_rx_ntuple': [0x168, ['pointer', ['void']]],
    'get_rx_ntuple': [0x170, ['pointer', ['void']]],
    'get_rxfh_indir': [0x178, ['pointer', ['void']]],
    'set_rxfh_indir': [0x180, ['pointer', ['void']]],
}],
  'dquot_operations': [ 0x40, {
    'write_dquot': [0x0, ['pointer', ['void']]],
    'alloc_dquot': [0x8, ['pointer', ['void']]],
    'destroy_dquot': [0x10, ['pointer', ['void']]],
    'acquire_dquot': [0x18, ['pointer', ['void']]],
    'release_dquot': [0x20, ['pointer', ['void']]],
    'mark_dirty': [0x28, ['pointer', ['void']]],
    'write_info': [0x30, ['pointer', ['void']]],
    'get_reserved_space': [0x38, ['pointer', ['void']]],
}],
  'mpc_bus': [ 0x8, {
    'type': [0x0, ['unsigned char']],
    'busid': [0x1, ['unsigned char']],
    'bustype': [0x2, ['array', 6, ['unsigned char']]],
}],
  'pv_time_ops': [ 0x10, {
    'sched_clock': [0x0, ['pointer', ['void']]],
    'get_tsc_khz': [0x8, ['pointer', ['void']]],
}],
  'delayed_work': [ 0x70, {
    'work': [0x0, ['work_struct']],
    'timer': [0x20, ['timer_list']],
}],
  'device_dma_parameters': [ 0x10, {
    'max_segment_size': [0x0, ['unsigned int']],
    'segment_boundary_mask': [0x8, ['long']],
}],
  'kioctx': [ 0x160, {
    'users': [0x0, ['__unnamed_0x38e']],
    'dead': [0x4, ['int']],
    'mm': [0x8, ['pointer', ['mm_struct']]],
    'user_id': [0x10, ['long']],
    'list': [0x18, ['pointer', ['void']]],
    'wait': [0x28, ['__wait_queue_head']],
    'ctx_lock': [0x40, ['spinlock']],
    'reqs_active': [0x44, ['int']],
    'active_reqs': [0x48, ['list_head']],
    'run_list': [0x58, ['list_head']],
    'max_reqs': [0x68, ['unsigned int']],
    'ring_info': [0x70, ['aio_ring_info']],
    'wq': [0xe0, ['delayed_work']],
    'rcu_head': [0x150, ['rcu_head']],
}],
  'module_sect_attr': [ 0x48, {
    'mattr': [0x0, ['module_attribute']],
    'name': [0x38, ['pointer', ['char']]],
    'address': [0x40, ['long']],
}],
  '__unnamed_0x9c42': [ 0x4, {
    '_mapcount': [0x0, ['__unnamed_0x38e']],
    '__unnamed_0x9c55': [0x0, ['__unnamed_0x9c1d']],
}],
  'kiocb': [ 0xc8, {
    'ki_run_list': [0x0, ['list_head']],
    'ki_flags': [0x10, ['long']],
    'ki_users': [0x18, ['int']],
    'ki_key': [0x1c, ['unsigned int']],
    'ki_filp': [0x20, ['pointer', ['file']]],
    'ki_ctx': [0x28, ['pointer', ['kioctx']]],
    'ki_cancel': [0x30, ['pointer', ['void']]],
    'ki_retry': [0x38, ['pointer', ['void']]],
    'ki_dtor': [0x40, ['pointer', ['void']]],
    'ki_obj': [0x48, ['__unnamed_0xac61']],
    'ki_user_data': [0x50, ['unsigned long long']],
    'ki_pos': [0x58, ['long long']],
    'private': [0x60, ['pointer', ['void']]],
    'ki_opcode': [0x68, ['unsigned short']],
    'ki_nbytes': [0x70, ['long']],
    'ki_buf': [0x78, ['pointer', ['char']]],
    'ki_left': [0x80, ['long']],
    'ki_inline_vec': [0x88, ['iovec']],
    'ki_iovec': [0x98, ['pointer', ['iovec']]],
    'ki_nr_segs': [0xa0, ['long']],
    'ki_cur_seg': [0xa8, ['long']],
    'ki_list': [0xb0, ['list_head']],
    'ki_eventfd': [0xc0, ['pointer', ['eventfd_ctx']]],
}],
  'ctl_table_header': [ 0x58, {
    '__unnamed_0x9a3c': [0x0, ['__unnamed_0xa95a']],
    'unregistering': [0x20, ['pointer', ['completion']]],
    'ctl_table_arg': [0x28, ['pointer', ['ctl_table']]],
    'root': [0x30, ['pointer', ['ctl_table_root']]],
    'set': [0x38, ['pointer', ['ctl_table_set']]],
    'attached_by': [0x40, ['pointer', ['ctl_table']]],
    'attached_to': [0x48, ['pointer', ['ctl_table']]],
    'parent': [0x50, ['pointer', ['ctl_table_header']]],
}],
  'inode_operations': [ 0xc0, {
    'lookup': [0x0, ['pointer', ['void']]],
    'follow_link': [0x8, ['pointer', ['void']]],
    'permission': [0x10, ['pointer', ['void']]],
    'check_acl': [0x18, ['pointer', ['void']]],
    'readlink': [0x20, ['pointer', ['void']]],
    'put_link': [0x28, ['pointer', ['void']]],
    'create': [0x30, ['pointer', ['void']]],
    'link': [0x38, ['pointer', ['void']]],
    'unlink': [0x40, ['pointer', ['void']]],
    'symlink': [0x48, ['pointer', ['void']]],
    'mkdir': [0x50, ['pointer', ['void']]],
    'rmdir': [0x58, ['pointer', ['void']]],
    'mknod': [0x60, ['pointer', ['void']]],
    'rename': [0x68, ['pointer', ['void']]],
    'truncate': [0x70, ['pointer', ['void']]],
    'setattr': [0x78, ['pointer', ['void']]],
    'getattr': [0x80, ['pointer', ['void']]],
    'setxattr': [0x88, ['pointer', ['void']]],
    'getxattr': [0x90, ['pointer', ['void']]],
    'listxattr': [0x98, ['pointer', ['void']]],
    'removexattr': [0xa0, ['pointer', ['void']]],
    'truncate_range': [0xa8, ['pointer', ['void']]],
    'fiemap': [0xb0, ['pointer', ['void']]],
}],
  '__unnamed_0x66ea': [ 0x10, {
    'd_child': [0x0, ['list_head']],
    'd_rcu': [0x0, ['rcu_head']],
}],
  'kref': [ 0x4, {
    'refcount': [0x0, ['__unnamed_0x183']],
}],
  'iovec': [ 0x10, {
    'iov_base': [0x0, ['pointer', ['void']]],
    'iov_len': [0x8, ['long']],
}],
  'modversion_info': [ 0x40, {
    'crc': [0x0, ['unsigned long']],
    'name': [0x8, ['array', 56, ['char']]],
}],
  'net_device': [ 0x6c0, {
    'name': [0x0, ['array', 16, ['char']]],
    'pm_qos_req': [0x10, ['pm_qos_request_list']],
    'name_hlist': [0x40, ['pointer', ['void']]],
    'ifalias': [0x50, ['pointer', ['char']]],
    'mem_end': [0x58, ['long']],
    'mem_start': [0x60, ['long']],
    'base_addr': [0x68, ['long']],
    'irq': [0x70, ['unsigned int']],
    'if_port': [0x74, ['unsigned char']],
    'dma': [0x75, ['unsigned char']],
    'state': [0x78, ['long']],
    'dev_list': [0x80, ['list_head']],
    'napi_list': [0x90, ['list_head']],
    'unreg_list': [0xa0, ['list_head']],
    'features': [0xb0, ['long']],
    'ifindex': [0xb8, ['int']],
    'iflink': [0xbc, ['int']],
    'stats': [0xc0, ['net_device_stats']],
    'rx_dropped': [0x178, ['__unnamed_0x3b0']],
    'wireless_handlers': [0x180, ['pointer', ['iw_handler_def']]],
    'wireless_data': [0x188, ['pointer', ['iw_public_data']]],
    'netdev_ops': [0x190, ['pointer', ['net_device_ops']]],
    'ethtool_ops': [0x198, ['pointer', ['ethtool_ops']]],
    'header_ops': [0x1a0, ['pointer', ['header_ops']]],
    'flags': [0x1a8, ['unsigned int']],
    'gflags': [0x1ac, ['unsigned short']],
    'priv_flags': [0x1b0, ['unsigned int']],
    'padded': [0x1b4, ['unsigned short']],
    'operstate': [0x1b6, ['unsigned char']],
    'link_mode': [0x1b7, ['unsigned char']],
    'mtu': [0x1b8, ['unsigned int']],
    'type': [0x1bc, ['unsigned short']],
    'hard_header_len': [0x1be, ['unsigned short']],
    'needed_headroom': [0x1c0, ['unsigned short']],
    'needed_tailroom': [0x1c2, ['unsigned short']],
    'perm_addr': [0x1c4, ['array', 32, ['unsigned char']]],
    'addr_assign_type': [0x1e4, ['unsigned char']],
    'addr_len': [0x1e5, ['unsigned char']],
    'dev_id': [0x1e6, ['unsigned short']],
    'addr_list_lock': [0x1e8, ['spinlock']],
    'uc': [0x1f0, ['netdev_hw_addr_list']],
    'mc': [0x208, ['netdev_hw_addr_list']],
    'uc_promisc': [0x220, ['int']],
    'promiscuity': [0x224, ['unsigned int']],
    'allmulti': [0x228, ['unsigned int']],
    'vlgrp': [0x230, ['pointer', ['vlan_group']]],
    'atalk_ptr': [0x238, ['pointer', ['void']]],
    'ip_ptr': [0x240, ['pointer', ['in_device']]],
    'dn_ptr': [0x248, ['pointer', ['dn_dev']]],
    'ip6_ptr': [0x250, ['pointer', ['inet6_dev']]],
    'ec_ptr': [0x258, ['pointer', ['void']]],
    'ax25_ptr': [0x260, ['pointer', ['void']]],
    'ieee80211_ptr': [0x268, ['pointer', ['wireless_dev']]],
    'last_rx': [0x270, ['long']],
    'master': [0x278, ['pointer', ['net_device']]],
    'dev_addr': [0x280, ['pointer', ['unsigned char']]],
    'dev_addrs': [0x288, ['netdev_hw_addr_list']],
    'broadcast': [0x2a0, ['array', 32, ['unsigned char']]],
    'queues_kset': [0x2c0, ['pointer', ['kset']]],
    '_rx': [0x2c8, ['pointer', ['netdev_rx_queue']]],
    'num_rx_queues': [0x2d0, ['unsigned int']],
    'real_num_rx_queues': [0x2d4, ['unsigned int']],
    'rx_handler': [0x2d8, ['pointer', ['void']]],
    'rx_handler_data': [0x2e0, ['pointer', ['void']]],
    'ingress_queue': [0x2e8, ['pointer', ['netdev_queue']]],
    '_tx': [0x300, ['pointer', ['netdev_queue']]],
    'num_tx_queues': [0x308, ['unsigned int']],
    'real_num_tx_queues': [0x30c, ['unsigned int']],
    'qdisc': [0x310, ['pointer', ['Qdisc']]],
    'tx_queue_len': [0x318, ['long']],
    'tx_global_lock': [0x320, ['spinlock']],
    'xps_maps': [0x328, ['pointer', ['xps_dev_maps']]],
    'trans_start': [0x330, ['long']],
    'watchdog_timeo': [0x338, ['int']],
    'watchdog_timer': [0x340, ['timer_list']],
    'pcpu_refcnt': [0x390, ['pointer', ['int']]],
    'todo_list': [0x398, ['list_head']],
    'index_hlist': [0x3a8, ['pointer', ['void']]],
    'link_watch_list': [0x3b8, ['list_head']],
    'rtnl_link_state': [0x3c8, ['BitField', {'end_bit': 32, 'start_bit': 16}]],
    'reg_state': [0x3c8, ['BitField', {'end_bit': 16, 'start_bit': 0}]],
    'destructor': [0x3d0, ['pointer', ['void']]],
    'npinfo': [0x3d8, ['pointer', ['netpoll_info']]],
    'nd_net': [0x3e0, ['pointer', ['net']]],
    '__unnamed_0xd659': [0x3e8, ['__unnamed_0x12344']],
    'garp_port': [0x3f0, ['pointer', ['garp_port']]],
    'dev': [0x3f8, ['device']],
    'sysfs_groups': [0x648, ['array', 4, ['pointer', ['attribute_group']]]],
    'rtnl_link_ops': [0x668, ['pointer', ['rtnl_link_ops']]],
    'vlan_features': [0x670, ['long']],
    'gso_max_size': [0x678, ['unsigned int']],
    'dcbnl_ops': [0x680, ['pointer', ['dcbnl_rtnl_ops']]],
    'fcoe_ddp_xid': [0x688, ['unsigned int']],
    'ethtool_ntuple_list': [0x690, ['ethtool_rx_ntuple_list']],
    'phydev': [0x6a8, ['pointer', ['phy_device']]],
}],
  'kmem_cache_order_objects': [ 0x8, {
    'x': [0x0, ['long']],
}],
  'xsave_struct': [ 0x340, {
    'i387': [0x0, ['i387_fxsave_struct']],
    'xsave_hdr': [0x200, ['xsave_hdr_struct']],
    'ymmh': [0x240, ['ymmh_struct']],
}],
  'fib_lookup_arg': [ 0x20, {
    'lookup_ptr': [0x0, ['pointer', ['void']]],
    'result': [0x8, ['pointer', ['void']]],
    'rule': [0x10, ['pointer', ['fib_rule']]],
    'flags': [0x18, ['int']],
}],
  '__unnamed_0xa1ad': [ 0x10, {
    '_band': [0x0, ['long']],
    '_fd': [0x8, ['int']],
}],
  '__unnamed_0xdcac': [ 0x4, {
    'dlci': [0x0, ['unsigned int']],
}],
  'ifacaddr6': [ 0x48, {
    'aca_addr': [0x0, ['in6_addr']],
    'aca_idev': [0x10, ['pointer', ['inet6_dev']]],
    'aca_rt': [0x18, ['pointer', ['rt6_info']]],
    'aca_next': [0x20, ['pointer', ['ifacaddr6']]],
    'aca_users': [0x28, ['int']],
    'aca_refcnt': [0x2c, ['__unnamed_0x38e']],
    'aca_lock': [0x30, ['spinlock']],
    'aca_cstamp': [0x38, ['long']],
    'aca_tstamp': [0x40, ['long']],
}],
  'timer_list': [ 0x50, {
    'entry': [0x0, ['list_head']],
    'expires': [0x10, ['long']],
    'base': [0x18, ['pointer', ['tvec_base']]],
    'function': [0x20, ['pointer', ['void']]],
    'data': [0x28, ['long']],
    'slack': [0x30, ['int']],
    'start_pid': [0x34, ['int']],
    'start_site': [0x38, ['pointer', ['void']]],
    'start_comm': [0x40, ['array', 16, ['char']]],
}],
  'kernel_param': [ 0x20, {
    'name': [0x0, ['pointer', ['char']]],
    'ops': [0x8, ['pointer', ['kernel_param_ops']]],
    'perm': [0x10, ['unsigned short']],
    'flags': [0x12, ['unsigned short']],
    '__unnamed_0x38fc': [0x18, ['__unnamed_0x3926']],
}],
  'ethtool_ah_espip4_spec': [ 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'spi': [0x8, ['unsigned int']],
    'tos': [0xc, ['unsigned char']],
}],
  'seq_operations': [ 0x20, {
    'start': [0x0, ['pointer', ['void']]],
    'stop': [0x8, ['pointer', ['void']]],
    'next': [0x10, ['pointer', ['void']]],
    'show': [0x18, ['pointer', ['void']]],
}],
  'pacct_struct': [ 0x38, {
    'ac_flag': [0x0, ['int']],
    'ac_exitcode': [0x8, ['long']],
    'ac_mem': [0x10, ['long']],
    'ac_utime': [0x18, ['long']],
    'ac_stime': [0x20, ['long']],
    'ac_minflt': [0x28, ['long']],
    'ac_majflt': [0x30, ['long']],
}],
  'device': [ 0x250, {
    'parent': [0x0, ['pointer', ['device']]],
    'p': [0x8, ['pointer', ['device_private']]],
    'kobj': [0x10, ['kobject']],
    'init_name': [0x50, ['pointer', ['char']]],
    'type': [0x58, ['pointer', ['device_type']]],
    'mutex': [0x60, ['mutex']],
    'bus': [0x80, ['pointer', ['bus_type']]],
    'driver': [0x88, ['pointer', ['device_driver']]],
    'platform_data': [0x90, ['pointer', ['void']]],
    'power': [0x98, ['dev_pm_info']],
    'numa_node': [0x1b0, ['int']],
    'dma_mask': [0x1b8, ['pointer', ['unsigned long long']]],
    'coherent_dma_mask': [0x1c0, ['unsigned long long']],
    'dma_parms': [0x1c8, ['pointer', ['device_dma_parameters']]],
    'dma_pools': [0x1d0, ['list_head']],
    'dma_mem': [0x1e0, ['pointer', ['dma_coherent_mem']]],
    'archdata': [0x1e8, ['dev_archdata']],
    'devt': [0x200, ['unsigned int']],
    'devres_lock': [0x204, ['spinlock']],
    'devres_head': [0x208, ['list_head']],
    'knode_class': [0x218, ['klist_node']],
    'class': [0x238, ['pointer', ['class']]],
    'groups': [0x240, ['pointer', ['pointer', ['attribute_group']]]],
    'release': [0x248, ['pointer', ['void']]],
}],
  'x86_platform_ops': [ 0x38, {
    'calibrate_tsc': [0x0, ['pointer', ['void']]],
    'get_wallclock': [0x8, ['pointer', ['void']]],
    'set_wallclock': [0x10, ['pointer', ['void']]],
    'iommu_shutdown': [0x18, ['pointer', ['void']]],
    'is_untracked_pat_range': [0x20, ['pointer', ['void']]],
    'nmi_init': [0x28, ['pointer', ['void']]],
    'i8042_detect': [0x30, ['pointer', ['void']]],
}],
  'class': [ 0x80, {
    'name': [0x0, ['pointer', ['char']]],
    'owner': [0x8, ['pointer', ['module']]],
    'class_attrs': [0x10, ['pointer', ['class_attribute']]],
    'dev_attrs': [0x18, ['pointer', ['device_attribute']]],
    'dev_bin_attrs': [0x20, ['pointer', ['bin_attribute']]],
    'dev_kobj': [0x28, ['pointer', ['kobject']]],
    'dev_uevent': [0x30, ['pointer', ['void']]],
    'devnode': [0x38, ['pointer', ['void']]],
    'class_release': [0x40, ['pointer', ['void']]],
    'dev_release': [0x48, ['pointer', ['void']]],
    'suspend': [0x50, ['pointer', ['void']]],
    'resume': [0x58, ['pointer', ['void']]],
    'ns_type': [0x60, ['pointer', ['kobj_ns_type_operations']]],
    'namespace': [0x68, ['pointer', ['void']]],
    'pm': [0x70, ['pointer', ['dev_pm_ops']]],
    'p': [0x78, ['pointer', ['subsys_private']]],
}],
  '__unnamed_0x13860': [ 0x8, {
    'udp_table': [0x0, ['pointer', ['udp_table']]],
    'hashinfo': [0x0, ['pointer', ['inet_hashinfo']]],
    'raw_hash': [0x0, ['pointer', ['raw_hashinfo']]],
}],
  '__unnamed_0x1492e': [ 0x10, {
    'a4': [0x0, ['unsigned int']],
    'a6': [0x0, ['array', 4, ['unsigned int']]],
}],
  '__unnamed_0x9cd4': [ 0x20, {
    'list': [0x0, ['list_head']],
    'parent': [0x10, ['pointer', ['void']]],
    'head': [0x18, ['pointer', ['vm_area_struct']]],
}],
  'dst_entry': [ 0xd8, {
    'rcu_head': [0x0, ['rcu_head']],
    'child': [0x10, ['pointer', ['dst_entry']]],
    'dev': [0x18, ['pointer', ['net_device']]],
    'error': [0x20, ['short']],
    'obsolete': [0x22, ['short']],
    'flags': [0x24, ['int']],
    'expires': [0x28, ['long']],
    'header_len': [0x30, ['unsigned short']],
    'trailer_len': [0x32, ['unsigned short']],
    'rate_tokens': [0x34, ['unsigned int']],
    'rate_last': [0x38, ['long']],
    'path': [0x40, ['pointer', ['dst_entry']]],
    'neighbour': [0x48, ['pointer', ['neighbour']]],
    'hh': [0x50, ['pointer', ['hh_cache']]],
    'xfrm': [0x58, ['pointer', ['xfrm_state']]],
    'input': [0x60, ['pointer', ['void']]],
    'output': [0x68, ['pointer', ['void']]],
    'ops': [0x70, ['pointer', ['dst_ops']]],
    '_metrics': [0x78, ['array', 14, ['unsigned int']]],
    'tclassid': [0xb0, ['unsigned int']],
    '__pad_to_align_refcnt': [0xb8, ['array', 1, ['long']]],
    '__refcnt': [0xc0, ['__unnamed_0x38e']],
    '__use': [0xc4, ['int']],
    'lastuse': [0xc8, ['long']],
    '__unnamed_0x10126': [0xd0, ['__unnamed_0x13288']],
}],
  'netdev_hw_addr_list': [ 0x18, {
    'list': [0x0, ['list_head']],
    'count': [0x10, ['int']],
}],
  '__unnamed_0xda8d': [ 0x4, {
    'csum_start': [0x0, ['unsigned short']],
    'csum_offset': [0x2, ['unsigned short']],
}],
  '__unnamed_0x3b0': [ 0x8, {
    'counter': [0x0, ['long']],
}],
  'x86_init_timers': [ 0x18, {
    'setup_percpu_clockev': [0x0, ['pointer', ['void']]],
    'tsc_pre_init': [0x8, ['pointer', ['void']]],
    'timer_init': [0x10, ['pointer', ['void']]],
}],
  'inet_ehash_bucket': [ 0x10, {
    'chain': [0x0, ['hlist_nulls_head']],
    'twchain': [0x8, ['hlist_nulls_head']],
}],
  'kobject': [ 0x40, {
    'name': [0x0, ['pointer', ['char']]],
    'entry': [0x8, ['list_head']],
    'parent': [0x18, ['pointer', ['kobject']]],
    'kset': [0x20, ['pointer', ['kset']]],
    'ktype': [0x28, ['pointer', ['kobj_type']]],
    'sd': [0x30, ['pointer', ['sysfs_dirent']]],
    'kref': [0x38, ['kref']],
    'state_initialized': [0x3c, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'state_remove_uevent_sent': [0x3c, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'uevent_suppress': [0x3c, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'state_add_uevent_sent': [0x3c, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'state_in_sysfs': [0x3c, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
}],
  'header_ops': [ 0x28, {
    'create': [0x0, ['pointer', ['void']]],
    'parse': [0x8, ['pointer', ['void']]],
    'rebuild': [0x10, ['pointer', ['void']]],
    'cache': [0x18, ['pointer', ['void']]],
    'cache_update': [0x20, ['pointer', ['void']]],
}],
  'bus_type': [ 0x68, {
    'name': [0x0, ['pointer', ['char']]],
    'bus_attrs': [0x8, ['pointer', ['bus_attribute']]],
    'dev_attrs': [0x10, ['pointer', ['device_attribute']]],
    'drv_attrs': [0x18, ['pointer', ['driver_attribute']]],
    'match': [0x20, ['pointer', ['void']]],
    'uevent': [0x28, ['pointer', ['void']]],
    'probe': [0x30, ['pointer', ['void']]],
    'remove': [0x38, ['pointer', ['void']]],
    'shutdown': [0x40, ['pointer', ['void']]],
    'suspend': [0x48, ['pointer', ['void']]],
    'resume': [0x50, ['pointer', ['void']]],
    'pm': [0x58, ['pointer', ['dev_pm_ops']]],
    'p': [0x60, ['pointer', ['subsys_private']]],
}],
  'file_operations': [ 0xd0, {
    'owner': [0x0, ['pointer', ['module']]],
    'llseek': [0x8, ['pointer', ['void']]],
    'read': [0x10, ['pointer', ['void']]],
    'write': [0x18, ['pointer', ['void']]],
    'aio_read': [0x20, ['pointer', ['void']]],
    'aio_write': [0x28, ['pointer', ['void']]],
    'readdir': [0x30, ['pointer', ['void']]],
    'poll': [0x38, ['pointer', ['void']]],
    'unlocked_ioctl': [0x40, ['pointer', ['void']]],
    'compat_ioctl': [0x48, ['pointer', ['void']]],
    'mmap': [0x50, ['pointer', ['void']]],
    'open': [0x58, ['pointer', ['void']]],
    'flush': [0x60, ['pointer', ['void']]],
    'release': [0x68, ['pointer', ['void']]],
    'fsync': [0x70, ['pointer', ['void']]],
    'aio_fsync': [0x78, ['pointer', ['void']]],
    'fasync': [0x80, ['pointer', ['void']]],
    'lock': [0x88, ['pointer', ['void']]],
    'sendpage': [0x90, ['pointer', ['void']]],
    'get_unmapped_area': [0x98, ['pointer', ['void']]],
    'check_flags': [0xa0, ['pointer', ['void']]],
    'flock': [0xa8, ['pointer', ['void']]],
    'splice_write': [0xb0, ['pointer', ['void']]],
    'splice_read': [0xb8, ['pointer', ['void']]],
    'setlease': [0xc0, ['pointer', ['void']]],
    'fallocate': [0xc8, ['pointer', ['void']]],
}],
  'nf_afinfo': [ 0x38, {
    'family': [0x0, ['unsigned short']],
    'checksum': [0x8, ['pointer', ['void']]],
    'checksum_partial': [0x10, ['pointer', ['void']]],
    'route': [0x18, ['pointer', ['void']]],
    'saveroute': [0x20, ['pointer', ['void']]],
    'reroute': [0x28, ['pointer', ['void']]],
    'route_key_size': [0x30, ['int']],
}],
  'apic': [ 0x160, {
    'name': [0x0, ['pointer', ['char']]],
    'probe': [0x8, ['pointer', ['void']]],
    'acpi_madt_oem_check': [0x10, ['pointer', ['void']]],
    'apic_id_registered': [0x18, ['pointer', ['void']]],
    'irq_delivery_mode': [0x20, ['unsigned int']],
    'irq_dest_mode': [0x24, ['unsigned int']],
    'target_cpus': [0x28, ['pointer', ['void']]],
    'disable_esr': [0x30, ['int']],
    'dest_logical': [0x34, ['int']],
    'check_apicid_used': [0x38, ['pointer', ['void']]],
    'check_apicid_present': [0x40, ['pointer', ['void']]],
    'vector_allocation_domain': [0x48, ['pointer', ['void']]],
    'init_apic_ldr': [0x50, ['pointer', ['void']]],
    'ioapic_phys_id_map': [0x58, ['pointer', ['void']]],
    'setup_apic_routing': [0x60, ['pointer', ['void']]],
    'multi_timer_check': [0x68, ['pointer', ['void']]],
    'apicid_to_node': [0x70, ['pointer', ['void']]],
    'cpu_to_logical_apicid': [0x78, ['pointer', ['void']]],
    'cpu_present_to_apicid': [0x80, ['pointer', ['void']]],
    'apicid_to_cpu_present': [0x88, ['pointer', ['void']]],
    'setup_portio_remap': [0x90, ['pointer', ['void']]],
    'check_phys_apicid_present': [0x98, ['pointer', ['void']]],
    'enable_apic_mode': [0xa0, ['pointer', ['void']]],
    'phys_pkg_id': [0xa8, ['pointer', ['void']]],
    'mps_oem_check': [0xb0, ['pointer', ['void']]],
    'get_apic_id': [0xb8, ['pointer', ['void']]],
    'set_apic_id': [0xc0, ['pointer', ['void']]],
    'apic_id_mask': [0xc8, ['unsigned long']],
    'cpu_mask_to_apicid': [0xd0, ['pointer', ['void']]],
    'cpu_mask_to_apicid_and': [0xd8, ['pointer', ['void']]],
    'send_IPI_mask': [0xe0, ['pointer', ['void']]],
    'send_IPI_mask_allbutself': [0xe8, ['pointer', ['void']]],
    'send_IPI_allbutself': [0xf0, ['pointer', ['void']]],
    'send_IPI_all': [0xf8, ['pointer', ['void']]],
    'send_IPI_self': [0x100, ['pointer', ['void']]],
    'wakeup_secondary_cpu': [0x108, ['pointer', ['void']]],
    'trampoline_phys_low': [0x110, ['int']],
    'trampoline_phys_high': [0x114, ['int']],
    'wait_for_init_deassert': [0x118, ['pointer', ['void']]],
    'smp_callin_clear_local_apic': [0x120, ['pointer', ['void']]],
    'inquire_remote_apic': [0x128, ['pointer', ['void']]],
    'read': [0x130, ['pointer', ['void']]],
    'write': [0x138, ['pointer', ['void']]],
    'icr_read': [0x140, ['pointer', ['void']]],
    'icr_write': [0x148, ['pointer', ['void']]],
    'wait_icr_idle': [0x150, ['pointer', ['void']]],
    'safe_wait_icr_idle': [0x158, ['pointer', ['void']]],
}],
  'nlattr': [ 0x4, {
    'nla_len': [0x0, ['unsigned short']],
    'nla_type': [0x2, ['unsigned short']],
}],
  'sk_filter': [ 0x18, {
    'refcnt': [0x0, ['__unnamed_0x38e']],
    'len': [0x4, ['unsigned int']],
    'rcu': [0x8, ['rcu_head']],
    'insns': [0x18, ['array', 0, ['sock_filter']]],
}],
  'wakeup_source': [ 0xb8, {
    'name': [0x0, ['pointer', ['char']]],
    'entry': [0x8, ['list_head']],
    'lock': [0x18, ['spinlock']],
    'timer': [0x20, ['timer_list']],
    'timer_expires': [0x70, ['long']],
    'total_time': [0x78, ['ktime']],
    'max_time': [0x80, ['ktime']],
    'last_time': [0x88, ['ktime']],
    'event_count': [0x90, ['long']],
    'active_count': [0x98, ['long']],
    'relax_count': [0xa0, ['long']],
    'hit_count': [0xa8, ['long']],
    'active': [0xb0, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
}],
  'x86_init_mpparse': [ 0x40, {
    'mpc_record': [0x0, ['pointer', ['void']]],
    'setup_ioapic_ids': [0x8, ['pointer', ['void']]],
    'mpc_apic_id': [0x10, ['pointer', ['void']]],
    'smp_read_mpc_oem': [0x18, ['pointer', ['void']]],
    'mpc_oem_pci_bus': [0x20, ['pointer', ['void']]],
    'mpc_oem_bus_info': [0x28, ['pointer', ['void']]],
    'find_smp_config': [0x30, ['pointer', ['void']]],
    'get_smp_config': [0x38, ['pointer', ['void']]],
}],
  '__unnamed_0xa0a8': [ 0x18, {
    '_tid': [0x0, ['int']],
    '_overrun': [0x4, ['int']],
    '_pad': [0x8, ['array', 0, ['char']]],
    '_sigval': [0x8, ['sigval']],
    '_sys_private': [0x10, ['int']],
}],
  'i387_soft_struct': [ 0x88, {
    'cwd': [0x0, ['unsigned int']],
    'swd': [0x4, ['unsigned int']],
    'twd': [0x8, ['unsigned int']],
    'fip': [0xc, ['unsigned int']],
    'fcs': [0x10, ['unsigned int']],
    'foo': [0x14, ['unsigned int']],
    'fos': [0x18, ['unsigned int']],
    'st_space': [0x1c, ['array', 20, ['unsigned int']]],
    'ftop': [0x6c, ['unsigned char']],
    'changed': [0x6d, ['unsigned char']],
    'lookahead': [0x6e, ['unsigned char']],
    'no_update': [0x6f, ['unsigned char']],
    'rm': [0x70, ['unsigned char']],
    'alimit': [0x71, ['unsigned char']],
    'info': [0x78, ['pointer', ['math_emu_info']]],
    'entry_eip': [0x80, ['unsigned int']],
}],
  'completion': [ 0x20, {
    'done': [0x0, ['unsigned int']],
    'wait': [0x8, ['__wait_queue_head']],
}],
  'ethtool_ringparam': [ 0x24, {
    'cmd': [0x0, ['unsigned int']],
    'rx_max_pending': [0x4, ['unsigned int']],
    'rx_mini_max_pending': [0x8, ['unsigned int']],
    'rx_jumbo_max_pending': [0xc, ['unsigned int']],
    'tx_max_pending': [0x10, ['unsigned int']],
    'rx_pending': [0x14, ['unsigned int']],
    'rx_mini_pending': [0x18, ['unsigned int']],
    'rx_jumbo_pending': [0x1c, ['unsigned int']],
    'tx_pending': [0x20, ['unsigned int']],
}],
  'dquot': [ 0xf0, {
    'dq_hash': [0x0, ['pointer', ['void']]],
    'dq_inuse': [0x10, ['list_head']],
    'dq_free': [0x20, ['list_head']],
    'dq_dirty': [0x30, ['list_head']],
    'dq_lock': [0x40, ['mutex']],
    'dq_count': [0x60, ['__unnamed_0x38e']],
    'dq_wait_unused': [0x68, ['__wait_queue_head']],
    'dq_sb': [0x80, ['pointer', ['super_block']]],
    'dq_id': [0x88, ['unsigned int']],
    'dq_off': [0x90, ['long long']],
    'dq_flags': [0x98, ['long']],
    'dq_type': [0xa0, ['short']],
    'dq_dqb': [0xa8, ['mem_dqblk']],
}],
  'pv_apic_ops': [ 0x8, {
    'startup_ipi_hook': [0x0, ['pointer', ['void']]],
}],
  'rps_sock_flow_table': [ 0x4, {
    'mask': [0x0, ['unsigned int']],
    'ents': [0x4, ['array', 0, ['unsigned short']]],
}],
  '__unnamed_0x314b': [ 0x20, {
    'ufds': [0x0, ['pointer', ['pollfd']]],
    'nfds': [0x8, ['int']],
    'has_timeout': [0xc, ['int']],
    'tv_sec': [0x10, ['long']],
    'tv_nsec': [0x18, ['long']],
}],
  'siginfo': [ 0x80, {
    'si_signo': [0x0, ['int']],
    'si_errno': [0x4, ['int']],
    'si_code': [0x8, ['int']],
    '_sifields': [0x10, ['__unnamed_0xa1d2']],
}],
  'x86_init_ops': [ 0xd0, {
    'resources': [0x0, ['x86_init_resources']],
    'mpparse': [0x18, ['x86_init_mpparse']],
    'irqs': [0x58, ['x86_init_irqs']],
    'oem': [0x70, ['x86_init_oem']],
    'paging': [0x80, ['x86_init_paging']],
    'timers': [0x90, ['x86_init_timers']],
    'iommu': [0xa8, ['x86_init_iommu']],
    'pci': [0xb0, ['x86_init_pci']],
}],
  'mnt_pcp': [ 0x8, {
    'mnt_count': [0x0, ['int']],
    'mnt_writers': [0x4, ['int']],
}],
  'super_operations': [ 0x98, {
    'alloc_inode': [0x0, ['pointer', ['void']]],
    'destroy_inode': [0x8, ['pointer', ['void']]],
    'dirty_inode': [0x10, ['pointer', ['void']]],
    'write_inode': [0x18, ['pointer', ['void']]],
    'drop_inode': [0x20, ['pointer', ['void']]],
    'evict_inode': [0x28, ['pointer', ['void']]],
    'put_super': [0x30, ['pointer', ['void']]],
    'write_super': [0x38, ['pointer', ['void']]],
    'sync_fs': [0x40, ['pointer', ['void']]],
    'freeze_fs': [0x48, ['pointer', ['void']]],
    'unfreeze_fs': [0x50, ['pointer', ['void']]],
    'statfs': [0x58, ['pointer', ['void']]],
    'remount_fs': [0x60, ['pointer', ['void']]],
    'umount_begin': [0x68, ['pointer', ['void']]],
    'show_options': [0x70, ['pointer', ['void']]],
    'show_stats': [0x78, ['pointer', ['void']]],
    'quota_read': [0x80, ['pointer', ['void']]],
    'quota_write': [0x88, ['pointer', ['void']]],
    'bdev_try_to_free_page': [0x90, ['pointer', ['void']]],
}],
  'kparam_array': [ 0x28, {
    'max': [0x0, ['unsigned int']],
    'num': [0x8, ['pointer', ['unsigned int']]],
    'ops': [0x10, ['pointer', ['kernel_param_ops']]],
    'elemsize': [0x18, ['unsigned int']],
    'elem': [0x20, ['pointer', ['void']]],
}],
  'irqaction': [ 0x80, {
    'handler': [0x0, ['pointer', ['void']]],
    'flags': [0x8, ['long']],
    'dev_id': [0x10, ['pointer', ['void']]],
    'next': [0x18, ['pointer', ['irqaction']]],
    'irq': [0x20, ['int']],
    'thread_fn': [0x28, ['pointer', ['void']]],
    'thread': [0x30, ['pointer', ['task_struct']]],
    'thread_flags': [0x38, ['long']],
    'name': [0x40, ['pointer', ['char']]],
    'dir': [0x48, ['pointer', ['proc_dir_entry']]],
}],
  '__unnamed_0xdc06': [ 0x4, {
    'encoding': [0x0, ['unsigned short']],
    'parity': [0x2, ['unsigned short']],
}],
  'free_area': [ 0x58, {
    'free_list': [0x0, ['array', 5, ['list_head']]],
    'nr_free': [0x50, ['unsigned long']],
}],
  'pneigh_entry': [ 0x20, {
    'next': [0x0, ['pointer', ['pneigh_entry']]],
    'net': [0x8, ['pointer', ['net']]],
    'dev': [0x10, ['pointer', ['net_device']]],
    'flags': [0x18, ['unsigned char']],
    'key': [0x19, ['array', 0, ['unsigned char']]],
}],
  'work_struct': [ 0x20, {
    'data': [0x0, ['__unnamed_0x3b0']],
    'entry': [0x8, ['list_head']],
    'func': [0x18, ['pointer', ['void']]],
}],
  '__unnamed_0x7bc': [ 0x8, {
    'pgd': [0x0, ['long']],
}],
  'timerqueue_head': [ 0x10, {
    'head': [0x0, ['rb_root']],
    'next': [0x8, ['pointer', ['timerqueue_node']]],
}],
  'resource': [ 0x38, {
    'start': [0x0, ['unsigned long long']],
    'end': [0x8, ['unsigned long long']],
    'name': [0x10, ['pointer', ['char']]],
    'flags': [0x18, ['unsigned long']],
    'parent': [0x20, ['pointer', ['resource']]],
    'sibling': [0x28, ['pointer', ['resource']]],
    'child': [0x30, ['pointer', ['resource']]],
}],
  'seqcount': [ 0x4, {
    'sequence': [0x0, ['unsigned int']],
}],
  '__unnamed_0x1342b': [ 0x10, {
    'skc_nulls_node': [0x0, ['hlist_nulls_node']],
    'skc_node': [0x0, ['pointer', ['void']]],
}],
  'neigh_ops': [ 0x38, {
    'family': [0x0, ['int']],
    'solicit': [0x8, ['pointer', ['void']]],
    'error_report': [0x10, ['pointer', ['void']]],
    'output': [0x18, ['pointer', ['void']]],
    'connected_output': [0x20, ['pointer', ['void']]],
    'hh_output': [0x28, ['pointer', ['void']]],
    'queue_xmit': [0x30, ['pointer', ['void']]],
}],
  'ethhdr': [ 0xe, {
    'h_dest': [0x0, ['array', 6, ['unsigned char']]],
    'h_source': [0x6, ['array', 6, ['unsigned char']]],
    'h_proto': [0xc, ['unsigned short']],
}],
  'percpu_counter': [ 0x28, {
    'lock': [0x0, ['spinlock']],
    'count': [0x8, ['long long']],
    'list': [0x10, ['list_head']],
    'counters': [0x20, ['pointer', ['int']]],
}],
  'in_device': [ 0x180, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'refcnt': [0x8, ['__unnamed_0x38e']],
    'dead': [0xc, ['int']],
    'ifa_list': [0x10, ['pointer', ['in_ifaddr']]],
    'mc_list': [0x18, ['pointer', ['ip_mc_list']]],
    'mc_count': [0x20, ['int']],
    'mc_tomb_lock': [0x24, ['spinlock']],
    'mc_tomb': [0x28, ['pointer', ['ip_mc_list']]],
    'mr_v1_seen': [0x30, ['long']],
    'mr_v2_seen': [0x38, ['long']],
    'mr_maxdelay': [0x40, ['long']],
    'mr_qrv': [0x48, ['unsigned char']],
    'mr_gq_running': [0x49, ['unsigned char']],
    'mr_ifc_count': [0x4a, ['unsigned char']],
    'mr_gq_timer': [0x50, ['timer_list']],
    'mr_ifc_timer': [0xa0, ['timer_list']],
    'arp_parms': [0xf0, ['pointer', ['neigh_parms']]],
    'cnf': [0xf8, ['ipv4_devconf']],
    'rcu_head': [0x170, ['rcu_head']],
}],
  '__unnamed_0xa914': [ 0x20, {
    'ctl_table': [0x0, ['pointer', ['ctl_table']]],
    'ctl_entry': [0x8, ['list_head']],
    'used': [0x18, ['int']],
    'count': [0x1c, ['int']],
}],
  'netns_core': [ 0x18, {
    'sysctl_hdr': [0x0, ['pointer', ['ctl_table_header']]],
    'sysctl_somaxconn': [0x8, ['int']],
    'inuse': [0x10, ['pointer', ['prot_inuse']]],
}],
  'dev_pm_info': [ 0x118, {
    'power_state': [0x0, ['pm_message']],
    'async_suspend': [0x4, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'in_suspend': [0x4, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'can_wakeup': [0x4, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'lock': [0x8, ['spinlock']],
    'entry': [0x10, ['list_head']],
    'completion': [0x20, ['completion']],
    'wakeup': [0x40, ['pointer', ['wakeup_source']]],
    'suspend_timer': [0x48, ['timer_list']],
    'timer_expires': [0x98, ['long']],
    'work': [0xa0, ['work_struct']],
    'wait_queue': [0xc0, ['__wait_queue_head']],
    'usage_count': [0xd8, ['__unnamed_0x38e']],
    'child_count': [0xdc, ['__unnamed_0x38e']],
    'run_wake': [0xe0, ['BitField', {'end_bit': 8, 'start_bit': 7}]],
    'runtime_auto': [0xe0, ['BitField', {'end_bit': 9, 'start_bit': 8}]],
    'irq_safe': [0xe0, ['BitField', {'end_bit': 11, 'start_bit': 10}]],
    'idle_notification': [0xe0, ['BitField', {'end_bit': 5, 'start_bit': 4}]],
    'use_autosuspend': [0xe0, ['BitField', {'end_bit': 12, 'start_bit': 11}]],
    'request_pending': [0xe0, ['BitField', {'end_bit': 6, 'start_bit': 5}]],
    'no_callbacks': [0xe0, ['BitField', {'end_bit': 10, 'start_bit': 9}]],
    'disable_depth': [0xe0, ['BitField', {'end_bit': 3, 'start_bit': 0}]],
    'deferred_resume': [0xe0, ['BitField', {'end_bit': 7, 'start_bit': 6}]],
    'timer_autosuspends': [0xe0, ['BitField', {'end_bit': 13, 'start_bit': 12}]],
    'ignore_children': [0xe0, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'request': [0xe4, ['Enumeration', {'target': 'int', 'choices': {0: 'RPM_REQ_NONE', 1: 'RPM_REQ_IDLE', 2: 'RPM_REQ_SUSPEND', 3: 'RPM_REQ_AUTOSUSPEND', 4: 'RPM_REQ_RESUME'}}]],
    'runtime_status': [0xe8, ['Enumeration', {'target': 'int', 'choices': {0: 'RPM_ACTIVE', 1: 'RPM_RESUMING', 2: 'RPM_SUSPENDED', 3: 'RPM_SUSPENDING'}}]],
    'runtime_error': [0xec, ['int']],
    'autosuspend_delay': [0xf0, ['int']],
    'last_busy': [0xf8, ['long']],
    'active_jiffies': [0x100, ['long']],
    'suspended_jiffies': [0x108, ['long']],
    'accounting_timestamp': [0x110, ['long']],
}],
  'udp_table': [ 0x18, {
    'hash': [0x0, ['pointer', ['udp_hslot']]],
    'hash2': [0x8, ['pointer', ['udp_hslot']]],
    'mask': [0x10, ['unsigned int']],
    'log': [0x14, ['unsigned int']],
}],
  'module_kobject': [ 0x58, {
    'kobj': [0x0, ['kobject']],
    'mod': [0x40, ['pointer', ['module']]],
    'drivers_dir': [0x48, ['pointer', ['kobject']]],
    'mp': [0x50, ['pointer', ['module_param_attrs']]],
}],
  'net_device_ops': [ 0x118, {
    'ndo_init': [0x0, ['pointer', ['void']]],
    'ndo_uninit': [0x8, ['pointer', ['void']]],
    'ndo_open': [0x10, ['pointer', ['void']]],
    'ndo_stop': [0x18, ['pointer', ['void']]],
    'ndo_start_xmit': [0x20, ['pointer', ['void']]],
    'ndo_select_queue': [0x28, ['pointer', ['void']]],
    'ndo_change_rx_flags': [0x30, ['pointer', ['void']]],
    'ndo_set_rx_mode': [0x38, ['pointer', ['void']]],
    'ndo_set_multicast_list': [0x40, ['pointer', ['void']]],
    'ndo_set_mac_address': [0x48, ['pointer', ['void']]],
    'ndo_validate_addr': [0x50, ['pointer', ['void']]],
    'ndo_do_ioctl': [0x58, ['pointer', ['void']]],
    'ndo_set_config': [0x60, ['pointer', ['void']]],
    'ndo_change_mtu': [0x68, ['pointer', ['void']]],
    'ndo_neigh_setup': [0x70, ['pointer', ['void']]],
    'ndo_tx_timeout': [0x78, ['pointer', ['void']]],
    'ndo_get_stats64': [0x80, ['pointer', ['void']]],
    'ndo_get_stats': [0x88, ['pointer', ['void']]],
    'ndo_vlan_rx_register': [0x90, ['pointer', ['void']]],
    'ndo_vlan_rx_add_vid': [0x98, ['pointer', ['void']]],
    'ndo_vlan_rx_kill_vid': [0xa0, ['pointer', ['void']]],
    'ndo_poll_controller': [0xa8, ['pointer', ['void']]],
    'ndo_netpoll_setup': [0xb0, ['pointer', ['void']]],
    'ndo_netpoll_cleanup': [0xb8, ['pointer', ['void']]],
    'ndo_set_vf_mac': [0xc0, ['pointer', ['void']]],
    'ndo_set_vf_vlan': [0xc8, ['pointer', ['void']]],
    'ndo_set_vf_tx_rate': [0xd0, ['pointer', ['void']]],
    'ndo_get_vf_config': [0xd8, ['pointer', ['void']]],
    'ndo_set_vf_port': [0xe0, ['pointer', ['void']]],
    'ndo_get_vf_port': [0xe8, ['pointer', ['void']]],
    'ndo_fcoe_enable': [0xf0, ['pointer', ['void']]],
    'ndo_fcoe_disable': [0xf8, ['pointer', ['void']]],
    'ndo_fcoe_ddp_setup': [0x100, ['pointer', ['void']]],
    'ndo_fcoe_ddp_done': [0x108, ['pointer', ['void']]],
    'ndo_fcoe_get_wwn': [0x110, ['pointer', ['void']]],
}],
  'qstr': [ 0x10, {
    'hash': [0x0, ['unsigned int']],
    'len': [0x4, ['unsigned int']],
    'name': [0x8, ['pointer', ['unsigned char']]],
}],
  'net_device_stats': [ 0xb8, {
    'rx_packets': [0x0, ['long']],
    'tx_packets': [0x8, ['long']],
    'rx_bytes': [0x10, ['long']],
    'tx_bytes': [0x18, ['long']],
    'rx_errors': [0x20, ['long']],
    'tx_errors': [0x28, ['long']],
    'rx_dropped': [0x30, ['long']],
    'tx_dropped': [0x38, ['long']],
    'multicast': [0x40, ['long']],
    'collisions': [0x48, ['long']],
    'rx_length_errors': [0x50, ['long']],
    'rx_over_errors': [0x58, ['long']],
    'rx_crc_errors': [0x60, ['long']],
    'rx_frame_errors': [0x68, ['long']],
    'rx_fifo_errors': [0x70, ['long']],
    'rx_missed_errors': [0x78, ['long']],
    'tx_aborted_errors': [0x80, ['long']],
    'tx_carrier_errors': [0x88, ['long']],
    'tx_fifo_errors': [0x90, ['long']],
    'tx_heartbeat_errors': [0x98, ['long']],
    'tx_window_errors': [0xa0, ['long']],
    'rx_compressed': [0xa8, ['long']],
    'tx_compressed': [0xb0, ['long']],
}],
  'module': [ 0x280, {
    'state': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'MODULE_STATE_LIVE', 1: 'MODULE_STATE_COMING', 2: 'MODULE_STATE_GOING'}}]],
    'list': [0x8, ['list_head']],
    'name': [0x18, ['array', 56, ['char']]],
    'mkobj': [0x50, ['module_kobject']],
    'modinfo_attrs': [0xa8, ['pointer', ['module_attribute']]],
    'version': [0xb0, ['pointer', ['char']]],
    'srcversion': [0xb8, ['pointer', ['char']]],
    'holders_dir': [0xc0, ['pointer', ['kobject']]],
    'syms': [0xc8, ['pointer', ['kernel_symbol']]],
    'crcs': [0xd0, ['pointer', ['unsigned long']]],
    'num_syms': [0xd8, ['unsigned int']],
    'kp': [0xe0, ['pointer', ['kernel_param']]],
    'num_kp': [0xe8, ['unsigned int']],
    'num_gpl_syms': [0xec, ['unsigned int']],
    'gpl_syms': [0xf0, ['pointer', ['kernel_symbol']]],
    'gpl_crcs': [0xf8, ['pointer', ['unsigned long']]],
    'unused_syms': [0x100, ['pointer', ['kernel_symbol']]],
    'unused_crcs': [0x108, ['pointer', ['unsigned long']]],
    'num_unused_syms': [0x110, ['unsigned int']],
    'num_unused_gpl_syms': [0x114, ['unsigned int']],
    'unused_gpl_syms': [0x118, ['pointer', ['kernel_symbol']]],
    'unused_gpl_crcs': [0x120, ['pointer', ['unsigned long']]],
    'gpl_future_syms': [0x128, ['pointer', ['kernel_symbol']]],
    'gpl_future_crcs': [0x130, ['pointer', ['unsigned long']]],
    'num_gpl_future_syms': [0x138, ['unsigned int']],
    'num_exentries': [0x13c, ['unsigned int']],
    'extable': [0x140, ['pointer', ['exception_table_entry']]],
    'init': [0x148, ['pointer', ['void']]],
    'module_init': [0x150, ['pointer', ['void']]],
    'module_core': [0x158, ['pointer', ['void']]],
    'init_size': [0x160, ['unsigned int']],
    'core_size': [0x164, ['unsigned int']],
    'init_text_size': [0x168, ['unsigned int']],
    'core_text_size': [0x16c, ['unsigned int']],
    'init_ro_size': [0x170, ['unsigned int']],
    'core_ro_size': [0x174, ['unsigned int']],
    'arch': [0x178, ['mod_arch_specific']],
    'taints': [0x178, ['unsigned int']],
    'num_bugs': [0x17c, ['unsigned int']],
    'bug_list': [0x180, ['list_head']],
    'bug_table': [0x190, ['pointer', ['bug_entry']]],
    'symtab': [0x198, ['pointer', ['elf64_sym']]],
    'core_symtab': [0x1a0, ['pointer', ['elf64_sym']]],
    'num_symtab': [0x1a8, ['unsigned int']],
    'core_num_syms': [0x1ac, ['unsigned int']],
    'strtab': [0x1b0, ['pointer', ['char']]],
    'core_strtab': [0x1b8, ['pointer', ['char']]],
    'sect_attrs': [0x1c0, ['pointer', ['module_sect_attrs']]],
    'notes_attrs': [0x1c8, ['pointer', ['module_notes_attrs']]],
    'percpu': [0x1d0, ['pointer', ['void']]],
    'percpu_size': [0x1d8, ['unsigned int']],
    'args': [0x1e0, ['pointer', ['char']]],
    'tracepoints_ptrs': [0x1e8, ['pointer', ['pointer', ['tracepoint']]]],
    'num_tracepoints': [0x1f0, ['unsigned int']],
    'jump_entries': [0x1f8, ['pointer', ['jump_entry']]],
    'num_jump_entries': [0x200, ['unsigned int']],
    'trace_bprintk_fmt_start': [0x208, ['pointer', ['pointer', ['char']]]],
    'num_trace_bprintk_fmt': [0x210, ['unsigned int']],
    'trace_events': [0x218, ['pointer', ['pointer', ['ftrace_event_call']]]],
    'num_trace_events': [0x220, ['unsigned int']],
    'ftrace_callsites': [0x228, ['pointer', ['unsigned long']]],
    'num_ftrace_callsites': [0x230, ['unsigned int']],
    'source_list': [0x238, ['list_head']],
    'target_list': [0x248, ['list_head']],
    'waiter': [0x258, ['pointer', ['task_struct']]],
    'exit': [0x260, ['pointer', ['void']]],
    'refptr': [0x268, ['pointer', ['module_ref']]],
    'ctors': [0x270, ['pointer', ['pointer', ['void']]]],
    'num_ctors': [0x278, ['unsigned int']],
}],
  '__unnamed_0xde45': [ 0x10, {
    'ifrn_name': [0x0, ['array', 16, ['char']]],
}],
  'mm_rss_stat': [ 0x18, {
    'count': [0x0, ['array', 3, ['__unnamed_0x3b0']]],
}],
  'restart_block': [ 0x30, {
    'fn': [0x0, ['pointer', ['void']]],
    '__unnamed_0x321e': [0x8, ['__unnamed_0x31d6']],
}],
  'ethtool_rxnfc': [ 0xc0, {
    'cmd': [0x0, ['unsigned int']],
    'flow_type': [0x4, ['unsigned int']],
    'data': [0x8, ['unsigned long long']],
    'fs': [0x10, ['ethtool_rx_flow_spec']],
    'rule_cnt': [0xb8, ['unsigned int']],
    'rule_locs': [0xbc, ['array', 0, ['unsigned int']]],
}],
  'ethtool_rx_ntuple_flow_spec': [ 0xb0, {
    'flow_type': [0x0, ['unsigned int']],
    'h_u': [0x4, ['__unnamed_0xea79']],
    'm_u': [0x4c, ['__unnamed_0xea79']],
    'vlan_tag': [0x94, ['unsigned short']],
    'vlan_tag_mask': [0x96, ['unsigned short']],
    'data': [0x98, ['unsigned long long']],
    'data_mask': [0xa0, ['unsigned long long']],
    'action': [0xa8, ['int']],
}],
  'pv_irq_ops': [ 0x38, {
    'save_fl': [0x0, ['paravirt_callee_save']],
    'restore_fl': [0x8, ['paravirt_callee_save']],
    'irq_disable': [0x10, ['paravirt_callee_save']],
    'irq_enable': [0x18, ['paravirt_callee_save']],
    'safe_halt': [0x20, ['pointer', ['void']]],
    'halt': [0x28, ['pointer', ['void']]],
    'adjust_exception_frame': [0x30, ['pointer', ['void']]],
}],
  '__unnamed_0x13da2': [ 0x60, {
    'flags': [0x0, ['unsigned int']],
    'fragsize': [0x4, ['unsigned int']],
    'opt': [0x8, ['pointer', ['ip_options']]],
    'dst': [0x10, ['pointer', ['dst_entry']]],
    'length': [0x18, ['int']],
    'addr': [0x1c, ['unsigned int']],
    'fl': [0x20, ['flowi']],
}],
  'compat_timespec': [ 0x8, {
    'tv_sec': [0x0, ['int']],
    'tv_nsec': [0x4, ['int']],
}],
  'vm_fault': [ 0x20, {
    'flags': [0x0, ['unsigned int']],
    'pgoff': [0x8, ['long']],
    'virtual_address': [0x10, ['pointer', ['void']]],
    'page': [0x18, ['pointer', ['page']]],
}],
  '__unnamed_0x1a5': [ 0x8, {
    'counter': [0x0, ['long']],
}],
  'radix_tree_root': [ 0x10, {
    'height': [0x0, ['unsigned int']],
    'gfp_mask': [0x4, ['unsigned int']],
    'rnode': [0x8, ['pointer', ['radix_tree_node']]],
}],
  'address_space': [ 0xb0, {
    'host': [0x0, ['pointer', ['inode']]],
    'page_tree': [0x8, ['radix_tree_root']],
    'tree_lock': [0x18, ['spinlock']],
    'i_mmap_writable': [0x1c, ['unsigned int']],
    'i_mmap': [0x20, ['prio_tree_root']],
    'i_mmap_nonlinear': [0x30, ['list_head']],
    'i_mmap_lock': [0x40, ['spinlock']],
    'truncate_count': [0x44, ['unsigned int']],
    'nrpages': [0x48, ['long']],
    'writeback_index': [0x50, ['long']],
    'a_ops': [0x58, ['pointer', ['address_space_operations']]],
    'flags': [0x60, ['long']],
    'backing_dev_info': [0x68, ['pointer', ['backing_dev_info']]],
    'private_lock': [0x70, ['spinlock']],
    'private_list': [0x78, ['list_head']],
    'assoc_mapping': [0x88, ['pointer', ['address_space']]],
    'unmap_mutex': [0x90, ['mutex']],
}],
  'ethtool_regs': [ 0xc, {
    'cmd': [0x0, ['unsigned int']],
    'version': [0x4, ['unsigned int']],
    'len': [0x8, ['unsigned int']],
    'data': [0xc, ['array', 0, ['unsigned char']]],
}],
  'mutex': [ 0x20, {
    'count': [0x0, ['__unnamed_0x38e']],
    'wait_lock': [0x4, ['spinlock']],
    'wait_list': [0x8, ['list_head']],
    'owner': [0x18, ['pointer', ['thread_info']]],
}],
  'task_delay_info': [ 0x70, {
    'lock': [0x0, ['spinlock']],
    'flags': [0x4, ['unsigned int']],
    'blkio_start': [0x8, ['timespec']],
    'blkio_end': [0x18, ['timespec']],
    'blkio_delay': [0x28, ['unsigned long long']],
    'swapin_delay': [0x30, ['unsigned long long']],
    'blkio_count': [0x38, ['unsigned int']],
    'swapin_count': [0x3c, ['unsigned int']],
    'freepages_start': [0x40, ['timespec']],
    'freepages_end': [0x50, ['timespec']],
    'freepages_delay': [0x60, ['unsigned long long']],
    'freepages_count': [0x68, ['unsigned int']],
}],
  'ipv6_mc_socklist': [ 0x40, {
    'addr': [0x0, ['in6_addr']],
    'ifindex': [0x10, ['int']],
    'next': [0x18, ['pointer', ['ipv6_mc_socklist']]],
    'sflock': [0x20, ['__unnamed_0x3377']],
    'sfmode': [0x24, ['unsigned int']],
    'sflist': [0x28, ['pointer', ['ip6_sf_socklist']]],
    'rcu': [0x30, ['rcu_head']],
}],
  '__unnamed_0x1c54': [ 0x10, {
    '__unnamed_0x1c62': [0x0, ['__unnamed_0x1c0e']],
    '__unnamed_0x1c5d': [0x0, ['__unnamed_0x1be6']],
}],
  'zone_lru': [ 0x10, {
    'list': [0x0, ['list_head']],
}],
  '__unnamed_0xa1d2': [ 0x70, {
    '_timer': [0x0, ['__unnamed_0xa0a8']],
    '_sigpoll': [0x0, ['__unnamed_0xa1ad']],
    '_kill': [0x0, ['__unnamed_0xa083']],
    '_pad': [0x0, ['array', 28, ['int']]],
    '_sigchld': [0x0, ['__unnamed_0xa139']],
    '_rt': [0x0, ['__unnamed_0xa106']],
    '_sigfault': [0x0, ['__unnamed_0xa188']],
}],
  '__unnamed_0x137ed': [ 0x18, {
    'rmem_alloc': [0x0, ['__unnamed_0x38e']],
    'len': [0x4, ['int']],
    'head': [0x8, ['pointer', ['sk_buff']]],
    'tail': [0x10, ['pointer', ['sk_buff']]],
}],
  'xps_map': [ 0x18, {
    'len': [0x0, ['unsigned int']],
    'alloc_len': [0x4, ['unsigned int']],
    'rcu': [0x8, ['rcu_head']],
    'queues': [0x18, ['array', 0, ['unsigned short']]],
}],
  'compat_robust_list_head': [ 0xc, {
    'list': [0x0, ['compat_robust_list']],
    'futex_offset': [0x4, ['int']],
    'list_op_pending': [0x8, ['unsigned int']],
}],
  'hlist_nulls_node': [ 0x10, {
    'next': [0x0, ['pointer', ['hlist_nulls_node']]],
    'pprev': [0x8, ['pointer', ['pointer', ['hlist_nulls_node']]]],
}],
  'key': [ 0x98, {
    'usage': [0x0, ['__unnamed_0x38e']],
    'serial': [0x4, ['int']],
    'serial_node': [0x8, ['rb_node']],
    'type': [0x20, ['pointer', ['key_type']]],
    'sem': [0x28, ['rw_semaphore']],
    'user': [0x48, ['pointer', ['key_user']]],
    'security': [0x50, ['pointer', ['void']]],
    '__unnamed_0xaa8f': [0x58, ['__unnamed_0xa98b']],
    'uid': [0x60, ['unsigned int']],
    'gid': [0x64, ['unsigned int']],
    'perm': [0x68, ['unsigned int']],
    'quotalen': [0x6c, ['unsigned short']],
    'datalen': [0x6e, ['unsigned short']],
    'flags': [0x70, ['long']],
    'description': [0x78, ['pointer', ['char']]],
    'type_data': [0x80, ['__unnamed_0xa9aa']],
    'payload': [0x90, ['__unnamed_0xa9e0']],
}],
  'mpc_table': [ 0x2c, {
    'signature': [0x0, ['array', 4, ['char']]],
    'length': [0x4, ['unsigned short']],
    'spec': [0x6, ['char']],
    'checksum': [0x7, ['char']],
    'oem': [0x8, ['array', 8, ['char']]],
    'productid': [0x10, ['array', 12, ['char']]],
    'oemptr': [0x1c, ['unsigned int']],
    'oemsize': [0x20, ['unsigned short']],
    'oemcount': [0x22, ['unsigned short']],
    'lapic': [0x24, ['unsigned int']],
    'reserved': [0x28, ['unsigned int']],
}],
  'module_ref': [ 0x8, {
    'incs': [0x0, ['unsigned int']],
    'decs': [0x4, ['unsigned int']],
}],
  'x86_init_oem': [ 0x10, {
    'arch_setup': [0x0, ['pointer', ['void']]],
    'banner': [0x8, ['pointer', ['void']]],
}],
  'task_rss_stat': [ 0x10, {
    'events': [0x0, ['int']],
    'count': [0x4, ['array', 3, ['int']]],
}],
  '__unnamed_0xa139': [ 0x20, {
    '_pid': [0x0, ['int']],
    '_uid': [0x4, ['unsigned int']],
    '_status': [0x8, ['int']],
    '_utime': [0x10, ['long']],
    '_stime': [0x18, ['long']],
}],
  'ifreq': [ 0x28, {
    'ifr_ifrn': [0x0, ['__unnamed_0xde45']],
    'ifr_ifru': [0x10, ['__unnamed_0xde59']],
}],
  '__unnamed_0x183': [ 0x4, {
    'counter': [0x0, ['int']],
}],
  'msghdr': [ 0x38, {
    'msg_name': [0x0, ['pointer', ['void']]],
    'msg_namelen': [0x8, ['int']],
    'msg_iov': [0x10, ['pointer', ['iovec']]],
    'msg_iovlen': [0x18, ['long']],
    'msg_control': [0x20, ['pointer', ['void']]],
    'msg_controllen': [0x28, ['long']],
    'msg_flags': [0x30, ['unsigned int']],
}],
  'request_values': [ 0x0, {
}],
  'bus_attribute': [ 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  'inet_hashinfo': [ 0x280, {
    'ehash': [0x0, ['pointer', ['inet_ehash_bucket']]],
    'ehash_locks': [0x8, ['pointer', ['spinlock']]],
    'ehash_mask': [0x10, ['unsigned int']],
    'ehash_locks_mask': [0x14, ['unsigned int']],
    'bhash': [0x18, ['pointer', ['inet_bind_hashbucket']]],
    'bhash_size': [0x20, ['unsigned int']],
    'bind_bucket_cachep': [0x28, ['pointer', ['kmem_cache']]],
    'listening_hash': [0x40, ['array', 32, ['inet_listen_hashbucket']]],
    'bsockets': [0x240, ['__unnamed_0x38e']],
}],
  'prio_tree_node': [ 0x28, {
    'left': [0x0, ['pointer', ['prio_tree_node']]],
    'right': [0x8, ['pointer', ['prio_tree_node']]],
    'parent': [0x10, ['pointer', ['prio_tree_node']]],
    'start': [0x18, ['long']],
    'last': [0x20, ['long']],
}],
  'lock_manager_operations': [ 0x30, {
    'fl_compare_owner': [0x0, ['pointer', ['void']]],
    'fl_notify': [0x8, ['pointer', ['void']]],
    'fl_grant': [0x10, ['pointer', ['void']]],
    'fl_release_private': [0x18, ['pointer', ['void']]],
    'fl_break': [0x20, ['pointer', ['void']]],
    'fl_change': [0x28, ['pointer', ['void']]],
}],
  'sockaddr': [ 0x10, {
    'sa_family': [0x0, ['unsigned short']],
    'sa_data': [0x2, ['array', 14, ['char']]],
}],
  'ethtool_tcpip4_spec': [ 0x10, {
    'ip4src': [0x0, ['unsigned int']],
    'ip4dst': [0x4, ['unsigned int']],
    'psrc': [0x8, ['unsigned short']],
    'pdst': [0xa, ['unsigned short']],
    'tos': [0xc, ['unsigned char']],
}],
  '__unnamed_0x1443d': [ 0x2, {
    'all': [0x0, ['unsigned short']],
    'bits': [0x0, ['__unnamed_0x14337']],
}],
  'thread_info': [ 0x68, {
    'task': [0x0, ['pointer', ['task_struct']]],
    'exec_domain': [0x8, ['pointer', ['exec_domain']]],
    'flags': [0x10, ['unsigned int']],
    'status': [0x14, ['unsigned int']],
    'cpu': [0x18, ['unsigned int']],
    'preempt_count': [0x1c, ['int']],
    'addr_limit': [0x20, ['__unnamed_0x2fd9']],
    'restart_block': [0x28, ['restart_block']],
    'sysenter_return': [0x58, ['pointer', ['void']]],
    'uaccess_err': [0x60, ['int']],
}],
  'module_attribute': [ 0x38, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
    'setup': [0x20, ['pointer', ['void']]],
    'test': [0x28, ['pointer', ['void']]],
    'free': [0x30, ['pointer', ['void']]],
}],
  'inet_bind_hashbucket': [ 0x10, {
    'lock': [0x0, ['spinlock']],
    'chain': [0x8, ['hlist_head']],
}],
  'inode': [ 0x258, {
    'i_mode': [0x0, ['unsigned short']],
    'i_uid': [0x4, ['unsigned int']],
    'i_gid': [0x8, ['unsigned int']],
    'i_op': [0x10, ['pointer', ['inode_operations']]],
    'i_sb': [0x18, ['pointer', ['super_block']]],
    'i_lock': [0x20, ['spinlock']],
    'i_flags': [0x24, ['unsigned int']],
    'i_mutex': [0x28, ['mutex']],
    'i_state': [0x48, ['long']],
    'dirtied_when': [0x50, ['long']],
    'i_hash': [0x58, ['pointer', ['void']]],
    'i_wb_list': [0x68, ['list_head']],
    'i_lru': [0x78, ['list_head']],
    'i_sb_list': [0x88, ['list_head']],
    '__unnamed_0x67ea': [0x98, ['__unnamed_0x81ff']],
    'i_ino': [0xa8, ['long']],
    'i_count': [0xb0, ['__unnamed_0x38e']],
    'i_nlink': [0xb4, ['unsigned int']],
    'i_rdev': [0xb8, ['unsigned int']],
    'i_blkbits': [0xbc, ['unsigned int']],
    'i_version': [0xc0, ['unsigned long long']],
    'i_size': [0xc8, ['long long']],
    'i_atime': [0xd0, ['timespec']],
    'i_mtime': [0xe0, ['timespec']],
    'i_ctime': [0xf0, ['timespec']],
    'i_blocks': [0x100, ['long']],
    'i_bytes': [0x108, ['unsigned short']],
    'i_alloc_sem': [0x110, ['rw_semaphore']],
    'i_fop': [0x130, ['pointer', ['file_operations']]],
    'i_flock': [0x138, ['pointer', ['file_lock']]],
    'i_mapping': [0x140, ['pointer', ['address_space']]],
    'i_data': [0x148, ['address_space']],
    'i_dquot': [0x1f8, ['array', 2, ['pointer', ['dquot']]]],
    'i_devices': [0x208, ['list_head']],
    '__unnamed_0x6923': [0x218, ['__unnamed_0x8221']],
    'i_generation': [0x220, ['unsigned int']],
    'i_fsnotify_mask': [0x224, ['unsigned int']],
    'i_fsnotify_marks': [0x228, ['hlist_head']],
    'i_writecount': [0x230, ['__unnamed_0x38e']],
    'i_security': [0x238, ['pointer', ['void']]],
    'i_acl': [0x240, ['pointer', ['posix_acl']]],
    'i_default_acl': [0x248, ['pointer', ['posix_acl']]],
    'i_private': [0x250, ['pointer', ['void']]],
}],
  '__unnamed_0xa3fa': [ 0x4, {
    'mode': [0x0, ['int']],
}],
  'thread_group_cputimer': [ 0x20, {
    'cputime': [0x0, ['task_cputime']],
    'running': [0x18, ['int']],
    'lock': [0x1c, ['spinlock']],
}],
  '__unnamed_0x10ae5': [ 0x24, {
    'ip4_u': [0x0, ['__unnamed_0x10a3e']],
    'dn_u': [0x0, ['__unnamed_0x10ab2']],
    'ip6_u': [0x0, ['__unnamed_0x10a7f']],
}],
  'sigaction': [ 0x20, {
    'sa_handler': [0x0, ['pointer', ['void']]],
    'sa_flags': [0x8, ['long']],
    'sa_restorer': [0x10, ['pointer', ['void']]],
    'sa_mask': [0x18, ['__unnamed_0x9f9c']],
}],
  'linux_mib': [ 0x280, {
    'mibs': [0x0, ['array', 80, ['long']]],
}],
  'quota_format_ops': [ 0x38, {
    'check_quota_file': [0x0, ['pointer', ['void']]],
    'read_file_info': [0x8, ['pointer', ['void']]],
    'write_file_info': [0x10, ['pointer', ['void']]],
    'free_file_info': [0x18, ['pointer', ['void']]],
    'read_dqblk': [0x20, ['pointer', ['void']]],
    'commit_dqblk': [0x28, ['pointer', ['void']]],
    'release_dqblk': [0x30, ['pointer', ['void']]],
}],
  'in6_addr': [ 0x10, {
    'in6_u': [0x0, ['__unnamed_0x1062a']],
}],
  'ctl_table': [ 0x40, {
    'procname': [0x0, ['pointer', ['char']]],
    'data': [0x8, ['pointer', ['void']]],
    'maxlen': [0x10, ['int']],
    'mode': [0x14, ['unsigned int']],
    'child': [0x18, ['pointer', ['ctl_table']]],
    'parent': [0x20, ['pointer', ['ctl_table']]],
    'proc_handler': [0x28, ['pointer', ['void']]],
    'extra1': [0x30, ['pointer', ['void']]],
    'extra2': [0x38, ['pointer', ['void']]],
}],
  'quota_format_type': [ 0x20, {
    'qf_fmt_id': [0x0, ['int']],
    'qf_ops': [0x8, ['pointer', ['quota_format_ops']]],
    'qf_owner': [0x10, ['pointer', ['module']]],
    'qf_next': [0x18, ['pointer', ['quota_format_type']]],
}],
  '__unnamed_0x5a1': [ 0x8, {
    'a': [0x0, ['unsigned int']],
    'b': [0x4, ['unsigned int']],
}],
  'k_sigaction': [ 0x20, {
    'sa': [0x0, ['sigaction']],
}],
  'pv_info': [ 0x18, {
    'kernel_rpl': [0x0, ['unsigned int']],
    'shared_kernel_pmd': [0x4, ['int']],
    'paravirt_enabled': [0x8, ['int']],
    'name': [0x10, ['pointer', ['char']]],
}],
  'pv_mmu_ops': [ 0x150, {
    'read_cr2': [0x0, ['pointer', ['void']]],
    'write_cr2': [0x8, ['pointer', ['void']]],
    'read_cr3': [0x10, ['pointer', ['void']]],
    'write_cr3': [0x18, ['pointer', ['void']]],
    'activate_mm': [0x20, ['pointer', ['void']]],
    'dup_mmap': [0x28, ['pointer', ['void']]],
    'exit_mmap': [0x30, ['pointer', ['void']]],
    'flush_tlb_user': [0x38, ['pointer', ['void']]],
    'flush_tlb_kernel': [0x40, ['pointer', ['void']]],
    'flush_tlb_single': [0x48, ['pointer', ['void']]],
    'flush_tlb_others': [0x50, ['pointer', ['void']]],
    'pgd_alloc': [0x58, ['pointer', ['void']]],
    'pgd_free': [0x60, ['pointer', ['void']]],
    'alloc_pte': [0x68, ['pointer', ['void']]],
    'alloc_pmd': [0x70, ['pointer', ['void']]],
    'alloc_pud': [0x78, ['pointer', ['void']]],
    'release_pte': [0x80, ['pointer', ['void']]],
    'release_pmd': [0x88, ['pointer', ['void']]],
    'release_pud': [0x90, ['pointer', ['void']]],
    'set_pte': [0x98, ['pointer', ['void']]],
    'set_pte_at': [0xa0, ['pointer', ['void']]],
    'set_pmd': [0xa8, ['pointer', ['void']]],
    'set_pmd_at': [0xb0, ['pointer', ['void']]],
    'pte_update': [0xb8, ['pointer', ['void']]],
    'pte_update_defer': [0xc0, ['pointer', ['void']]],
    'pmd_update': [0xc8, ['pointer', ['void']]],
    'pmd_update_defer': [0xd0, ['pointer', ['void']]],
    'ptep_modify_prot_start': [0xd8, ['pointer', ['void']]],
    'ptep_modify_prot_commit': [0xe0, ['pointer', ['void']]],
    'pte_val': [0xe8, ['paravirt_callee_save']],
    'make_pte': [0xf0, ['paravirt_callee_save']],
    'pgd_val': [0xf8, ['paravirt_callee_save']],
    'make_pgd': [0x100, ['paravirt_callee_save']],
    'set_pud': [0x108, ['pointer', ['void']]],
    'pmd_val': [0x110, ['paravirt_callee_save']],
    'make_pmd': [0x118, ['paravirt_callee_save']],
    'pud_val': [0x120, ['paravirt_callee_save']],
    'make_pud': [0x128, ['paravirt_callee_save']],
    'set_pgd': [0x130, ['pointer', ['void']]],
    'lazy_mode': [0x138, ['pv_lazy_ops']],
    'set_fixmap': [0x148, ['pointer', ['void']]],
}],
  'pm_message': [ 0x4, {
    'event': [0x0, ['int']],
}],
  'neighbour': [ 0x100, {
    'next': [0x0, ['pointer', ['neighbour']]],
    'tbl': [0x8, ['pointer', ['neigh_table']]],
    'parms': [0x10, ['pointer', ['neigh_parms']]],
    'confirmed': [0x18, ['long']],
    'updated': [0x20, ['long']],
    'lock': [0x28, ['__unnamed_0x3377']],
    'refcnt': [0x2c, ['__unnamed_0x38e']],
    'arp_queue': [0x30, ['sk_buff_head']],
    'timer': [0x48, ['timer_list']],
    'used': [0x98, ['long']],
    'probes': [0xa0, ['__unnamed_0x38e']],
    'flags': [0xa4, ['unsigned char']],
    'nud_state': [0xa5, ['unsigned char']],
    'type': [0xa6, ['unsigned char']],
    'dead': [0xa7, ['unsigned char']],
    'ha_lock': [0xa8, ['__unnamed_0x3399']],
    'ha': [0xb0, ['array', 32, ['unsigned char']]],
    'hh': [0xd0, ['pointer', ['hh_cache']]],
    'output': [0xd8, ['pointer', ['void']]],
    'ops': [0xe0, ['pointer', ['neigh_ops']]],
    'rcu': [0xe8, ['rcu_head']],
    'dev': [0xf8, ['pointer', ['net_device']]],
    'primary_key': [0x100, ['array', 0, ['unsigned char']]],
}],
  'cpuinfo_x86': [ 0xc0, {
    'x86': [0x0, ['unsigned char']],
    'x86_vendor': [0x1, ['unsigned char']],
    'x86_model': [0x2, ['unsigned char']],
    'x86_mask': [0x3, ['unsigned char']],
    'x86_tlbsize': [0x4, ['int']],
    'x86_virt_bits': [0x8, ['unsigned char']],
    'x86_phys_bits': [0x9, ['unsigned char']],
    'x86_coreid_bits': [0xa, ['unsigned char']],
    'extended_cpuid_level': [0xc, ['unsigned int']],
    'cpuid_level': [0x10, ['int']],
    'x86_capability': [0x14, ['array', 10, ['unsigned int']]],
    'x86_vendor_id': [0x3c, ['array', 16, ['char']]],
    'x86_model_id': [0x4c, ['array', 64, ['char']]],
    'x86_cache_size': [0x8c, ['int']],
    'x86_cache_alignment': [0x90, ['int']],
    'x86_power': [0x94, ['int']],
    'loops_per_jiffy': [0x98, ['unsigned long']],
    'llc_shared_map': [0xa0, ['array', 1, ['cpumask']]],
    'x86_max_cores': [0xa8, ['unsigned short']],
    'apicid': [0xaa, ['unsigned short']],
    'initial_apicid': [0xac, ['unsigned short']],
    'x86_clflush_size': [0xae, ['unsigned short']],
    'booted_cores': [0xb0, ['unsigned short']],
    'phys_proc_id': [0xb2, ['unsigned short']],
    'cpu_core_id': [0xb4, ['unsigned short']],
    'compute_unit_id': [0xb6, ['unsigned char']],
    'cpu_index': [0xb8, ['unsigned short']],
}],
  'pollfd': [ 0x8, {
    'fd': [0x0, ['int']],
    'events': [0x4, ['short']],
    'revents': [0x6, ['short']],
}],
  'raw_prio_tree_node': [ 0x18, {
    'left': [0x0, ['pointer', ['prio_tree_node']]],
    'right': [0x8, ['pointer', ['prio_tree_node']]],
    'parent': [0x10, ['pointer', ['prio_tree_node']]],
}],
  'physid_mask': [ 0x1000, {
    'mask': [0x0, ['array', 512, ['unsigned long']]],
}],
  'unix_sock': [ 0x340, {
    'sk': [0x0, ['sock']],
    'addr': [0x268, ['pointer', ['unix_address']]],
    'dentry': [0x270, ['pointer', ['dentry']]],
    'mnt': [0x278, ['pointer', ['vfsmount']]],
    'readlock': [0x280, ['mutex']],
    'peer': [0x2a0, ['pointer', ['sock']]],
    'other': [0x2a8, ['pointer', ['sock']]],
    'link': [0x2b0, ['list_head']],
    'inflight': [0x2c0, ['__unnamed_0x3b0']],
    'lock': [0x2c8, ['spinlock']],
    'gc_maybe_cycle': [0x2cc, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'gc_candidate': [0x2cc, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'recursion_level': [0x2cd, ['unsigned char']],
    'peer_wq': [0x300, ['socket_wq']],
}],
  'block_device': [ 0xe0, {
    'bd_dev': [0x0, ['unsigned int']],
    'bd_inode': [0x8, ['pointer', ['inode']]],
    'bd_super': [0x10, ['pointer', ['super_block']]],
    'bd_openers': [0x18, ['int']],
    'bd_mutex': [0x20, ['mutex']],
    'bd_inodes': [0x40, ['list_head']],
    'bd_claiming': [0x50, ['pointer', ['void']]],
    'bd_holder': [0x58, ['pointer', ['void']]],
    'bd_holders': [0x60, ['int']],
    'bd_write_holder': [0x64, ['unsigned char']],
    'bd_holder_disks': [0x68, ['list_head']],
    'bd_contains': [0x78, ['pointer', ['block_device']]],
    'bd_block_size': [0x80, ['unsigned int']],
    'bd_part': [0x88, ['pointer', ['hd_struct']]],
    'bd_part_count': [0x90, ['unsigned int']],
    'bd_invalidated': [0x94, ['int']],
    'bd_disk': [0x98, ['pointer', ['gendisk']]],
    'bd_list': [0xa0, ['list_head']],
    'bd_private': [0xb0, ['long']],
    'bd_fsfreeze_count': [0xb8, ['int']],
    'bd_fsfreeze_mutex': [0xc0, ['mutex']],
}],
  'inetpeer_addr': [ 0x14, {
    '__unnamed_0x14957': [0x0, ['__unnamed_0x1492e']],
    'family': [0x10, ['unsigned short']],
}],
  '__unnamed_0xdad0': [ 0x4, {
    'dropcount': [0x0, ['unsigned int']],
    'mark': [0x0, ['unsigned int']],
}],
  'seq_file': [ 0x68, {
    'buf': [0x0, ['pointer', ['char']]],
    'size': [0x8, ['long']],
    'from': [0x10, ['long']],
    'count': [0x18, ['long']],
    'index': [0x20, ['long long']],
    'read_pos': [0x28, ['long long']],
    'version': [0x30, ['unsigned long long']],
    'lock': [0x38, ['mutex']],
    'op': [0x58, ['pointer', ['seq_operations']]],
    'private': [0x60, ['pointer', ['void']]],
}],
  'fib_node': [ 0x48, {
    'fn_hash': [0x0, ['pointer', ['void']]],
    'fn_alias': [0x10, ['list_head']],
    'fn_key': [0x20, ['unsigned int']],
    'fn_embedded_alias': [0x28, ['fib_alias']],
}],
  '__unnamed_0xdcfe': [ 0x8, {
    'interval': [0x0, ['unsigned int']],
    'timeout': [0x4, ['unsigned int']],
}],
  'scatterlist': [ 0x20, {
    'page_link': [0x0, ['long']],
    'offset': [0x8, ['unsigned int']],
    'length': [0xc, ['unsigned int']],
    'dma_address': [0x10, ['unsigned long']],
    'dma_length': [0x18, ['unsigned int']],
}],
  'icmpv6_mib': [ 0x28, {
    'mibs': [0x0, ['array', 5, ['long']]],
}],
  'sched_rt_entity': [ 0x40, {
    'run_list': [0x0, ['list_head']],
    'timeout': [0x10, ['long']],
    'time_slice': [0x18, ['unsigned int']],
    'nr_cpus_allowed': [0x1c, ['int']],
    'back': [0x20, ['pointer', ['sched_rt_entity']]],
    'parent': [0x28, ['pointer', ['sched_rt_entity']]],
    'rt_rq': [0x30, ['pointer', ['rt_rq']]],
    'my_q': [0x38, ['pointer', ['rt_rq']]],
}],
  'pt_regs': [ 0xa8, {
    'r15': [0x0, ['unsigned long']],
    'r14': [0x8, ['unsigned long']],
    'r13': [0x10, ['unsigned long']],
    'r12': [0x18, ['unsigned long']],
    'bp': [0x20, ['unsigned long']],
    'bx': [0x28, ['unsigned long']],
    'r11': [0x30, ['unsigned long']],
    'r10': [0x38, ['unsigned long']],
    'r9': [0x40, ['unsigned long']],
    'r8': [0x48, ['unsigned long']],
    'ax': [0x50, ['unsigned long']],
    'cx': [0x58, ['unsigned long']],
    'dx': [0x60, ['unsigned long']],
    'si': [0x68, ['unsigned long']],
    'di': [0x70, ['unsigned long']],
    'orig_ax': [0x78, ['unsigned long']],
    'ip': [0x80, ['unsigned long']],
    'cs': [0x88, ['unsigned long']],
    'flags': [0x90, ['unsigned long']],
    'sp': [0x98, ['unsigned long']],
    'ss': [0xa0, ['unsigned long']],
}],
  'inet_listen_hashbucket': [ 0x10, {
    'lock': [0x0, ['spinlock']],
    'head': [0x8, ['hlist_nulls_head']],
}],
  'signal_struct': [ 0x408, {
    'sigcnt': [0x0, ['__unnamed_0x38e']],
    'live': [0x4, ['__unnamed_0x38e']],
    'nr_threads': [0x8, ['int']],
    'wait_chldexit': [0x10, ['__wait_queue_head']],
    'curr_target': [0x28, ['pointer', ['task_struct']]],
    'shared_pending': [0x30, ['sigpending']],
    'group_exit_code': [0x48, ['int']],
    'notify_count': [0x4c, ['int']],
    'group_exit_task': [0x50, ['pointer', ['task_struct']]],
    'group_stop_count': [0x58, ['int']],
    'flags': [0x5c, ['unsigned int']],
    'posix_timers': [0x60, ['list_head']],
    'real_timer': [0x70, ['hrtimer']],
    'leader_pid': [0xd0, ['pointer', ['pid']]],
    'it_real_incr': [0xd8, ['ktime']],
    'it': [0xe0, ['array', 2, ['cpu_itimer']]],
    'cputimer': [0x110, ['thread_group_cputimer']],
    'cputime_expires': [0x130, ['task_cputime']],
    'cpu_timers': [0x148, ['array', 3, ['list_head']]],
    'tty_old_pgrp': [0x178, ['pointer', ['pid']]],
    'leader': [0x180, ['int']],
    'tty': [0x188, ['pointer', ['tty_struct']]],
    'autogroup': [0x190, ['pointer', ['autogroup']]],
    'utime': [0x198, ['long']],
    'stime': [0x1a0, ['long']],
    'cutime': [0x1a8, ['long']],
    'cstime': [0x1b0, ['long']],
    'gtime': [0x1b8, ['long']],
    'cgtime': [0x1c0, ['long']],
    'prev_utime': [0x1c8, ['long']],
    'prev_stime': [0x1d0, ['long']],
    'nvcsw': [0x1d8, ['long']],
    'nivcsw': [0x1e0, ['long']],
    'cnvcsw': [0x1e8, ['long']],
    'cnivcsw': [0x1f0, ['long']],
    'min_flt': [0x1f8, ['long']],
    'maj_flt': [0x200, ['long']],
    'cmin_flt': [0x208, ['long']],
    'cmaj_flt': [0x210, ['long']],
    'inblock': [0x218, ['long']],
    'oublock': [0x220, ['long']],
    'cinblock': [0x228, ['long']],
    'coublock': [0x230, ['long']],
    'maxrss': [0x238, ['long']],
    'cmaxrss': [0x240, ['long']],
    'ioac': [0x248, ['task_io_accounting']],
    'sum_sched_runtime': [0x280, ['unsigned long long']],
    'rlim': [0x288, ['array', 16, ['rlimit']]],
    'pacct': [0x388, ['pacct_struct']],
    'stats': [0x3c0, ['pointer', ['taskstats']]],
    'audit_tty': [0x3c8, ['unsigned int']],
    'tty_audit_buf': [0x3d0, ['pointer', ['tty_audit_buf']]],
    'oom_adj': [0x3d8, ['int']],
    'oom_score_adj': [0x3dc, ['int']],
    'oom_score_adj_min': [0x3e0, ['int']],
    'cred_guard_mutex': [0x3e8, ['mutex']],
}],
  'udp_mib': [ 0x38, {
    'mibs': [0x0, ['array', 7, ['long']]],
}],
  'fdtable': [ 0x38, {
    'max_fds': [0x0, ['unsigned int']],
    'fd': [0x8, ['pointer', ['pointer', ['file']]]],
    'close_on_exec': [0x10, ['pointer', ['__unnamed_0x152']]],
    'open_fds': [0x18, ['pointer', ['__unnamed_0x152']]],
    'rcu': [0x20, ['rcu_head']],
    'next': [0x30, ['pointer', ['fdtable']]],
}],
  'hrtimer_cpu_base': [ 0xb8, {
    'lock': [0x0, ['raw_spinlock']],
    'clock_base': [0x8, ['array', 2, ['hrtimer_clock_base']]],
    'expires_next': [0x88, ['ktime']],
    'hres_active': [0x90, ['int']],
    'hang_detected': [0x94, ['int']],
    'nr_events': [0x98, ['long']],
    'nr_retries': [0xa0, ['long']],
    'nr_hangs': [0xa8, ['long']],
    'max_hang_time': [0xb0, ['ktime']],
}],
  'proto': [ 0x168, {
    'close': [0x0, ['pointer', ['void']]],
    'connect': [0x8, ['pointer', ['void']]],
    'disconnect': [0x10, ['pointer', ['void']]],
    'accept': [0x18, ['pointer', ['void']]],
    'ioctl': [0x20, ['pointer', ['void']]],
    'init': [0x28, ['pointer', ['void']]],
    'destroy': [0x30, ['pointer', ['void']]],
    'shutdown': [0x38, ['pointer', ['void']]],
    'setsockopt': [0x40, ['pointer', ['void']]],
    'getsockopt': [0x48, ['pointer', ['void']]],
    'compat_setsockopt': [0x50, ['pointer', ['void']]],
    'compat_getsockopt': [0x58, ['pointer', ['void']]],
    'compat_ioctl': [0x60, ['pointer', ['void']]],
    'sendmsg': [0x68, ['pointer', ['void']]],
    'recvmsg': [0x70, ['pointer', ['void']]],
    'sendpage': [0x78, ['pointer', ['void']]],
    'bind': [0x80, ['pointer', ['void']]],
    'backlog_rcv': [0x88, ['pointer', ['void']]],
    'hash': [0x90, ['pointer', ['void']]],
    'unhash': [0x98, ['pointer', ['void']]],
    'rehash': [0xa0, ['pointer', ['void']]],
    'get_port': [0xa8, ['pointer', ['void']]],
    'clear_sk': [0xb0, ['pointer', ['void']]],
    'inuse_idx': [0xb8, ['unsigned int']],
    'enter_memory_pressure': [0xc0, ['pointer', ['void']]],
    'memory_allocated': [0xc8, ['pointer', ['__unnamed_0x3b0']]],
    'sockets_allocated': [0xd0, ['pointer', ['percpu_counter']]],
    'memory_pressure': [0xd8, ['pointer', ['int']]],
    'sysctl_mem': [0xe0, ['pointer', ['long']]],
    'sysctl_wmem': [0xe8, ['pointer', ['int']]],
    'sysctl_rmem': [0xf0, ['pointer', ['int']]],
    'max_header': [0xf8, ['int']],
    'no_autobind': [0xfc, ['unsigned char']],
    'slab': [0x100, ['pointer', ['kmem_cache']]],
    'obj_size': [0x108, ['unsigned int']],
    'slab_flags': [0x10c, ['int']],
    'orphan_count': [0x110, ['pointer', ['percpu_counter']]],
    'rsk_prot': [0x118, ['pointer', ['request_sock_ops']]],
    'twsk_prot': [0x120, ['pointer', ['timewait_sock_ops']]],
    'h': [0x128, ['__unnamed_0x13860']],
    'owner': [0x130, ['pointer', ['module']]],
    'name': [0x138, ['array', 32, ['char']]],
    'node': [0x158, ['list_head']],
}],
  'smp_ops': [ 0x58, {
    'smp_prepare_boot_cpu': [0x0, ['pointer', ['void']]],
    'smp_prepare_cpus': [0x8, ['pointer', ['void']]],
    'smp_cpus_done': [0x10, ['pointer', ['void']]],
    'stop_other_cpus': [0x18, ['pointer', ['void']]],
    'smp_send_reschedule': [0x20, ['pointer', ['void']]],
    'cpu_up': [0x28, ['pointer', ['void']]],
    'cpu_disable': [0x30, ['pointer', ['void']]],
    'cpu_die': [0x38, ['pointer', ['void']]],
    'play_dead': [0x40, ['pointer', ['void']]],
    'send_call_func_ipi': [0x48, ['pointer', ['void']]],
    'send_call_func_single_ipi': [0x50, ['pointer', ['void']]],
}],
  'desc_struct': [ 0x8, {
    '__unnamed_0x6b7': [0x0, ['__unnamed_0x698']],
}],
  'fib_rule_hdr': [ 0xc, {
    'family': [0x0, ['unsigned char']],
    'dst_len': [0x1, ['unsigned char']],
    'src_len': [0x2, ['unsigned char']],
    'tos': [0x3, ['unsigned char']],
    'table': [0x4, ['unsigned char']],
    'res1': [0x5, ['unsigned char']],
    'res2': [0x6, ['unsigned char']],
    'action': [0x7, ['unsigned char']],
    'flags': [0x8, ['unsigned int']],
}],
  '__unnamed_0x300e': [ 0x20, {
    'arg0': [0x0, ['long']],
    'arg1': [0x8, ['long']],
    'arg2': [0x10, ['long']],
    'arg3': [0x18, ['long']],
}],
  'rw_semaphore': [ 0x20, {
    'count': [0x0, ['long']],
    'wait_lock': [0x8, ['spinlock']],
    'wait_list': [0x10, ['list_head']],
}],
  'flowi': [ 0x40, {
    'oif': [0x0, ['int']],
    'iif': [0x4, ['int']],
    'mark': [0x8, ['unsigned int']],
    'nl_u': [0xc, ['__unnamed_0x10ae5']],
    'proto': [0x30, ['unsigned char']],
    'flags': [0x31, ['unsigned char']],
    'uli_u': [0x34, ['__unnamed_0x10b95']],
    'secid': [0x38, ['unsigned int']],
}],
  '__unnamed_0x3399': [ 0x8, {
    'sequence': [0x0, ['unsigned int']],
    'lock': [0x4, ['spinlock']],
}],
  'net': [ 0xa00, {
    'count': [0x0, ['__unnamed_0x38e']],
    'rules_mod_lock': [0x4, ['spinlock']],
    'list': [0x8, ['list_head']],
    'cleanup_list': [0x18, ['list_head']],
    'exit_list': [0x28, ['list_head']],
    'proc_net': [0x38, ['pointer', ['proc_dir_entry']]],
    'proc_net_stat': [0x40, ['pointer', ['proc_dir_entry']]],
    'sysctls': [0x48, ['ctl_table_set']],
    'rtnl': [0x68, ['pointer', ['sock']]],
    'genl_sock': [0x70, ['pointer', ['sock']]],
    'dev_base_head': [0x78, ['list_head']],
    'dev_name_head': [0x88, ['pointer', ['hlist_head']]],
    'dev_index_head': [0x90, ['pointer', ['hlist_head']]],
    'rules_ops': [0x98, ['list_head']],
    'loopback_dev': [0xa8, ['pointer', ['net_device']]],
    'core': [0xb0, ['netns_core']],
    'mib': [0xc8, ['netns_mib']],
    'packet': [0x190, ['netns_packet']],
    'unx': [0x1a0, ['netns_unix']],
    'ipv4': [0x1b0, ['netns_ipv4']],
    'ipv6': [0x2c0, ['netns_ipv6']],
    'dccp': [0x500, ['netns_dccp']],
    'xt': [0x510, ['netns_xt']],
    'ct': [0x5f8, ['netns_ct']],
    'nfnl': [0x678, ['pointer', ['sock']]],
    'nfnl_stash': [0x680, ['pointer', ['sock']]],
    'wext_nlevents': [0x688, ['sk_buff_head']],
    'gen': [0x6a0, ['pointer', ['net_generic']]],
    'xfrm': [0x6c0, ['netns_xfrm']],
}],
  'in6_pktinfo': [ 0x14, {
    'ipi6_addr': [0x0, ['in6_addr']],
    'ipi6_ifindex': [0x10, ['int']],
}],
  '__unnamed_0x207a': [ 0x8, {
    'sequence': [0x0, ['unsigned int']],
    'lock': [0x4, ['spinlock']],
}],
  'file_lock_operations': [ 0x10, {
    'fl_copy_lock': [0x0, ['pointer', ['void']]],
    'fl_release_private': [0x8, ['pointer', ['void']]],
}],
  'io_event': [ 0x20, {
    'data': [0x0, ['unsigned long long']],
    'obj': [0x8, ['unsigned long long']],
    'res': [0x10, ['long long']],
    'res2': [0x18, ['long long']],
}],
  'quotactl_ops': [ 0x50, {
    'quota_on': [0x0, ['pointer', ['void']]],
    'quota_on_meta': [0x8, ['pointer', ['void']]],
    'quota_off': [0x10, ['pointer', ['void']]],
    'quota_sync': [0x18, ['pointer', ['void']]],
    'get_info': [0x20, ['pointer', ['void']]],
    'set_info': [0x28, ['pointer', ['void']]],
    'get_dqblk': [0x30, ['pointer', ['void']]],
    'set_dqblk': [0x38, ['pointer', ['void']]],
    'get_xstate': [0x40, ['pointer', ['void']]],
    'set_xstate': [0x48, ['pointer', ['void']]],
}],
  'core_thread': [ 0x10, {
    'task': [0x0, ['pointer', ['task_struct']]],
    'next': [0x8, ['pointer', ['core_thread']]],
}],
  'tracepoint': [ 0x28, {
    'name': [0x0, ['pointer', ['char']]],
    'state': [0x8, ['int']],
    'regfunc': [0x10, ['pointer', ['void']]],
    'unregfunc': [0x18, ['pointer', ['void']]],
    'funcs': [0x20, ['pointer', ['tracepoint_func']]],
}],
  'zonelist': [ 0x1240, {
    'zlcache_ptr': [0x0, ['pointer', ['zonelist_cache']]],
    '_zonerefs': [0x8, ['array', 257, ['zoneref']]],
    'zlcache': [0x1018, ['zonelist_cache']],
}],
  '__unnamed_0x8221': [ 0x8, {
    'i_cdev': [0x0, ['pointer', ['cdev']]],
    'i_bdev': [0x0, ['pointer', ['block_device']]],
    'i_pipe': [0x0, ['pointer', ['pipe_inode_info']]],
}],
  'ethtool_rxfh_indir': [ 0x8, {
    'cmd': [0x0, ['unsigned int']],
    'size': [0x4, ['unsigned int']],
    'ring_index': [0x8, ['array', 0, ['unsigned int']]],
}],
  '__unnamed_0x10a3e': [ 0xc, {
    'daddr': [0x0, ['unsigned int']],
    'saddr': [0x4, ['unsigned int']],
    'tos': [0x8, ['unsigned char']],
    'scope': [0x9, ['unsigned char']],
}],
  'pid_link': [ 0x18, {
    'node': [0x0, ['pointer', ['void']]],
    'pid': [0x10, ['pointer', ['pid']]],
}],
  'x86_init_resources': [ 0x18, {
    'probe_roms': [0x0, ['pointer', ['void']]],
    'reserve_resources': [0x8, ['pointer', ['void']]],
    'memory_setup': [0x10, ['pointer', ['void']]],
}],
  'icmpmsg_mib': [ 0x1000, {
    'mibs': [0x0, ['array', 512, ['long']]],
}],
  'ifmap': [ 0x18, {
    'mem_start': [0x0, ['long']],
    'mem_end': [0x8, ['long']],
    'base_addr': [0x10, ['unsigned short']],
    'irq': [0x12, ['unsigned char']],
    'dma': [0x13, ['unsigned char']],
    'port': [0x14, ['unsigned char']],
}],
  '__unnamed_0x9c5b': [ 0x10, {
    'private': [0x0, ['long']],
    'mapping': [0x8, ['pointer', ['address_space']]],
}],
  'ifmcaddr6': [ 0xb8, {
    'mca_addr': [0x0, ['in6_addr']],
    'idev': [0x10, ['pointer', ['inet6_dev']]],
    'next': [0x18, ['pointer', ['ifmcaddr6']]],
    'mca_sources': [0x20, ['pointer', ['ip6_sf_list']]],
    'mca_tomb': [0x28, ['pointer', ['ip6_sf_list']]],
    'mca_sfmode': [0x30, ['unsigned int']],
    'mca_crcount': [0x34, ['unsigned char']],
    'mca_sfcount': [0x38, ['array', 2, ['long']]],
    'mca_timer': [0x48, ['timer_list']],
    'mca_flags': [0x98, ['unsigned int']],
    'mca_users': [0x9c, ['int']],
    'mca_refcnt': [0xa0, ['__unnamed_0x38e']],
    'mca_lock': [0xa4, ['spinlock']],
    'mca_cstamp': [0xa8, ['long']],
    'mca_tstamp': [0xb0, ['long']],
}],
  'sem_undo_list': [ 0x18, {
    'refcnt': [0x0, ['__unnamed_0x38e']],
    'lock': [0x4, ['spinlock']],
    'list_proc': [0x8, ['list_head']],
}],
  'kernel_vm86_regs': [ 0xb8, {
    'pt': [0x0, ['pt_regs']],
    'es': [0xa8, ['unsigned short']],
    '__esh': [0xaa, ['unsigned short']],
    'ds': [0xac, ['unsigned short']],
    '__dsh': [0xae, ['unsigned short']],
    'fs': [0xb0, ['unsigned short']],
    '__fsh': [0xb2, ['unsigned short']],
    'gs': [0xb4, ['unsigned short']],
    '__gsh': [0xb6, ['unsigned short']],
}],
  'neigh_hash_table': [ 0x20, {
    'hash_buckets': [0x0, ['pointer', ['pointer', ['neighbour']]]],
    'hash_mask': [0x8, ['unsigned int']],
    'hash_rnd': [0xc, ['unsigned int']],
    'rcu': [0x10, ['rcu_head']],
}],
  'kernel_cap_struct': [ 0x8, {
    'cap': [0x0, ['array', 2, ['unsigned int']]],
}],
  'kmem_cache_cpu': [ 0x18, {
    'freelist': [0x0, ['pointer', ['pointer', ['void']]]],
    'page': [0x8, ['pointer', ['page']]],
    'node': [0x10, ['int']],
}],
  'sock_filter': [ 0x8, {
    'code': [0x0, ['unsigned short']],
    'jt': [0x2, ['unsigned char']],
    'jf': [0x3, ['unsigned char']],
    'k': [0x4, ['unsigned int']],
}],
  '__unnamed_0x13288': [ 0x8, {
    'rt6_next': [0x0, ['pointer', ['rt6_info']]],
    'rt_next': [0x0, ['pointer', ['rtable']]],
    'dn_next': [0x0, ['pointer', ['dn_route']]],
    'next': [0x0, ['pointer', ['dst_entry']]],
}],
  '__unnamed_0xa9e0': [ 0x8, {
    'data': [0x0, ['pointer', ['void']]],
    'rcudata': [0x0, ['pointer', ['void']]],
    'value': [0x0, ['long']],
    'subscriptions': [0x0, ['pointer', ['keyring_list']]],
}],
  'fs_quota_stat': [ 0x50, {
    'qs_version': [0x0, ['signed char']],
    'qs_flags': [0x2, ['unsigned short']],
    'qs_pad': [0x4, ['signed char']],
    'qs_uquota': [0x8, ['fs_qfilestat']],
    'qs_gquota': [0x20, ['fs_qfilestat']],
    'qs_incoredqs': [0x38, ['unsigned int']],
    'qs_btimelimit': [0x3c, ['int']],
    'qs_itimelimit': [0x40, ['int']],
    'qs_rtbtimelimit': [0x44, ['int']],
    'qs_bwarnlimit': [0x48, ['unsigned short']],
    'qs_iwarnlimit': [0x4a, ['unsigned short']],
}],
  'compat_robust_list': [ 0x4, {
    'next': [0x0, ['unsigned int']],
}],
  'fs_qfilestat': [ 0x18, {
    'qfs_ino': [0x0, ['unsigned long long']],
    'qfs_nblks': [0x8, ['unsigned long long']],
    'qfs_nextents': [0x10, ['unsigned int']],
}],
  'rtable': [ 0x140, {
    'dst': [0x0, ['dst_entry']],
    'fl': [0xd8, ['flowi']],
    'rt_genid': [0x118, ['int']],
    'rt_flags': [0x11c, ['unsigned int']],
    'rt_type': [0x120, ['unsigned short']],
    'rt_dst': [0x124, ['unsigned int']],
    'rt_src': [0x128, ['unsigned int']],
    'rt_iif': [0x12c, ['int']],
    'rt_gateway': [0x130, ['unsigned int']],
    'rt_spec_dst': [0x134, ['unsigned int']],
    'peer': [0x138, ['pointer', ['inet_peer']]],
}],
  'netns_xt': [ 0xe8, {
    'tables': [0x0, ['array', 13, ['list_head']]],
    'broute_table': [0xd0, ['pointer', ['ebt_table']]],
    'frame_filter': [0xd8, ['pointer', ['ebt_table']]],
    'frame_nat': [0xe0, ['pointer', ['ebt_table']]],
}],
  '__unnamed_0xea79': [ 0x48, {
    'ah_ip4_spec': [0x0, ['ethtool_ah_espip4_spec']],
    'usr_ip4_spec': [0x0, ['ethtool_usrip4_spec']],
    'hdata': [0x0, ['array', 72, ['unsigned char']]],
    'ether_spec': [0x0, ['ethhdr']],
    'udp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
    'esp_ip4_spec': [0x0, ['ethtool_ah_espip4_spec']],
    'sctp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
    'tcp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
}],
  'dst_ops': [ 0xc0, {
    'family': [0x0, ['unsigned short']],
    'protocol': [0x2, ['unsigned short']],
    'gc_thresh': [0x4, ['unsigned int']],
    'gc': [0x8, ['pointer', ['void']]],
    'check': [0x10, ['pointer', ['void']]],
    'default_advmss': [0x18, ['pointer', ['void']]],
    'default_mtu': [0x20, ['pointer', ['void']]],
    'destroy': [0x28, ['pointer', ['void']]],
    'ifdown': [0x30, ['pointer', ['void']]],
    'negative_advice': [0x38, ['pointer', ['void']]],
    'link_failure': [0x40, ['pointer', ['void']]],
    'update_pmtu': [0x48, ['pointer', ['void']]],
    'local_out': [0x50, ['pointer', ['void']]],
    'kmem_cachep': [0x58, ['pointer', ['kmem_cache']]],
    'pcpuc_entries': [0x80, ['percpu_counter']],
}],
  'x86_init_iommu': [ 0x8, {
    'iommu_init': [0x0, ['pointer', ['void']]],
}],
  'ethtool_drvinfo': [ 0xc4, {
    'cmd': [0x0, ['unsigned int']],
    'driver': [0x4, ['array', 32, ['char']]],
    'version': [0x24, ['array', 32, ['char']]],
    'fw_version': [0x44, ['array', 32, ['char']]],
    'bus_info': [0x64, ['array', 32, ['char']]],
    'reserved1': [0x84, ['array', 32, ['char']]],
    'reserved2': [0xa4, ['array', 12, ['char']]],
    'n_priv_flags': [0xb0, ['unsigned int']],
    'n_stats': [0xb4, ['unsigned int']],
    'testinfo_len': [0xb8, ['unsigned int']],
    'eedump_len': [0xbc, ['unsigned int']],
    'regdump_len': [0xc0, ['unsigned int']],
}],
  'netns_dccp': [ 0x10, {
    'v4_ctl_sk': [0x0, ['pointer', ['sock']]],
    'v6_ctl_sk': [0x8, ['pointer', ['sock']]],
}],
  'lock_class_key': [ 0x0, {
}],
  'kobj_ns_type_operations': [ 0x20, {
    'type': [0x0, ['Enumeration', {'target': 'int', 'choices': {0: 'KOBJ_NS_TYPE_NONE', 1: 'KOBJ_NS_TYPE_NET', 2: 'KOBJ_NS_TYPES'}}]],
    'current_ns': [0x8, ['pointer', ['void']]],
    'netlink_ns': [0x10, ['pointer', ['void']]],
    'initial_ns': [0x18, ['pointer', ['void']]],
}],
  'dev_pm_ops': [ 0x88, {
    'prepare': [0x0, ['pointer', ['void']]],
    'complete': [0x8, ['pointer', ['void']]],
    'suspend': [0x10, ['pointer', ['void']]],
    'resume': [0x18, ['pointer', ['void']]],
    'freeze': [0x20, ['pointer', ['void']]],
    'thaw': [0x28, ['pointer', ['void']]],
    'poweroff': [0x30, ['pointer', ['void']]],
    'restore': [0x38, ['pointer', ['void']]],
    'suspend_noirq': [0x40, ['pointer', ['void']]],
    'resume_noirq': [0x48, ['pointer', ['void']]],
    'freeze_noirq': [0x50, ['pointer', ['void']]],
    'thaw_noirq': [0x58, ['pointer', ['void']]],
    'poweroff_noirq': [0x60, ['pointer', ['void']]],
    'restore_noirq': [0x68, ['pointer', ['void']]],
    'runtime_suspend': [0x70, ['pointer', ['void']]],
    'runtime_resume': [0x78, ['pointer', ['void']]],
    'runtime_idle': [0x80, ['pointer', ['void']]],
}],
  'fn_hash': [ 0x110, {
    'fn_zones': [0x0, ['array', 33, ['pointer', ['fn_zone']]]],
    'fn_zone_list': [0x108, ['pointer', ['fn_zone']]],
}],
  'latency_record': [ 0x78, {
    'backtrace': [0x0, ['array', 12, ['long']]],
    'count': [0x60, ['unsigned int']],
    'time': [0x68, ['long']],
    'max': [0x70, ['long']],
}],
  'page': [ 0x38, {
    'flags': [0x0, ['long']],
    '_count': [0x8, ['__unnamed_0x38e']],
    '__unnamed_0x85c': [0xc, ['__unnamed_0x9c42']],
    '__unnamed_0x864': [0x10, ['__unnamed_0x9c80']],
    '__unnamed_0x86c': [0x20, ['__unnamed_0x9cb5']],
    'lru': [0x28, ['list_head']],
}],
  'hlist_bl_head': [ 0x8, {
    'first': [0x0, ['pointer', ['hlist_bl_node']]],
}],
  'ethtool_pauseparam': [ 0x10, {
    'cmd': [0x0, ['unsigned int']],
    'autoneg': [0x4, ['unsigned int']],
    'rx_pause': [0x8, ['unsigned int']],
    'tx_pause': [0xc, ['unsigned int']],
}],
  'list_head': [ 0x10, {
    'next': [0x0, ['pointer', ['list_head']]],
    'prev': [0x8, ['pointer', ['list_head']]],
}],
  'mem_dqinfo': [ 0x48, {
    'dqi_format': [0x0, ['pointer', ['quota_format_type']]],
    'dqi_fmt_id': [0x8, ['int']],
    'dqi_dirty_list': [0x10, ['list_head']],
    'dqi_flags': [0x20, ['long']],
    'dqi_bgrace': [0x28, ['unsigned int']],
    'dqi_igrace': [0x2c, ['unsigned int']],
    'dqi_maxblimit': [0x30, ['long long']],
    'dqi_maxilimit': [0x38, ['long long']],
    'dqi_priv': [0x40, ['pointer', ['void']]],
}],
  'ipv6_rt_hdr': [ 0x4, {
    'nexthdr': [0x0, ['unsigned char']],
    'hdrlen': [0x1, ['unsigned char']],
    'type': [0x2, ['unsigned char']],
    'segments_left': [0x3, ['unsigned char']],
}],
  'proto_ops': [ 0xb0, {
    'family': [0x0, ['int']],
    'owner': [0x8, ['pointer', ['module']]],
    'release': [0x10, ['pointer', ['void']]],
    'bind': [0x18, ['pointer', ['void']]],
    'connect': [0x20, ['pointer', ['void']]],
    'socketpair': [0x28, ['pointer', ['void']]],
    'accept': [0x30, ['pointer', ['void']]],
    'getname': [0x38, ['pointer', ['void']]],
    'poll': [0x40, ['pointer', ['void']]],
    'ioctl': [0x48, ['pointer', ['void']]],
    'compat_ioctl': [0x50, ['pointer', ['void']]],
    'listen': [0x58, ['pointer', ['void']]],
    'shutdown': [0x60, ['pointer', ['void']]],
    'setsockopt': [0x68, ['pointer', ['void']]],
    'getsockopt': [0x70, ['pointer', ['void']]],
    'compat_setsockopt': [0x78, ['pointer', ['void']]],
    'compat_getsockopt': [0x80, ['pointer', ['void']]],
    'sendmsg': [0x88, ['pointer', ['void']]],
    'recvmsg': [0x90, ['pointer', ['void']]],
    'mmap': [0x98, ['pointer', ['void']]],
    'sendpage': [0xa0, ['pointer', ['void']]],
    'splice_read': [0xa8, ['pointer', ['void']]],
}],
  'mem_dqblk': [ 0x48, {
    'dqb_bhardlimit': [0x0, ['long long']],
    'dqb_bsoftlimit': [0x8, ['long long']],
    'dqb_curspace': [0x10, ['long long']],
    'dqb_rsvspace': [0x18, ['long long']],
    'dqb_ihardlimit': [0x20, ['long long']],
    'dqb_isoftlimit': [0x28, ['long long']],
    'dqb_curinodes': [0x30, ['long long']],
    'dqb_btime': [0x38, ['long']],
    'dqb_itime': [0x40, ['long']],
}],
  '__unnamed_0xac61': [ 0x8, {
    'user': [0x0, ['pointer', ['void']]],
    'tsk': [0x0, ['pointer', ['task_struct']]],
}],
  'tracepoint_func': [ 0x10, {
    'func': [0x0, ['pointer', ['void']]],
    'data': [0x8, ['pointer', ['void']]],
}],
  '__unnamed_0x10b59': [ 0x4, {
    'sport': [0x0, ['unsigned short']],
    'dport': [0x2, ['unsigned short']],
}],
  'ip6_flowlabel': [ 0x50, {
    'next': [0x0, ['pointer', ['ip6_flowlabel']]],
    'label': [0x8, ['unsigned int']],
    'users': [0xc, ['__unnamed_0x38e']],
    'dst': [0x10, ['in6_addr']],
    'opt': [0x20, ['pointer', ['ipv6_txoptions']]],
    'linger': [0x28, ['long']],
    'share': [0x30, ['unsigned char']],
    'owner': [0x34, ['unsigned int']],
    'lastuse': [0x38, ['long']],
    'expires': [0x40, ['long']],
    'fl_net': [0x48, ['pointer', ['net']]],
}],
  '__unnamed_0x31d6': [ 0x28, {
    '__unnamed_0x31de': [0x0, ['__unnamed_0x300e']],
    'nanosleep': [0x0, ['__unnamed_0x30ac']],
    'poll': [0x0, ['__unnamed_0x314b']],
    'futex': [0x0, ['__unnamed_0x304f']],
}],
  'vm_event_state': [ 0x1c0, {
    'event': [0x0, ['array', 56, ['long']]],
}],
  'rcu_head': [ 0x10, {
    'next': [0x0, ['pointer', ['rcu_head']]],
    'func': [0x8, ['pointer', ['void']]],
}],
  'ymmh_struct': [ 0x100, {
    'ymmh_space': [0x0, ['array', 64, ['unsigned int']]],
}],
  '__unnamed_0x304f': [ 0x28, {
    'uaddr': [0x0, ['pointer', ['unsigned int']]],
    'val': [0x8, ['unsigned int']],
    'flags': [0xc, ['unsigned int']],
    'bitset': [0x10, ['unsigned int']],
    'time': [0x18, ['unsigned long long']],
    'uaddr2': [0x20, ['pointer', ['unsigned int']]],
}],
  'radix_tree_node': [ 0x230, {
    'height': [0x0, ['unsigned int']],
    'count': [0x4, ['unsigned int']],
    'rcu_head': [0x8, ['rcu_head']],
    'slots': [0x18, ['array', 64, ['pointer', ['void']]]],
    'tags': [0x218, ['array', 1, ['array', 3, ['long']]]],
}],
  'exception_table_entry': [ 0x10, {
    'insn': [0x0, ['long']],
    'fixup': [0x8, ['long']],
}],
  'sysv_sem': [ 0x8, {
    'undo_list': [0x0, ['pointer', ['sem_undo_list']]],
}],
  'linux_binfmt': [ 0x38, {
    'lh': [0x0, ['list_head']],
    'module': [0x10, ['pointer', ['module']]],
    'load_binary': [0x18, ['pointer', ['void']]],
    'load_shlib': [0x20, ['pointer', ['void']]],
    'core_dump': [0x28, ['pointer', ['void']]],
    'min_coredump': [0x30, ['long']],
}],
  'timekeeper': [ 0xa0, {
    'clock': [0x0, ['pointer', ['clocksource']]],
    'mult': [0x8, ['unsigned int']],
    'shift': [0xc, ['int']],
    'cycle_interval': [0x10, ['unsigned long long']],
    'xtime_interval': [0x18, ['unsigned long long']],
    'xtime_remainder': [0x20, ['long long']],
    'raw_interval': [0x28, ['unsigned int']],
    'xtime_nsec': [0x30, ['unsigned long long']],
    'ntp_error': [0x38, ['long long']],
    'ntp_error_shift': [0x40, ['int']],
    'xtime': [0x48, ['timespec']],
    'wall_to_monotonic': [0x58, ['timespec']],
    'total_sleep_time': [0x68, ['timespec']],
    'raw_time': [0x78, ['timespec']],
    'offs_real': [0x88, ['ktime']],
    'offs_boot': [0x90, ['ktime']],
    'lock': [0x98, ['__unnamed_0x3399']],
}],
  'nla_policy': [ 0x4, {
    'type': [0x0, ['unsigned short']],
    'len': [0x2, ['unsigned short']],
}],
  'core_state': [ 0x38, {
    'nr_threads': [0x0, ['__unnamed_0x38e']],
    'dumper': [0x8, ['core_thread']],
    'startup': [0x18, ['completion']],
}],
  'fs_disk_quota': [ 0x70, {
    'd_version': [0x0, ['signed char']],
    'd_flags': [0x1, ['signed char']],
    'd_fieldmask': [0x2, ['unsigned short']],
    'd_id': [0x4, ['unsigned int']],
    'd_blk_hardlimit': [0x8, ['unsigned long long']],
    'd_blk_softlimit': [0x10, ['unsigned long long']],
    'd_ino_hardlimit': [0x18, ['unsigned long long']],
    'd_ino_softlimit': [0x20, ['unsigned long long']],
    'd_bcount': [0x28, ['unsigned long long']],
    'd_icount': [0x30, ['unsigned long long']],
    'd_itimer': [0x38, ['int']],
    'd_btimer': [0x3c, ['int']],
    'd_iwarns': [0x40, ['unsigned short']],
    'd_bwarns': [0x42, ['unsigned short']],
    'd_padding2': [0x44, ['int']],
    'd_rtb_hardlimit': [0x48, ['unsigned long long']],
    'd_rtb_softlimit': [0x50, ['unsigned long long']],
    'd_rtbcount': [0x58, ['unsigned long long']],
    'd_rtbtimer': [0x60, ['int']],
    'd_rtbwarns': [0x64, ['unsigned short']],
    'd_padding3': [0x66, ['short']],
    'd_padding4': [0x68, ['array', 8, ['char']]],
}],
  'prop_local_single': [ 0x18, {
    'events': [0x0, ['long']],
    'period': [0x8, ['long']],
    'shift': [0x10, ['int']],
    'lock': [0x14, ['spinlock']],
}],
  'zone_reclaim_stat': [ 0x48, {
    'recent_rotated': [0x0, ['array', 2, ['unsigned long']]],
    'recent_scanned': [0x10, ['array', 2, ['unsigned long']]],
    'nr_saved_scan': [0x20, ['array', 5, ['unsigned long']]],
}],
  '__unnamed_0xde59': [ 0x18, {
    'ifru_hwaddr': [0x0, ['sockaddr']],
    'ifru_data': [0x0, ['pointer', ['void']]],
    'ifru_broadaddr': [0x0, ['sockaddr']],
    'ifru_settings': [0x0, ['if_settings']],
    'ifru_map': [0x0, ['ifmap']],
    'ifru_mtu': [0x0, ['int']],
    'ifru_addr': [0x0, ['sockaddr']],
    'ifru_flags': [0x0, ['short']],
    'ifru_ivalue': [0x0, ['int']],
    'ifru_newname': [0x0, ['array', 16, ['char']]],
    'ifru_dstaddr': [0x0, ['sockaddr']],
    'ifru_slave': [0x0, ['array', 16, ['char']]],
    'ifru_netmask': [0x0, ['sockaddr']],
}],
  'xfrm_policy_hash': [ 0x10, {
    'table': [0x0, ['pointer', ['hlist_head']]],
    'hmask': [0x8, ['unsigned int']],
}],
  'per_cpu_pageset': [ 0x68, {
    'pcp': [0x0, ['per_cpu_pages']],
    'expire': [0x40, ['signed char']],
    'stat_threshold': [0x41, ['signed char']],
    'vm_stat_diff': [0x42, ['array', 32, ['signed char']]],
}],
  '__unnamed_0x10a7f': [ 0x24, {
    'daddr': [0x0, ['in6_addr']],
    'saddr': [0x10, ['in6_addr']],
    'flowlabel': [0x20, ['unsigned int']],
}],
  '__unnamed_0x133dd': [ 0x4, {
    'skc_hash': [0x0, ['unsigned int']],
    'skc_u16hashes': [0x0, ['array', 2, ['unsigned short']]],
}],
  'vfsmount': [ 0xf0, {
    'mnt_hash': [0x0, ['list_head']],
    'mnt_parent': [0x10, ['pointer', ['vfsmount']]],
    'mnt_mountpoint': [0x18, ['pointer', ['dentry']]],
    'mnt_root': [0x20, ['pointer', ['dentry']]],
    'mnt_sb': [0x28, ['pointer', ['super_block']]],
    'mnt_pcp': [0x30, ['pointer', ['mnt_pcp']]],
    'mnt_longterm': [0x38, ['__unnamed_0x38e']],
    'mnt_mounts': [0x40, ['list_head']],
    'mnt_child': [0x50, ['list_head']],
    'mnt_flags': [0x60, ['int']],
    'mnt_fsnotify_mask': [0x64, ['unsigned int']],
    'mnt_fsnotify_marks': [0x68, ['hlist_head']],
    'mnt_devname': [0x70, ['pointer', ['char']]],
    'mnt_list': [0x78, ['list_head']],
    'mnt_expire': [0x88, ['list_head']],
    'mnt_share': [0x98, ['list_head']],
    'mnt_slave_list': [0xa8, ['list_head']],
    'mnt_slave': [0xb8, ['list_head']],
    'mnt_master': [0xc8, ['pointer', ['vfsmount']]],
    'mnt_ns': [0xd0, ['pointer', ['mnt_namespace']]],
    'mnt_id': [0xd8, ['int']],
    'mnt_group_id': [0xdc, ['int']],
    'mnt_expiry_mark': [0xe0, ['int']],
    'mnt_pinned': [0xe4, ['int']],
    'mnt_ghosts': [0xe8, ['int']],
}],
  'timerqueue_node': [ 0x20, {
    'node': [0x0, ['rb_node']],
    'expires': [0x18, ['ktime']],
}],
  'ethtool_rx_flow_spec': [ 0xa8, {
    'flow_type': [0x0, ['unsigned int']],
    'h_u': [0x4, ['__unnamed_0xe8e2']],
    'm_u': [0x4c, ['__unnamed_0xe8e2']],
    'ring_cookie': [0x98, ['unsigned long long']],
    'location': [0xa0, ['unsigned int']],
}],
  'klist_node': [ 0x20, {
    'n_klist': [0x0, ['pointer', ['void']]],
    'n_node': [0x8, ['list_head']],
    'n_ref': [0x18, ['kref']],
}],
  '__unnamed_0x9c1d': [ 0x4, {
    'inuse': [0x0, ['unsigned short']],
    'objects': [0x2, ['unsigned short']],
}],
  'unix_address': [ 0xc, {
    'refcnt': [0x0, ['__unnamed_0x38e']],
    'len': [0x4, ['int']],
    'hash': [0x8, ['unsigned int']],
    'name': [0xc, ['array', 0, ['sockaddr_un']]],
}],
  '__unnamed_0xa9aa': [ 0x10, {
    'x': [0x0, ['array', 2, ['long']]],
    'link': [0x0, ['list_head']],
    'p': [0x0, ['array', 2, ['pointer', ['void']]]],
}],
  'task_struct': [ 0x16a8, {
    'state': [0x0, ['long']],
    'stack': [0x8, ['pointer', ['void']]],
    'usage': [0x10, ['__unnamed_0x38e']],
    'flags': [0x14, ['unsigned int']],
    'ptrace': [0x18, ['unsigned int']],
    'lock_depth': [0x1c, ['int']],
    'prio': [0x20, ['int']],
    'static_prio': [0x24, ['int']],
    'normal_prio': [0x28, ['int']],
    'rt_priority': [0x2c, ['unsigned int']],
    'sched_class': [0x30, ['pointer', ['sched_class']]],
    'se': [0x38, ['sched_entity']],
    'rt': [0x190, ['sched_rt_entity']],
    'preempt_notifiers': [0x1d0, ['hlist_head']],
    'fpu_counter': [0x1d8, ['unsigned char']],
    'btrace_seq': [0x1dc, ['unsigned int']],
    'policy': [0x1e0, ['unsigned int']],
    'cpus_allowed': [0x1e8, ['cpumask']],
    'sched_info': [0x1f0, ['sched_info']],
    'tasks': [0x218, ['list_head']],
    'pushable_tasks': [0x228, ['plist_node']],
    'mm': [0x250, ['pointer', ['mm_struct']]],
    'active_mm': [0x258, ['pointer', ['mm_struct']]],
    'rss_stat': [0x260, ['task_rss_stat']],
    'exit_state': [0x270, ['int']],
    'exit_code': [0x274, ['int']],
    'exit_signal': [0x278, ['int']],
    'pdeath_signal': [0x27c, ['int']],
    'personality': [0x280, ['unsigned int']],
    'did_exec': [0x284, ['BitField', {'end_bit': 1, 'start_bit': 0}]],
    'in_iowait': [0x284, ['BitField', {'end_bit': 3, 'start_bit': 2}]],
    'in_execve': [0x284, ['BitField', {'end_bit': 2, 'start_bit': 1}]],
    'sched_reset_on_fork': [0x284, ['BitField', {'end_bit': 4, 'start_bit': 3}]],
    'pid': [0x288, ['int']],
    'tgid': [0x28c, ['int']],
    'stack_canary': [0x290, ['long']],
    'real_parent': [0x298, ['pointer', ['task_struct']]],
    'parent': [0x2a0, ['pointer', ['task_struct']]],
    'children': [0x2a8, ['list_head']],
    'sibling': [0x2b8, ['list_head']],
    'group_leader': [0x2c8, ['pointer', ['task_struct']]],
    'ptraced': [0x2d0, ['list_head']],
    'ptrace_entry': [0x2e0, ['list_head']],
    'pids': [0x2f0, ['array', 3, ['pid_link']]],
    'thread_group': [0x338, ['list_head']],
    'vfork_done': [0x348, ['pointer', ['completion']]],
    'set_child_tid': [0x350, ['pointer', ['int']]],
    'clear_child_tid': [0x358, ['pointer', ['int']]],
    'utime': [0x360, ['long']],
    'stime': [0x368, ['long']],
    'utimescaled': [0x370, ['long']],
    'stimescaled': [0x378, ['long']],
    'gtime': [0x380, ['long']],
    'prev_utime': [0x388, ['long']],
    'prev_stime': [0x390, ['long']],
    'nvcsw': [0x398, ['long']],
    'nivcsw': [0x3a0, ['long']],
    'start_time': [0x3a8, ['timespec']],
    'real_start_time': [0x3b8, ['timespec']],
    'min_flt': [0x3c8, ['long']],
    'maj_flt': [0x3d0, ['long']],
    'cputime_expires': [0x3d8, ['task_cputime']],
    'cpu_timers': [0x3f0, ['array', 3, ['list_head']]],
    'real_cred': [0x420, ['pointer', ['cred']]],
    'cred': [0x428, ['pointer', ['cred']]],
    'replacement_session_keyring': [0x430, ['pointer', ['cred']]],
    'comm': [0x438, ['array', 16, ['char']]],
    'link_count': [0x448, ['int']],
    'total_link_count': [0x44c, ['int']],
    'sysvsem': [0x450, ['sysv_sem']],
    'last_switch_count': [0x458, ['long']],
    'thread': [0x460, ['thread_struct']],
    'fs': [0x510, ['pointer', ['fs_struct']]],
    'files': [0x518, ['pointer', ['files_struct']]],
    'nsproxy': [0x520, ['pointer', ['nsproxy']]],
    'signal': [0x528, ['pointer', ['signal_struct']]],
    'sighand': [0x530, ['pointer', ['sighand_struct']]],
    'blocked': [0x538, ['__unnamed_0x9f9c']],
    'real_blocked': [0x540, ['__unnamed_0x9f9c']],
    'saved_sigmask': [0x548, ['__unnamed_0x9f9c']],
    'pending': [0x550, ['sigpending']],
    'sas_ss_sp': [0x568, ['long']],
    'sas_ss_size': [0x570, ['long']],
    'notifier': [0x578, ['pointer', ['void']]],
    'notifier_data': [0x580, ['pointer', ['void']]],
    'notifier_mask': [0x588, ['pointer', ['__unnamed_0x9f9c']]],
    'audit_context': [0x590, ['pointer', ['audit_context']]],
    'loginuid': [0x598, ['unsigned int']],
    'sessionid': [0x59c, ['unsigned int']],
    'seccomp': [0x5a0, ['__unnamed_0xa3fa']],
    'parent_exec_id': [0x5a4, ['unsigned int']],
    'self_exec_id': [0x5a8, ['unsigned int']],
    'alloc_lock': [0x5ac, ['spinlock']],
    'irqaction': [0x5b0, ['pointer', ['irqaction']]],
    'pi_lock': [0x5b8, ['raw_spinlock']],
    'pi_waiters': [0x5c0, ['plist_head']],
    'pi_blocked_on': [0x5e0, ['pointer', ['rt_mutex_waiter']]],
    'journal_info': [0x5e8, ['pointer', ['void']]],
    'bio_list': [0x5f0, ['pointer', ['bio_list']]],
    'reclaim_state': [0x5f8, ['pointer', ['reclaim_state']]],
    'backing_dev_info': [0x600, ['pointer', ['backing_dev_info']]],
    'io_context': [0x608, ['pointer', ['io_context']]],
    'ptrace_message': [0x610, ['long']],
    'last_siginfo': [0x618, ['pointer', ['siginfo']]],
    'ioac': [0x620, ['task_io_accounting']],
    'acct_rss_mem1': [0x658, ['unsigned long long']],
    'acct_vm_mem1': [0x660, ['unsigned long long']],
    'acct_timexpd': [0x668, ['long']],
    'mems_allowed': [0x670, ['__unnamed_0x34e6']],
    'mems_allowed_change_disable': [0x678, ['int']],
    'cpuset_mem_spread_rotor': [0x67c, ['int']],
    'cpuset_slab_spread_rotor': [0x680, ['int']],
    'cgroups': [0x688, ['pointer', ['css_set']]],
    'cg_list': [0x690, ['list_head']],
    'robust_list': [0x6a0, ['pointer', ['robust_list_head']]],
    'compat_robust_list': [0x6a8, ['pointer', ['compat_robust_list_head']]],
    'pi_state_list': [0x6b0, ['list_head']],
    'pi_state_cache': [0x6c0, ['pointer', ['futex_pi_state']]],
    'perf_event_ctxp': [0x6c8, ['array', 2, ['pointer', ['perf_event_context']]]],
    'perf_event_mutex': [0x6d8, ['mutex']],
    'perf_event_list': [0x6f8, ['list_head']],
    'mempolicy': [0x708, ['pointer', ['mempolicy']]],
    'il_next': [0x710, ['short']],
    'fs_excl': [0x714, ['__unnamed_0x38e']],
    'rcu': [0x718, ['rcu_head']],
    'splice_pipe': [0x728, ['pointer', ['pipe_inode_info']]],
    'delays': [0x730, ['pointer', ['task_delay_info']]],
    'dirties': [0x738, ['prop_local_single']],
    'latency_record_count': [0x750, ['int']],
    'latency_record': [0x758, ['array', 32, ['latency_record']]],
    'timer_slack_ns': [0x1658, ['long']],
    'default_timer_slack_ns': [0x1660, ['long']],
    'scm_work_list': [0x1668, ['pointer', ['list_head']]],
    'trace': [0x1670, ['long']],
    'trace_recursion': [0x1678, ['long']],
    'memcg_batch': [0x1680, ['memcg_batch_info']],
    'ptrace_bp_refcnt': [0x16a0, ['__unnamed_0x38e']],
}],
  'log': [ 0x10, {
    'ts_nsec': [0x0, ['unsigned long long']],
    'len': [0x8, ['unsigned short']],
    'text_len': [0xa, ['unsigned short']],
    'dict_len': [0xc, ['unsigned short']],
    'facility': [0xe, ['unsigned char']],
    'level': [0xf, ['BitField', {'end_bit': 8, 'start_bit': 5}]],
    'flags': [0xf, ['BitField', {'end_bit': 5, 'start_bit': 0}]],
}],
  'kset': [ 0x60, {
    'list': [0x0, ['list_head']],
    'list_lock': [0x10, ['spinlock']],
    'kobj': [0x18, ['kobject']],
    'uevent_ops': [0x58, ['pointer', ['kset_uevent_ops']]],
}],
  'netns_mib': [ 0xc8, {
    'tcp_statistics': [0x0, ['array', 2, ['pointer', ['tcp_mib']]]],
    'ip_statistics': [0x10, ['array', 2, ['pointer', ['ipstats_mib']]]],
    'net_statistics': [0x20, ['array', 2, ['pointer', ['linux_mib']]]],
    'udp_statistics': [0x30, ['array', 2, ['pointer', ['udp_mib']]]],
    'udplite_statistics': [0x40, ['array', 2, ['pointer', ['udp_mib']]]],
    'icmp_statistics': [0x50, ['array', 2, ['pointer', ['icmp_mib']]]],
    'icmpmsg_statistics': [0x60, ['array', 2, ['pointer', ['icmpmsg_mib']]]],
    'proc_net_devsnmp6': [0x70, ['pointer', ['proc_dir_entry']]],
    'udp_stats_in6': [0x78, ['array', 2, ['pointer', ['udp_mib']]]],
    'udplite_stats_in6': [0x88, ['array', 2, ['pointer', ['udp_mib']]]],
    'ipv6_statistics': [0x98, ['array', 2, ['pointer', ['ipstats_mib']]]],
    'icmpv6_statistics': [0xa8, ['array', 2, ['pointer', ['icmpv6_mib']]]],
    'icmpv6msg_statistics': [0xb8, ['array', 2, ['pointer', ['icmpv6msg_mib']]]],
}],
  'rlimit': [ 0x10, {
    'rlim_cur': [0x0, ['long']],
    'rlim_max': [0x8, ['long']],
}],
  'fib_alias': [ 0x20, {
    'fa_list': [0x0, ['list_head']],
    'fa_info': [0x10, ['pointer', ['fib_info']]],
    'fa_tos': [0x18, ['unsigned char']],
    'fa_type': [0x19, ['unsigned char']],
    'fa_scope': [0x1a, ['unsigned char']],
    'fa_state': [0x1b, ['unsigned char']],
}],
  '__unnamed_0x12344': [ 0x8, {
    'dstats': [0x0, ['pointer', ['pcpu_dstats']]],
    'lstats': [0x0, ['pointer', ['pcpu_lstats']]],
    'tstats': [0x0, ['pointer', ['pcpu_tstats']]],
    'ml_priv': [0x0, ['pointer', ['void']]],
}],
  'sched_entity': [ 0x158, {
    'load': [0x0, ['load_weight']],
    'run_node': [0x10, ['rb_node']],
    'group_node': [0x28, ['list_head']],
    'on_rq': [0x38, ['unsigned int']],
    'exec_start': [0x40, ['unsigned long long']],
    'sum_exec_runtime': [0x48, ['unsigned long long']],
    'vruntime': [0x50, ['unsigned long long']],
    'prev_sum_exec_runtime': [0x58, ['unsigned long long']],
    'nr_migrations': [0x60, ['unsigned long long']],
    'statistics': [0x68, ['sched_statistics']],
    'parent': [0x140, ['pointer', ['sched_entity']]],
    'cfs_rq': [0x148, ['pointer', ['cfs_rq']]],
    'my_q': [0x150, ['pointer', ['cfs_rq']]],
}],
  'neigh_table': [ 0x1f0, {
    'next': [0x0, ['pointer', ['neigh_table']]],
    'family': [0x8, ['int']],
    'entry_size': [0xc, ['int']],
    'key_len': [0x10, ['int']],
    'hash': [0x18, ['pointer', ['void']]],
    'constructor': [0x20, ['pointer', ['void']]],
    'pconstructor': [0x28, ['pointer', ['void']]],
    'pdestructor': [0x30, ['pointer', ['void']]],
    'proxy_redo': [0x38, ['pointer', ['void']]],
    'id': [0x40, ['pointer', ['char']]],
    'parms': [0x48, ['neigh_parms']],
    'gc_interval': [0xd0, ['int']],
    'gc_thresh1': [0xd4, ['int']],
    'gc_thresh2': [0xd8, ['int']],
    'gc_thresh3': [0xdc, ['int']],
    'last_flush': [0xe0, ['long']],
    'gc_work': [0xe8, ['delayed_work']],
    'proxy_timer': [0x158, ['timer_list']],
    'proxy_queue': [0x1a8, ['sk_buff_head']],
    'entries': [0x1c0, ['__unnamed_0x38e']],
    'lock': [0x1c4, ['__unnamed_0x3377']],
    'last_rand': [0x1c8, ['long']],
    'kmem_cachep': [0x1d0, ['pointer', ['kmem_cache']]],
    'stats': [0x1d8, ['pointer', ['neigh_statistics']]],
    'nht': [0x1e0, ['pointer', ['neigh_hash_table']]],
    'phash_buckets': [0x1e8, ['pointer', ['pointer', ['pneigh_entry']]]],
}],
  'arch_spinlock': [ 0x4, {
    'slock': [0x0, ['unsigned int']],
}],
  'ipv6_ac_socklist': [ 0x20, {
    'acl_addr': [0x0, ['in6_addr']],
    'acl_ifindex': [0x10, ['int']],
    'acl_next': [0x18, ['pointer', ['ipv6_ac_socklist']]],
}],
  'i387_fsave_struct': [ 0x70, {
    'cwd': [0x0, ['unsigned int']],
    'swd': [0x4, ['unsigned int']],
    'twd': [0x8, ['unsigned int']],
    'fip': [0xc, ['unsigned int']],
    'fcs': [0x10, ['unsigned int']],
    'foo': [0x14, ['unsigned int']],
    'fos': [0x18, ['unsigned int']],
    'st_space': [0x1c, ['array', 20, ['unsigned int']]],
    'status': [0x6c, ['unsigned int']],
}],
  'dqstats': [ 0x160, {
    'stat': [0x0, ['array', 8, ['int']]],
    'counter': [0x20, ['array', 8, ['percpu_counter']]],
}],
  'kparam_string': [ 0x10, {
    'maxlen': [0x0, ['unsigned int']],
    'string': [0x8, ['pointer', ['char']]],
}],
  'task_io_accounting': [ 0x38, {
    'rchar': [0x0, ['unsigned long long']],
    'wchar': [0x8, ['unsigned long long']],
    'syscr': [0x10, ['unsigned long long']],
    'syscw': [0x18, ['unsigned long long']],
    'read_bytes': [0x20, ['unsigned long long']],
    'write_bytes': [0x28, ['unsigned long long']],
    'cancelled_write_bytes': [0x30, ['unsigned long long']],
}],
  '__unnamed_0xdcce': [ 0x14, {
    'dlci': [0x0, ['unsigned int']],
    'master': [0x4, ['array', 16, ['char']]],
}],
  'driver_attribute': [ 0x20, {
    'attr': [0x0, ['attribute']],
    'show': [0x10, ['pointer', ['void']]],
    'store': [0x18, ['pointer', ['void']]],
}],
  'netns_sysctl_ipv6': [ 0x38, {
    'table': [0x0, ['pointer', ['ctl_table_header']]],
    'frags_hdr': [0x8, ['pointer', ['ctl_table_header']]],
    'bindv6only': [0x10, ['int']],
    'flush_delay': [0x14, ['int']],
    'ip6_rt_max_size': [0x18, ['int']],
    'ip6_rt_gc_min_interval': [0x1c, ['int']],
    'ip6_rt_gc_timeout': [0x20, ['int']],
    'ip6_rt_gc_interval': [0x24, ['int']],
    'ip6_rt_gc_elasticity': [0x28, ['int']],
    'ip6_rt_mtu_expires': [0x2c, ['int']],
    'ip6_rt_min_advmss': [0x30, ['int']],
    'icmpv6_time': [0x34, ['int']],
}],
  '__unnamed_0xdd8f': [ 0x8, {
    'fr': [0x0, ['pointer', ['__unnamed_0xdc36']]],
    'fr_pvc_info': [0x0, ['pointer', ['__unnamed_0xdcce']]],
    'sync': [0x0, ['pointer', ['__unnamed_0xdb7c']]],
    'fr_pvc': [0x0, ['pointer', ['__unnamed_0xdcac']]],
    'te1': [0x0, ['pointer', ['__unnamed_0xdbba']]],
    'cisco': [0x0, ['pointer', ['__unnamed_0xdcfe']]],
    'raw_hdlc': [0x0, ['pointer', ['__unnamed_0xdc06']]],
}],
  'ipv6_fl_socklist': [ 0x10, {
    'next': [0x0, ['pointer', ['ipv6_fl_socklist']]],
    'fl': [0x8, ['pointer', ['ip6_flowlabel']]],
}],
  '__unnamed_0x1be6': [ 0x10, {
    'rip': [0x0, ['unsigned long long']],
    'rdp': [0x8, ['unsigned long long']],
}],
  'pid_namespace': [ 0x840, {
    'kref': [0x0, ['kref']],
    'pidmap': [0x8, ['array', 128, ['pidmap']]],
    'last_pid': [0x808, ['int']],
    'child_reaper': [0x810, ['pointer', ['task_struct']]],
    'pid_cachep': [0x818, ['pointer', ['kmem_cache']]],
    'level': [0x820, ['unsigned int']],
    'parent': [0x828, ['pointer', ['pid_namespace']]],
    'proc_mnt': [0x830, ['pointer', ['vfsmount']]],
    'bacct': [0x838, ['pointer', ['bsd_acct_struct']]],
}],
  'aio_ring_info': [ 0x70, {
    'mmap_base': [0x0, ['long']],
    'mmap_size': [0x8, ['long']],
    'ring_pages': [0x10, ['pointer', ['pointer', ['page']]]],
    'ring_lock': [0x18, ['spinlock']],
    'nr_pages': [0x20, ['long']],
    'nr': [0x28, ['unsigned int']],
    'tail': [0x2c, ['unsigned int']],
    'internal_pages': [0x30, ['array', 8, ['pointer', ['page']]]],
}],
  'address_space_operations': [ 0x90, {
    'writepage': [0x0, ['pointer', ['void']]],
    'readpage': [0x8, ['pointer', ['void']]],
    'sync_page': [0x10, ['pointer', ['void']]],
    'writepages': [0x18, ['pointer', ['void']]],
    'set_page_dirty': [0x20, ['pointer', ['void']]],
    'readpages': [0x28, ['pointer', ['void']]],
    'write_begin': [0x30, ['pointer', ['void']]],
    'write_end': [0x38, ['pointer', ['void']]],
    'bmap': [0x40, ['pointer', ['void']]],
    'invalidatepage': [0x48, ['pointer', ['void']]],
    'releasepage': [0x50, ['pointer', ['void']]],
    'freepage': [0x58, ['pointer', ['void']]],
    'direct_IO': [0x60, ['pointer', ['void']]],
    'get_xip_mem': [0x68, ['pointer', ['void']]],
    'migratepage': [0x70, ['pointer', ['void']]],
    'launder_page': [0x78, ['pointer', ['void']]],
    'is_partially_uptodate': [0x80, ['pointer', ['void']]],
    'error_remove_page': [0x88, ['pointer', ['void']]],
}],
  '__unnamed_0x9c80': [ 0x10, {
    'first_page': [0x0, ['pointer', ['page']]],
    'ptl': [0x0, ['spinlock']],
    'slab': [0x0, ['pointer', ['kmem_cache']]],
    '__unnamed_0x9c88': [0x0, ['__unnamed_0x9c5b']],
}],
  'rb_root': [ 0x8, {
    'rb_node': [0x0, ['pointer', ['rb_node']]],
}],
  '__unnamed_0xe8e2': [ 0x48, {
    'ah_ip4_spec': [0x0, ['ethtool_ah_espip4_spec']],
    'usr_ip4_spec': [0x0, ['ethtool_usrip4_spec']],
    'hdata': [0x0, ['array', 72, ['unsigned char']]],
    'ether_spec': [0x0, ['ethhdr']],
    'udp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
    'esp_ip4_spec': [0x0, ['ethtool_ah_espip4_spec']],
    'sctp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
    'tcp_ip4_spec': [0x0, ['ethtool_tcpip4_spec']],
}],
  'pid': [ 0x50, {
    'count': [0x0, ['__unnamed_0x38e']],
    'level': [0x4, ['unsigned int']],
    'tasks': [0x8, ['array', 3, ['hlist_head']]],
    'rcu': [0x20, ['rcu_head']],
    'numbers': [0x30, ['array', 1, ['upid']]],
}],
  'neigh_parms': [ 0x88, {
    'net': [0x0, ['pointer', ['net']]],
    'dev': [0x8, ['pointer', ['net_device']]],
    'next': [0x10, ['pointer', ['neigh_parms']]],
    'neigh_setup': [0x18, ['pointer', ['void']]],
    'neigh_cleanup': [0x20, ['pointer', ['void']]],
    'tbl': [0x28, ['pointer', ['neigh_table']]],
    'sysctl_table': [0x30, ['pointer', ['void']]],
    'dead': [0x38, ['int']],
    'refcnt': [0x3c, ['__unnamed_0x38e']],
    'rcu_head': [0x40, ['rcu_head']],
    'base_reachable_time': [0x50, ['int']],
    'retrans_time': [0x54, ['int']],
    'gc_staletime': [0x58, ['int']],
    'reachable_time': [0x5c, ['int']],
    'delay_probe_time': [0x60, ['int']],
    'queue_len': [0x64, ['int']],
    'ucast_probes': [0x68, ['int']],
    'app_probes': [0x6c, ['int']],
    'mcast_probes': [0x70, ['int']],
    'anycast_delay': [0x74, ['int']],
    'proxy_delay': [0x78, ['int']],
    'proxy_qlen': [0x7c, ['int']],
    'locktime': [0x80, ['int']],
}],
  'rps_dev_flow': [ 0x8, {
    'cpu': [0x0, ['unsigned short']],
    'fill': [0x2, ['unsigned short']],
    'last_qtail': [0x4, ['unsigned int']],
}],
  'fib_info': [ 0x98, {
    'fib_hash': [0x0, ['pointer', ['void']]],
    'fib_lhash': [0x10, ['pointer', ['void']]],
    'fib_net': [0x20, ['pointer', ['net']]],
    'fib_treeref': [0x28, ['int']],
    'fib_clntref': [0x2c, ['__unnamed_0x38e']],
    'fib_dead': [0x30, ['int']],
    'fib_flags': [0x34, ['unsigned int']],
    'fib_protocol': [0x38, ['int']],
    'fib_prefsrc': [0x3c, ['unsigned int']],
    'fib_priority': [0x40, ['unsigned int']],
    'fib_metrics': [0x44, ['array', 14, ['unsigned int']]],
    'fib_nhs': [0x7c, ['int']],
    'fib_power': [0x80, ['int']],
    'rcu': [0x88, ['rcu_head']],
    'fib_nh': [0x98, ['array', 0, ['fib_nh']]],
}],
  'file': [ 0xc0, {
    'f_u': [0x0, ['__unnamed_0x878b']],
    'f_path': [0x10, ['path']],
    'f_op': [0x20, ['pointer', ['file_operations']]],
    'f_lock': [0x28, ['spinlock']],
    'f_sb_list_cpu': [0x2c, ['int']],
    'f_count': [0x30, ['__unnamed_0x3b0']],
    'f_flags': [0x38, ['unsigned int']],
    'f_mode': [0x3c, ['unsigned int']],
    'f_pos': [0x40, ['long long']],
    'f_owner': [0x48, ['fown_struct']],
    'f_cred': [0x68, ['pointer', ['cred']]],
    'f_ra': [0x70, ['file_ra_state']],
    'f_version': [0x90, ['unsigned long long']],
    'f_security': [0x98, ['pointer', ['void']]],
    'private_data': [0xa0, ['pointer', ['void']]],
    'f_ep_links': [0xa8, ['list_head']],
    'f_mapping': [0xb8, ['pointer', ['address_space']]],
}],
  'mm_struct': [ 0x360, {
    'mmap': [0x0, ['pointer', ['vm_area_struct']]],
    'mm_rb': [0x8, ['rb_root']],
    'mmap_cache': [0x10, ['pointer', ['vm_area_struct']]],
    'get_unmapped_area': [0x18, ['pointer', ['void']]],
    'unmap_area': [0x20, ['pointer', ['void']]],
    'mmap_base': [0x28, ['long']],
    'task_size': [0x30, ['long']],
    'cached_hole_size': [0x38, ['long']],
    'free_area_cache': [0x40, ['long']],
    'pgd': [0x48, ['pointer', ['__unnamed_0x7bc']]],
    'mm_users': [0x50, ['__unnamed_0x38e']],
    'mm_count': [0x54, ['__unnamed_0x38e']],
    'map_count': [0x58, ['int']],
    'mmap_sem': [0x60, ['rw_semaphore']],
    'page_table_lock': [0x80, ['spinlock']],
    'mmlist': [0x88, ['list_head']],
    'hiwater_rss': [0x98, ['long']],
    'hiwater_vm': [0xa0, ['long']],
    'total_vm': [0xa8, ['long']],
    'locked_vm': [0xb0, ['long']],
    'shared_vm': [0xb8, ['long']],
    'exec_vm': [0xc0, ['long']],
    'stack_vm': [0xc8, ['long']],
    'reserved_vm': [0xd0, ['long']],
    'def_flags': [0xd8, ['long']],
    'nr_ptes': [0xe0, ['long']],
    'start_code': [0xe8, ['long']],
    'end_code': [0xf0, ['long']],
    'start_data': [0xf8, ['long']],
    'end_data': [0x100, ['long']],
    'start_brk': [0x108, ['long']],
    'brk': [0x110, ['long']],
    'start_stack': [0x118, ['long']],
    'arg_start': [0x120, ['long']],
    'arg_end': [0x128, ['long']],
    'env_start': [0x130, ['long']],
    'env_end': [0x138, ['long']],
    'saved_auxv': [0x140, ['array', 44, ['long']]],
    'rss_stat': [0x2a0, ['mm_rss_stat']],
    'binfmt': [0x2b8, ['pointer', ['linux_binfmt']]],
    'cpu_vm_mask': [0x2c0, ['cpumask']],
    'context': [0x2c8, ['__unnamed_0x4a34']],
    'faultstamp': [0x300, ['unsigned int']],
    'token_priority': [0x304, ['unsigned int']],
    'last_interval': [0x308, ['unsigned int']],
    'flags': [0x310, ['long']],
    'core_state': [0x318, ['pointer', ['core_state']]],
    'ioctx_lock': [0x320, ['spinlock']],
    'ioctx_list': [0x328, ['hlist_head']],
    'owner': [0x330, ['pointer', ['task_struct']]],
    'exe_file': [0x338, ['pointer', ['file']]],
    'num_exe_file_vmas': [0x340, ['long']],
    'mmu_notifier_mm': [0x348, ['pointer', ['mmu_notifier_mm']]],
    'pmd_huge_pte': [0x350, ['pointer', ['page']]],
    'oom_disable_count': [0x358, ['__unnamed_0x38e']],
}],
  'nfs4_lock_info': [ 0x8, {
    'owner': [0x0, ['pointer', ['nfs4_lock_state']]],
}],
  'ethtool_cmd': [ 0x2c, {
    'cmd': [0x0, ['unsigned int']],
    'supported': [0x4, ['unsigned int']],
    'advertising': [0x8, ['unsigned int']],
    'speed': [0xc, ['unsigned short']],
    'duplex': [0xe, ['unsigned char']],
    'port': [0xf, ['unsigned char']],
    'phy_address': [0x10, ['unsigned char']],
    'transceiver': [0x11, ['unsigned char']],
    'autoneg': [0x12, ['unsigned char']],
    'mdio_support': [0x13, ['unsigned char']],
    'maxtxpkt': [0x14, ['unsigned int']],
    'maxrxpkt': [0x18, ['unsigned int']],
    'speed_hi': [0x1c, ['unsigned short']],
    'eth_tp_mdix': [0x1e, ['unsigned char']],
    'reserved2': [0x1f, ['unsigned char']],
    'lp_advertising': [0x20, ['unsigned int']],
    'reserved': [0x24, ['array', 2, ['unsigned int']]],
}],
  'math_emu_info': [ 0x10, {
    '___orig_eip': [0x0, ['long']],
    '__unnamed_0x413': [0x8, ['__unnamed_0x3d4']],
}],
  '__unnamed_0x8b3a': [ 0x20, {
    'nfs_fl': [0x0, ['nfs_lock_info']],
    'nfs4_fl': [0x0, ['nfs4_lock_info']],
    'afs': [0x0, ['__unnamed_0x8b12']],
}],
  'dev_archdata': [ 0x18, {
    'acpi_handle': [0x0, ['pointer', ['void']]],
    'dma_ops': [0x8, ['pointer', ['dma_map_ops']]],
    'iommu': [0x10, ['pointer', ['void']]],
}],
  'in_ifaddr': [ 0x48, {
    'ifa_next': [0x0, ['pointer', ['in_ifaddr']]],
    'ifa_dev': [0x8, ['pointer', ['in_device']]],
    'rcu_head': [0x10, ['rcu_head']],
    'ifa_local': [0x20, ['unsigned int']],
    'ifa_address': [0x24, ['unsigned int']],
    'ifa_mask': [0x28, ['unsigned int']],
    'ifa_broadcast': [0x2c, ['unsigned int']],
    'ifa_scope': [0x30, ['unsigned char']],
    'ifa_flags': [0x31, ['unsigned char']],
    'ifa_prefixlen': [0x32, ['unsigned char']],
    'ifa_label': [0x33, ['array', 16, ['char']]],
}],
  'netdev_queue': [ 0xc0, {
    'dev': [0x0, ['pointer', ['net_device']]],
    'qdisc': [0x8, ['pointer', ['Qdisc']]],
    'state': [0x10, ['long']],
    'qdisc_sleeping': [0x18, ['pointer', ['Qdisc']]],
    'kobj': [0x20, ['kobject']],
    'numa_node': [0x60, ['int']],
    '_xmit_lock': [0x80, ['spinlock']],
    'xmit_lock_owner': [0x84, ['int']],
    'trans_start': [0x88, ['long']],
}],
  'tss_struct': [ 0x22c0, {
    'x86_tss': [0x0, ['x86_hw_tss']],
    'io_bitmap': [0x80, ['array', 1025, ['unsigned long']]],
    'stack': [0x2088, ['array', 64, ['unsigned long']]],
}],
  'hrtimer': [ 0x60, {
    'node': [0x0, ['timerqueue_node']],
    '_softexpires': [0x20, ['ktime']],
    'function': [0x28, ['pointer', ['void']]],
    'base': [0x30, ['pointer', ['hrtimer_clock_base']]],
    'state': [0x38, ['long']],
    'start_pid': [0x40, ['int']],
    'start_site': [0x48, ['pointer', ['void']]],
    'start_comm': [0x50, ['array', 16, ['char']]],
}],
  'ipv6_txoptions': [ 0x28, {
    'tot_len': [0x0, ['int']],
    'opt_flen': [0x4, ['unsigned short']],
    'opt_nflen': [0x6, ['unsigned short']],
    'hopopt': [0x8, ['pointer', ['ipv6_opt_hdr']]],
    'dst0opt': [0x10, ['pointer', ['ipv6_opt_hdr']]],
    'srcrt': [0x18, ['pointer', ['ipv6_rt_hdr']]],
    'dst1opt': [0x20, ['pointer', ['ipv6_opt_hdr']]],
}],
  '__wait_queue_head': [ 0x18, {
    'lock': [0x0, ['spinlock']],
    'task_list': [0x8, ['list_head']],
}],
  'vm_operations_struct': [ 0x40, {
    'open': [0x0, ['pointer', ['void']]],
    'close': [0x8, ['pointer', ['void']]],
    'fault': [0x10, ['pointer', ['void']]],
    'page_mkwrite': [0x18, ['pointer', ['void']]],
    'access': [0x20, ['pointer', ['void']]],
    'set_policy': [0x28, ['pointer', ['void']]],
    'get_policy': [0x30, ['pointer', ['void']]],
    'migrate': [0x38, ['pointer', ['void']]],
}],
  'iattr': [ 0x50, {
    'ia_valid': [0x0, ['unsigned int']],
    'ia_mode': [0x4, ['unsigned short']],
    'ia_uid': [0x8, ['unsigned int']],
    'ia_gid': [0xc, ['unsigned int']],
    'ia_size': [0x10, ['long long']],
    'ia_atime': [0x18, ['timespec']],
    'ia_mtime': [0x28, ['timespec']],
    'ia_ctime': [0x38, ['timespec']],
    'ia_file': [0x48, ['pointer', ['file']]],
}],
  'thread_group_cred': [ 0x30, {
    'usage': [0x0, ['__unnamed_0x38e']],
    'tgid': [0x4, ['int']],
    'lock': [0x8, ['spinlock']],
    'session_keyring': [0x10, ['pointer', ['key']]],
    'process_keyring': [0x18, ['pointer', ['key']]],
    'rcu': [0x20, ['rcu_head']],
}],
  'files_struct': [ 0x2c0, {
    'count': [0x0, ['__unnamed_0x38e']],
    'fdt': [0x8, ['pointer', ['fdtable']]],
    'fdtab': [0x10, ['fdtable']],
    'file_lock': [0x80, ['spinlock']],
    'next_fd': [0x84, ['int']],
    'close_on_exec_init': [0x88, ['embedded_fd_set']],
    'open_fds_init': [0x90, ['embedded_fd_set']],
    'fd_array': [0x98, ['array', 64, ['pointer', ['file']]]],
}],
  '__unnamed_0x34e6': [ 0x8, {
    'bits': [0x0, ['array', 1, ['long']]],
}],
  'ethtool_stats': [ 0x8, {
    'cmd': [0x0, ['unsigned int']],
    'n_stats': [0x4, ['unsigned int']],
    'data': [0x8, ['array', 0, ['unsigned long long']]],
}],
  'ethtool_flash': [ 0x88, {
    'cmd': [0x0, ['unsigned int']],
    'region': [0x4, ['unsigned int']],
    'data': [0x8, ['array', 128, ['char']]],
}],
}

linux_gvars = {
}
